/* Simple libc header for TCC 
 * 
 * Add any function you want from the libc there. This file is here
 * only for your convenience so that you do not need to put the whole
 * glibc include files on your floppy disk 
 */
#ifndef _TCCLIB_H
#define _TCCLIB_H

#अन्तर्भाव <stddef.h>
#अन्तर्भाव <stdarg.h>

/* stdlib.h */
शून्य *सुस्मृति(माप_प्रकार nmemb, माप_प्रकार size);
शून्य *दो_स्मृति(माप_प्रकार size);
शून्य मुक्त(शून्य *ptr);
शून्य *पुनः_स्मृति(शून्य *ptr, माप_प्रकार size);
पूर्णांक म_से_प(स्थिरांक अक्षर *nptr);
दीर्घ पूर्णांक म_से_दीर्घ(स्थिरांक अक्षर *nptr, अक्षर **endptr, पूर्णांक base);
अचिन्हित दीर्घ पूर्णांक म_से_अदीर्घ(स्थिरांक अक्षर *nptr, अक्षर **endptr, पूर्णांक base);
शून्य निकास(पूर्णांक);
शून्य *alloca(माप_प्रकार);

/* stdio.h */
प्रकारव्याख्या संरचना __FILE खाता;
#define खातापूर्ण (-1)
बाह्य खाता *मानक_निवेश;
बाह्य खाता *मानक_निकास;
बाह्य खाता *मानक_त्रुटि;
खाता *ख_खोलो(स्थिरांक अक्षर *path, स्थिरांक अक्षर *mode);
खाता *fdopen(पूर्णांक fildes, स्थिरांक अक्षर *mode);
खाता *ख_व_खोलो(स्थिरांक  अक्षर *path, स्थिरांक अक्षर *mode, खाता *stream);
पूर्णांक ख_बंद(खाता *stream);
माप_प्रकार  ख_पढ़ो(शून्य *ptr, माप_प्रकार size, माप_प्रकार nmemb, खाता *stream);
माप_प्रकार  ख_डालो(शून्य *ptr, माप_प्रकार size, माप_प्रकार nmemb, खाता *stream);
पूर्णांक ख_अक्षर_लो(खाता *stream);
अक्षर *ख_माला_लो(अक्षर *s, पूर्णांक size, खाता *stream);
पूर्णांक अ_लो(खाता *stream);
पूर्णांक अक्षर_लो(शून्य);
अक्षर *माला_लो(अक्षर *s);
पूर्णांक अक्षर_वापस(पूर्णांक c, खाता *stream);
पूर्णांक ख_साफ(खाता *stream);
पूर्णांक माला_दो(स्थिरांक अक्षर *s);
पूर्णांक अक्षर_दो (पूर्णांक c);

पूर्णांक म_लिखो(स्थिरांक अक्षर *format, ...);
पूर्णांक ख_लिखो(खाता *stream, स्थिरांक अक्षर *format, ...);
पूर्णांक प्र_लिखो(अक्षर *str, स्थिरांक अक्षर *format, ...);
पूर्णांक snprintf(अक्षर *str, माप_प्रकार size, स्थिरांक  अक्षर  *format, ...);
पूर्णांक asprintf(अक्षर **strp, स्थिरांक अक्षर *format, ...);
पूर्णांक dprintf(पूर्णांक fd, स्थिरांक अक्षर *format, ...);
पूर्णांक भ_लिखो(स्थिरांक अक्षर *format, बहु_सूची ap);
पूर्णांक भख_लिखो(खाता  *stream,  स्थिरांक  अक्षर *format, बहु_सूची ap);
पूर्णांक भम_लिखो(अक्षर *str, स्थिरांक अक्षर *format, बहु_सूची ap);
पूर्णांक vsnprintf(अक्षर *str, माप_प्रकार size, स्थिरांक अक्षर  *format, बहु_सूची ap);
पूर्णांक vasprintf(अक्षर  **strp,  स्थिरांक  अक्षर *format, बहु_सूची ap);
पूर्णांक vdprintf(पूर्णांक fd, स्थिरांक अक्षर *format, बहु_सूची ap);

शून्य लिखो_त्रुटि(स्थिरांक अक्षर *s);

/* string.h */
अक्षर *म_जोड़ो(अक्षर *dest, स्थिरांक अक्षर *src);
अक्षर *म_अक्षर(स्थिरांक अक्षर *s, पूर्णांक c);
अक्षर *म_खोजप(स्थिरांक अक्षर *s, पूर्णांक c);
अक्षर *म_नकल(अक्षर *dest, स्थिरांक अक्षर *src);
शून्य *स_नकल(शून्य *dest, स्थिरांक शून्य *src, माप_प्रकार n);
शून्य *स_हटाओ(शून्य *dest, स्थिरांक शून्य *src, माप_प्रकार n);
शून्य *स_रखो(शून्य *s, पूर्णांक c, माप_प्रकार n);
अक्षर *strdup(स्थिरांक अक्षर *s);
माप_प्रकार म_माप(स्थिरांक अक्षर *s);

/* dlfcn.h */
#define RTLD_LAZY       0x001
#define RTLD_NOW        0x002
#define RTLD_GLOBAL     0x100

शून्य *dlopen(स्थिरांक अक्षर *filename, पूर्णांक flag);
स्थिरांक अक्षर *dlerror(शून्य);
शून्य *dlsym(शून्य *handle, अक्षर *चिन्ह);
पूर्णांक dlclose(शून्य *handle);

#endif /* _TCCLIB_H */
