/* Simple libc header for TCC 
 * 
 * Add any function you want from the libc there. This file is here
 * only for your convenience so that you do not need to put the whole
 * glibc include files on your floppy disk 
 */
#ifndef _TCCLIB_H
#define _TCCLIB_H

#अन्तर्भाव <stddef.h>
#अन्तर्भाव <stdarg.h>

/* stdlib.h */
शून्य *सुस्मृति(माप_प्रकार nmemb, माप_प्रकार size);
शून्य *दो_स्मृति(माप_प्रकार size);
शून्य मुक्त(शून्य *ptr);
शून्य *पुनः_स्मृति(शून्य *ptr, माप_प्रकार size);
पूर्णाङ्क म_से_प(अचर वर्ण *nptr);
दीर्घ पूर्णाङ्क म_से_दीर्घ(अचर वर्ण *nptr, वर्ण **endptr, पूर्णाङ्क base);
अचिन्हित दीर्घ पूर्णाङ्क म_से_अदीर्घ(अचर वर्ण *nptr, वर्ण **endptr, पूर्णाङ्क base);
शून्य निकास(पूर्णाङ्क);
शून्य *alloca(माप_प्रकार);

/* stdio.h */
प्रकारनिर्देश संरचना __FILE खाता;
#define खातापूर्ण (-1)
बाह्य खाता *मानक_निवेश;
बाह्य खाता *मानक_निकास;
बाह्य खाता *मानक_त्रुटि;
खाता *ख_खोलो(अचर वर्ण *path, अचर वर्ण *mode);
खाता *fdopen(पूर्णाङ्क fildes, अचर वर्ण *mode);
खाता *ख_व_खोलो(अचर  वर्ण *path, अचर वर्ण *mode, खाता *stream);
पूर्णाङ्क ख_बंद(खाता *stream);
माप_प्रकार  ख_पढ़ो(शून्य *ptr, माप_प्रकार size, माप_प्रकार nmemb, खाता *stream);
माप_प्रकार  ख_डालो(शून्य *ptr, माप_प्रकार size, माप_प्रकार nmemb, खाता *stream);
पूर्णाङ्क ख_अक्षर_लो(खाता *stream);
वर्ण *ख_माला_लो(वर्ण *s, पूर्णाङ्क size, खाता *stream);
पूर्णाङ्क अ_लो(खाता *stream);
पूर्णाङ्क अक्षर_लो(शून्य);
वर्ण *माला_लो(वर्ण *s);
पूर्णाङ्क अक्षर_वापस(पूर्णाङ्क c, खाता *stream);
पूर्णाङ्क ख_साफ(खाता *stream);
पूर्णाङ्क माला_दो(अचर वर्ण *s);
पूर्णाङ्क अक्षर_दो (पूर्णाङ्क c);

पूर्णाङ्क म_लिखो(अचर वर्ण *format, ...);
पूर्णाङ्क ख_लिखो(खाता *stream, अचर वर्ण *format, ...);
पूर्णाङ्क प्र_लिखो(वर्ण *str, अचर वर्ण *format, ...);
पूर्णाङ्क snprintf(वर्ण *str, माप_प्रकार size, अचर  वर्ण  *format, ...);
पूर्णाङ्क asprintf(वर्ण **strp, अचर वर्ण *format, ...);
पूर्णाङ्क dprintf(पूर्णाङ्क fd, अचर वर्ण *format, ...);
पूर्णाङ्क भ_लिखो(अचर वर्ण *format, बहु_सूची ap);
पूर्णाङ्क भख_लिखो(खाता  *stream,  अचर  वर्ण *format, बहु_सूची ap);
पूर्णाङ्क भम_लिखो(वर्ण *str, अचर वर्ण *format, बहु_सूची ap);
पूर्णाङ्क vsnprintf(वर्ण *str, माप_प्रकार size, अचर वर्ण  *format, बहु_सूची ap);
पूर्णाङ्क vasprintf(वर्ण  **strp,  अचर  वर्ण *format, बहु_सूची ap);
पूर्णाङ्क vdprintf(पूर्णाङ्क fd, अचर वर्ण *format, बहु_सूची ap);

शून्य लिखो_त्रुटि(अचर वर्ण *s);

/* string.h */
वर्ण *म_जोड़ो(वर्ण *dest, अचर वर्ण *src);
वर्ण *म_अक्षर(अचर वर्ण *s, पूर्णाङ्क c);
वर्ण *म_खोजप(अचर वर्ण *s, पूर्णाङ्क c);
वर्ण *म_नकल(वर्ण *dest, अचर वर्ण *src);
शून्य *स_नकल(शून्य *dest, अचर शून्य *src, माप_प्रकार n);
शून्य *स_हटाओ(शून्य *dest, अचर शून्य *src, माप_प्रकार n);
शून्य *स_रखो(शून्य *s, पूर्णाङ्क c, माप_प्रकार n);
वर्ण *strdup(अचर वर्ण *s);
माप_प्रकार म_माप(अचर वर्ण *s);

/* dlfcn.h */
#define RTLD_LAZY       0x001
#define RTLD_NOW        0x002
#define RTLD_GLOBAL     0x100

शून्य *dlopen(अचर वर्ण *filename, पूर्णाङ्क flag);
अचर वर्ण *dlerror(शून्य);
शून्य *dlsym(शून्य *handle, वर्ण *चिह्न);
पूर्णाङ्क dlclose(शून्य *handle);

#endif /* _TCCLIB_H */
