#ಅನ್ತರ್ಭಾವ <stdlib.h>
#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <string.h>

#ವ್ಯಾಖ್ಯಾನಿಸು NB_ITS 1000000
//#define NB_ITS 1
#ವ್ಯಾಖ್ಯಾನಿಸು TAB_ಗಾತ್ರ 100

ಪೂರ್ಣಾಂಕ tab[TAB_ಗಾತ್ರ];
ಪೂರ್ಣಾಂಕ ret_ಮೊತ್ತ;
ಅಕ್ಷರ tab3[256];

ಪೂರ್ಣಾಂಕ test1(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0;
    ಗಾಗಿ(i=0;i<TAB_ಗಾತ್ರ;i++) {
        ಮೊತ್ತ += tab[i];
    }
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* error */
ಪೂರ್ಣಾಂಕ test2(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0;
    ಗಾಗಿ(i=0;i<TAB_ಗಾತ್ರ + 1;i++) {
        ಮೊತ್ತ += tab[i];
    }
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* actually, profiling test */
ಪೂರ್ಣಾಂಕ test3(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ ಮೊತ್ತ;
    ಪೂರ್ಣಾಂಕ i, it;

    ಮೊತ್ತ = 0;
    ಗಾಗಿ(it=0;it<NB_ITS;it++) {
        ಗಾಗಿ(i=0;i<TAB_ಗಾತ್ರ;i++) {
            ಮೊತ್ತ += tab[i];
        }
    }
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* ok */
ಪೂರ್ಣಾಂಕ test4(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0;
    ಪೂರ್ಣಾಂಕ *tab4;

    tab4 = ಸ್ಮರಣೆ_ಕೊಡು(20 * ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
    ಗಾಗಿ(i=0;i<20;i++) {
        ಮೊತ್ತ += tab4[i];
    }
    ಬಿಡುಗಡೆ(tab4);

    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* error */
ಪೂರ್ಣಾಂಕ test5(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0;
    ಪೂರ್ಣಾಂಕ *tab4;

    tab4 = ಸ್ಮರಣೆ_ಕೊಡು(20 * ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
    ಗಾಗಿ(i=0;i<21;i++) {
        ಮೊತ್ತ += tab4[i];
    }
    ಬಿಡುಗಡೆ(tab4);

    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* error */
ಪೂರ್ಣಾಂಕ test6(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0;
    ಪೂರ್ಣಾಂಕ *tab4;
    
    tab4 = ಸ್ಮರಣೆ_ಕೊಡು(20 * ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
    ಬಿಡುಗಡೆ(tab4);
    ಗಾಗಿ(i=0;i<21;i++) {
        ಮೊತ್ತ += tab4[i];
    }

    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* error */
ಪೂರ್ಣಾಂಕ test7(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0;
    ಪೂರ್ಣಾಂಕ *p;

    ಗಾಗಿ(i=0;i<TAB_ಗಾತ್ರ + 1;i++) {
        p = &tab[i];
        ಆದರೆ (i == TAB_ಗಾತ್ರ)
            ಬರೆ("i=%d %x\n", i, p);
        ಮೊತ್ತ += *p;
    }
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* ok */
ಪೂರ್ಣಾಂಕ test8(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0;
    ಪೂರ್ಣಾಂಕ tab[10];

    ಗಾಗಿ(i=0;i<10;i++) {
        ಮೊತ್ತ += tab[i];
    }
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* error */
ಪೂರ್ಣಾಂಕ test9(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0;
    ಅಕ್ಷರ tab[10];

    ಗಾಗಿ(i=0;i<11;i++) {
        ಮೊತ್ತ += tab[i];
    }
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

/* ok */
ಪೂರ್ಣಾಂಕ test10(ಶೂನ್ಯ)
{
    ಅಕ್ಷರ tab[10];
    ಅಕ್ಷರ tab1[10];

    memset(tab, 0, 10);
    ಸ್ಮರಣೆ_ನಕಲು(tab, tab1, 10);
    memmove(tab, tab1, 10);
    ಹಿಂತಿರುಗಿ 0;
}

/* error */
ಪೂರ್ಣಾಂಕ test11(ಶೂನ್ಯ)
{
    ಅಕ್ಷರ tab[10];

    memset(tab, 0, 11);
    ಹಿಂತಿರುಗಿ 0;
}

/* error */
ಪೂರ್ಣಾಂಕ test12(ಶೂನ್ಯ)
{
    ಶೂನ್ಯ *ptr;
    ptr = ಸ್ಮರಣೆ_ಕೊಡು(10);
    ಬಿಡುಗಡೆ(ptr);
    ಬಿಡುಗಡೆ(ptr);
    ಹಿಂತಿರುಗಿ 0;
}

/* error */
ಪೂರ್ಣಾಂಕ test13(ಶೂನ್ಯ)
{
    ಅಕ್ಷರ pad1 = 0;
    ಅಕ್ಷರ tab[10];
    ಅಕ್ಷರ pad2 = 0;
    memset(tab, 'a', ಗಾತ್ರ(tab));
    ಹಿಂತಿರುಗಿ ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(tab);
}

ಪೂರ್ಣಾಂಕ test14(ಶೂನ್ಯ)
{
    ಅಕ್ಷರ *p = alloca(TAB_ಗಾತ್ರ);
    ಗಾತ್ರ_t ret;
    memset(p, 'a', TAB_ಗಾತ್ರ);
    p[TAB_ಗಾತ್ರ-1] = 0;
    ret = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(p);
    ಹಿಂತಿರುಗಿ ret;
}

/* error */
ಪೂರ್ಣಾಂಕ test15(ಶೂನ್ಯ)
{
    ಅಕ್ಷರ *p = alloca(TAB_ಗಾತ್ರ-1);
    ಗಾತ್ರ_t ret;
    memset(p, 'a', TAB_ಗಾತ್ರ);
    p[TAB_ಗಾತ್ರ-1] = 0;
    ret = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(p);
    ಹಿಂತಿರುಗಿ ret;
}

/* ok */
ಪೂರ್ಣಾಂಕ test16()
{
    ಅಕ್ಷರ *demo = "This is only a test.";
    ಅಕ್ಷರ *p, *q;

    p = alloca(16);
    strcpy(p,"12345678901234");

    /* Test alloca embedded in a larger expression */
    ಬರೆ("alloca : %s : %s\n", p, strcpy(q=alloca(ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(demo)+1),demo) );

    ಹಿಂತಿರುಗಿ 0;
}

/* error */
ಪೂರ್ಣಾಂಕ test17()
{
    ಅಕ್ಷರ *demo = "This is only a test.";
    ಅಕ್ಷರ *p, *q;

    p = alloca(16);
    strcpy(p,"12345678901234");

    /* Test alloca embedded in a larger expression */
    ಬರೆ("alloca : %s : %s\n", p, strcpy(q=alloca(ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(demo)),demo) );

    ಹಿಂತಿರುಗಿ 0;
}

ಪೂರ್ಣಾಂಕ test18(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i, ಮೊತ್ತ = 0, n = TAB_ಗಾತ್ರ;
    ಪೂರ್ಣಾಂಕ tab[n];
    ಗಾಗಿ(i=0;i<TAB_ಗಾತ್ರ+1;i++) {
        ಮೊತ್ತ += tab[i];
    }
    ಹಿಂತಿರುಗಿ ಮೊತ್ತ;
}

ಪೂರ್ಣಾಂಕ (*ಕೋಷ್ಟಕ_test[])(ಶೂನ್ಯ) = {
    test1,
    test2,
    test3,
    test4,
    test5,
    test6,
    test7,
    test8,
    test9,
    test10,
    test11,
    test12,
    test13,
    test14,
    test15,
    test16,
    test17,
    test18
};

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv)
{
    ಪೂರ್ಣಾಂಕ i;
    ಅಕ್ಷರ *cp;
    ಪೂರ್ಣಾಂಕ ಸೂಚ್ಯಂಕ;
    ಪೂರ್ಣಾಂಕ (*ftest)(ಶೂನ್ಯ);
    ಪೂರ್ಣಾಂಕ ಸೂಚ್ಯಂಕ_max = ಗಾತ್ರ(ಕೋಷ್ಟಕ_test)/ಗಾತ್ರ(ಕೋಷ್ಟಕ_test[0]);

    /* check bounds checking main arg */
    ಗಾಗಿ (i = 0; i < argc; i++) {
        cp = argv[i];
        ಆಗ (*cp) {
            cp++;
        }
    }

    ಆದರೆ (argc < 2) {
        ಬರೆ(
    	    "test TCC bound checking system\n"
	    "usage: boundtest N\n"
            "  1 <= N <= %d\n", ಸೂಚ್ಯಂಕ_max);
        ನಿರ್ಗಮಿಸು(1);
    }

    ಸೂಚ್ಯಂಕ = 0;
    ಆದರೆ (argc >= 2)
        ಸೂಚ್ಯಂಕ = atoi(argv[1]) - 1;

    ಆದರೆ ((ಸೂಚ್ಯಂಕ < 0) || (ಸೂಚ್ಯಂಕ >= ಸೂಚ್ಯಂಕ_max)) {
        ಬರೆ("N is outside of the valid range (%d)\n", ಸೂಚ್ಯಂಕ);
        ನಿರ್ಗಮಿಸು(2);
    }

    /* well, we also use bounds on this ! */
    ftest = ಕೋಷ್ಟಕ_test[ಸೂಚ್ಯಂಕ];
    ftest();

    ಹಿಂತಿರುಗಿ 0;
}

/*
 * without bound   0.77 s
 * with bounds    4.73
 */  
