#అన్తర్భావ <stdlib.h>
#అన్తర్భావ <stdio.h>
#అన్తర్భావ <string.h>

#నిర్వచించు NB_ITS 1000000
//#define NB_ITS 1
#నిర్వచించు TAB_కొలత 100

పూర్ణాంకం tab[TAB_కొలత];
పూర్ణాంకం ret_కూడిక;
అక్షరం tab3[256];

పూర్ణాంకం test1(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0;
    కొరకు(i=0;i<TAB_కొలత;i++) {
        కూడిక += tab[i];
    }
    తిరిగి కూడిక;
}

/* error */
పూర్ణాంకం test2(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0;
    కొరకు(i=0;i<TAB_కొలత + 1;i++) {
        కూడిక += tab[i];
    }
    తిరిగి కూడిక;
}

/* actually, profiling test */
పూర్ణాంకం test3(శూన్య)
{
    పూర్ణాంకం కూడిక;
    పూర్ణాంకం i, it;

    కూడిక = 0;
    కొరకు(it=0;it<NB_ITS;it++) {
        కొరకు(i=0;i<TAB_కొలత;i++) {
            కూడిక += tab[i];
        }
    }
    తిరిగి కూడిక;
}

/* ok */
పూర్ణాంకం test4(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0;
    పూర్ణాంకం *tab4;

    tab4 = జ్ఞాపకం_ఇవ్వు(20 * పరిమాణం(పూర్ణాంకం));
    కొరకు(i=0;i<20;i++) {
        కూడిక += tab4[i];
    }
    విడుదల(tab4);

    తిరిగి కూడిక;
}

/* error */
పూర్ణాంకం test5(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0;
    పూర్ణాంకం *tab4;

    tab4 = జ్ఞాపకం_ఇవ్వు(20 * పరిమాణం(పూర్ణాంకం));
    కొరకు(i=0;i<21;i++) {
        కూడిక += tab4[i];
    }
    విడుదల(tab4);

    తిరిగి కూడిక;
}

/* error */
పూర్ణాంకం test6(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0;
    పూర్ణాంకం *tab4;
    
    tab4 = జ్ఞాపకం_ఇవ్వు(20 * పరిమాణం(పూర్ణాంకం));
    విడుదల(tab4);
    కొరకు(i=0;i<21;i++) {
        కూడిక += tab4[i];
    }

    తిరిగి కూడిక;
}

/* error */
పూర్ణాంకం test7(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0;
    పూర్ణాంకం *p;

    కొరకు(i=0;i<TAB_కొలత + 1;i++) {
        p = &tab[i];
        ఒకవేళ (i == TAB_కొలత)
            రాయి("i=%d %x\n", i, p);
        కూడిక += *p;
    }
    తిరిగి కూడిక;
}

/* ok */
పూర్ణాంకం test8(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0;
    పూర్ణాంకం tab[10];

    కొరకు(i=0;i<10;i++) {
        కూడిక += tab[i];
    }
    తిరిగి కూడిక;
}

/* error */
పూర్ణాంకం test9(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0;
    అక్షరం tab[10];

    కొరకు(i=0;i<11;i++) {
        కూడిక += tab[i];
    }
    తిరిగి కూడిక;
}

/* ok */
పూర్ణాంకం test10(శూన్య)
{
    అక్షరం tab[10];
    అక్షరం tab1[10];

    memset(tab, 0, 10);
    జ్ఞాపకం_నకలు(tab, tab1, 10);
    memmove(tab, tab1, 10);
    తిరిగి 0;
}

/* error */
పూర్ణాంకం test11(శూన్య)
{
    అక్షరం tab[10];

    memset(tab, 0, 11);
    తిరిగి 0;
}

/* error */
పూర్ణాంకం test12(శూన్య)
{
    శూన్య *ptr;
    ptr = జ్ఞాపకం_ఇవ్వు(10);
    విడుదల(ptr);
    విడుదల(ptr);
    తిరిగి 0;
}

/* error */
పూర్ణాంకం test13(శూన్య)
{
    అక్షరం pad1 = 0;
    అక్షరం tab[10];
    అక్షరం pad2 = 0;
    memset(tab, 'a', పరిమాణం(tab));
    తిరిగి అక్షరశ్రేణి_పొడవు(tab);
}

పూర్ణాంకం test14(శూన్య)
{
    అక్షరం *p = alloca(TAB_కొలత);
    కొలత_t ret;
    memset(p, 'a', TAB_కొలత);
    p[TAB_కొలత-1] = 0;
    ret = అక్షరశ్రేణి_పొడవు(p);
    తిరిగి ret;
}

/* error */
పూర్ణాంకం test15(శూన్య)
{
    అక్షరం *p = alloca(TAB_కొలత-1);
    కొలత_t ret;
    memset(p, 'a', TAB_కొలత);
    p[TAB_కొలత-1] = 0;
    ret = అక్షరశ్రేణి_పొడవు(p);
    తిరిగి ret;
}

/* ok */
పూర్ణాంకం test16()
{
    అక్షరం *demo = "This is only a test.";
    అక్షరం *p, *q;

    p = alloca(16);
    strcpy(p,"12345678901234");

    /* Test alloca embedded in a larger expression */
    రాయి("alloca : %s : %s\n", p, strcpy(q=alloca(అక్షరశ్రేణి_పొడవు(demo)+1),demo) );

    తిరిగి 0;
}

/* error */
పూర్ణాంకం test17()
{
    అక్షరం *demo = "This is only a test.";
    అక్షరం *p, *q;

    p = alloca(16);
    strcpy(p,"12345678901234");

    /* Test alloca embedded in a larger expression */
    రాయి("alloca : %s : %s\n", p, strcpy(q=alloca(అక్షరశ్రేణి_పొడవు(demo)),demo) );

    తిరిగి 0;
}

పూర్ణాంకం test18(శూన్య)
{
    పూర్ణాంకం i, కూడిక = 0, n = TAB_కొలత;
    పూర్ణాంకం tab[n];
    కొరకు(i=0;i<TAB_కొలత+1;i++) {
        కూడిక += tab[i];
    }
    తిరిగి కూడిక;
}

పూర్ణాంకం (*పట్టిక_test[])(శూన్య) = {
    test1,
    test2,
    test3,
    test4,
    test5,
    test6,
    test7,
    test8,
    test9,
    test10,
    test11,
    test12,
    test13,
    test14,
    test15,
    test16,
    test17,
    test18
};

పూర్ణాంకం ప్రధాన(పూర్ణాంకం argc, అక్షరం **argv)
{
    పూర్ణాంకం i;
    అక్షరం *cp;
    పూర్ణాంకం సూచీ;
    పూర్ణాంకం (*ftest)(శూన్య);
    పూర్ణాంకం సూచీ_max = పరిమాణం(పట్టిక_test)/పరిమాణం(పట్టిక_test[0]);

    /* check bounds checking main arg */
    కొరకు (i = 0; i < argc; i++) {
        cp = argv[i];
        అయితే (*cp) {
            cp++;
        }
    }

    ఒకవేళ (argc < 2) {
        రాయి(
    	    "test TCC bound checking system\n"
	    "usage: boundtest N\n"
            "  1 <= N <= %d\n", సూచీ_max);
        నిష్క్రమించు(1);
    }

    సూచీ = 0;
    ఒకవేళ (argc >= 2)
        సూచీ = atoi(argv[1]) - 1;

    ఒకవేళ ((సూచీ < 0) || (సూచీ >= సూచీ_max)) {
        రాయి("N is outside of the valid range (%d)\n", సూచీ);
        నిష్క్రమించు(2);
    }

    /* well, we also use bounds on this ! */
    ftest = పట్టిక_test[సూచీ];
    ftest();

    తిరిగి 0;
}

/*
 * without bound   0.77 s
 * with bounds    4.73
 */  
