#अन्तर्भाव <stdlib.h>
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>

#परिभाषय NB_ITS 1000000
//#define NB_ITS 1
#परिभाषय TAB_आकार 100

पूर्णाङ्क tab[TAB_आकार];
पूर्णाङ्क ret_योग;
वर्ण tab3[256];

पूर्णाङ्क test1(शून्य)
{
    पूर्णाङ्क i, योग = 0;
    प्रति(i=0;i<TAB_आकार;i++) {
        योग += tab[i];
    }
    प्रत्यागम योग;
}

/* error */
पूर्णाङ्क test2(शून्य)
{
    पूर्णाङ्क i, योग = 0;
    प्रति(i=0;i<TAB_आकार + 1;i++) {
        योग += tab[i];
    }
    प्रत्यागम योग;
}

/* actually, profiling test */
पूर्णाङ्क test3(शून्य)
{
    पूर्णाङ्क योग;
    पूर्णाङ्क i, it;

    योग = 0;
    प्रति(it=0;it<NB_ITS;it++) {
        प्रति(i=0;i<TAB_आकार;i++) {
            योग += tab[i];
        }
    }
    प्रत्यागम योग;
}

/* ok */
पूर्णाङ्क test4(शून्य)
{
    पूर्णाङ्क i, योग = 0;
    पूर्णाङ्क *tab4;

    tab4 = स्मृतिं_देहि(20 * परिमाण(पूर्णाङ्क));
    प्रति(i=0;i<20;i++) {
        योग += tab4[i];
    }
    मुक्त(tab4);

    प्रत्यागम योग;
}

/* error */
पूर्णाङ्क test5(शून्य)
{
    पूर्णाङ्क i, योग = 0;
    पूर्णाङ्क *tab4;

    tab4 = स्मृतिं_देहि(20 * परिमाण(पूर्णाङ्क));
    प्रति(i=0;i<21;i++) {
        योग += tab4[i];
    }
    मुक्त(tab4);

    प्रत्यागम योग;
}

/* error */
पूर्णाङ्क test6(शून्य)
{
    पूर्णाङ्क i, योग = 0;
    पूर्णाङ्क *tab4;
    
    tab4 = स्मृतिं_देहि(20 * परिमाण(पूर्णाङ्क));
    मुक्त(tab4);
    प्रति(i=0;i<21;i++) {
        योग += tab4[i];
    }

    प्रत्यागम योग;
}

/* error */
पूर्णाङ्क test7(शून्य)
{
    पूर्णाङ्क i, योग = 0;
    पूर्णाङ्क *p;

    प्रति(i=0;i<TAB_आकार + 1;i++) {
        p = &tab[i];
        यदि (i == TAB_आकार)
            प्रारूप_लिख("i=%d %x\n", i, p);
        योग += *p;
    }
    प्रत्यागम योग;
}

/* ok */
पूर्णाङ्क test8(शून्य)
{
    पूर्णाङ्क i, योग = 0;
    पूर्णाङ्क tab[10];

    प्रति(i=0;i<10;i++) {
        योग += tab[i];
    }
    प्रत्यागम योग;
}

/* error */
पूर्णाङ्क test9(शून्य)
{
    पूर्णाङ्क i, योग = 0;
    वर्ण tab[10];

    प्रति(i=0;i<11;i++) {
        योग += tab[i];
    }
    प्रत्यागम योग;
}

/* ok */
पूर्णाङ्क test10(शून्य)
{
    वर्ण tab[10];
    वर्ण tab1[10];

    स्मृतिं_पूरय(tab, 0, 10);
    स्मृतिं_प्रतिलिख(tab, tab1, 10);
    memmove(tab, tab1, 10);
    प्रत्यागम 0;
}

/* error */
पूर्णाङ्क test11(शून्य)
{
    वर्ण tab[10];

    स्मृतिं_पूरय(tab, 0, 11);
    प्रत्यागम 0;
}

/* error */
पूर्णाङ्क test12(शून्य)
{
    शून्य *ptr;
    ptr = स्मृतिं_देहि(10);
    मुक्त(ptr);
    मुक्त(ptr);
    प्रत्यागम 0;
}

/* error */
पूर्णाङ्क test13(शून्य)
{
    वर्ण pad1 = 0;
    वर्ण tab[10];
    वर्ण pad2 = 0;
    स्मृतिं_पूरय(tab, 'a', परिमाण(tab));
    प्रत्यागम वाक्यदैर्घ्यम्(tab);
}

पूर्णाङ्क test14(शून्य)
{
    वर्ण *p = alloca(TAB_आकार);
    आकार_t ret;
    स्मृतिं_पूरय(p, 'a', TAB_आकार);
    p[TAB_आकार-1] = 0;
    ret = वाक्यदैर्घ्यम्(p);
    प्रत्यागम ret;
}

/* error */
पूर्णाङ्क test15(शून्य)
{
    वर्ण *p = alloca(TAB_आकार-1);
    आकार_t ret;
    स्मृतिं_पूरय(p, 'a', TAB_आकार);
    p[TAB_आकार-1] = 0;
    ret = वाक्यदैर्घ्यम्(p);
    प्रत्यागम ret;
}

/* ok */
पूर्णाङ्क test16()
{
    वर्ण *demo = "This is only a test.";
    वर्ण *p, *q;

    p = alloca(16);
    वाक्यं_प्रतिलिख(p,"12345678901234");

    /* Test alloca embedded in a larger expression */
    प्रारूप_लिख("alloca : %s : %s\n", p, वाक्यं_प्रतिलिख(q=alloca(वाक्यदैर्घ्यम्(demo)+1),demo) );

    प्रत्यागम 0;
}

/* error */
पूर्णाङ्क test17()
{
    वर्ण *demo = "This is only a test.";
    वर्ण *p, *q;

    p = alloca(16);
    वाक्यं_प्रतिलिख(p,"12345678901234");

    /* Test alloca embedded in a larger expression */
    प्रारूप_लिख("alloca : %s : %s\n", p, वाक्यं_प्रतिलिख(q=alloca(वाक्यदैर्घ्यम्(demo)),demo) );

    प्रत्यागम 0;
}

पूर्णाङ्क test18(शून्य)
{
    पूर्णाङ्क i, योग = 0, n = TAB_आकार;
    पूर्णाङ्क tab[n];
    प्रति(i=0;i<TAB_आकार+1;i++) {
        योग += tab[i];
    }
    प्रत्यागम योग;
}

पूर्णाङ्क (*सारणी_test[])(शून्य) = {
    test1,
    test2,
    test3,
    test4,
    test5,
    test6,
    test7,
    test8,
    test9,
    test10,
    test11,
    test12,
    test13,
    test14,
    test15,
    test16,
    test17,
    test18
};

पूर्णाङ्क मुख्यम्(पूर्णाङ्क argc, वर्ण **argv)
{
    पूर्णाङ्क i;
    वर्ण *cp;
    पूर्णाङ्क सूचकांक;
    पूर्णाङ्क (*ftest)(शून्य);
    पूर्णाङ्क सूचकांक_max = परिमाण(सारणी_test)/परिमाण(सारणी_test[0]);

    /* check bounds checking main arg */
    प्रति (i = 0; i < argc; i++) {
        cp = argv[i];
        यावत् (*cp) {
            cp++;
        }
    }

    यदि (argc < 2) {
        प्रारूप_लिख(
    	    "test TCC bound checking system\n"
	    "usage: boundtest N\n"
            "  1 <= N <= %d\n", सूचकांक_max);
        निर्गच्छ(1);
    }

    सूचकांक = 0;
    यदि (argc >= 2)
        सूचकांक = atoi(argv[1]) - 1;

    यदि ((सूचकांक < 0) || (सूचकांक >= सूचकांक_max)) {
        प्रारूप_लिख("N is outside of the valid range (%d)\n", सूचकांक);
        निर्गच्छ(2);
    }

    /* well, we also use bounds on this ! */
    ftest = सारणी_test[सूचकांक];
    ftest();

    प्रत्यागम 0;
}

/*
 * without bound   0.77 s
 * with bounds    4.73
 */  
