#അന്തര്ഭാവ <stdio.h>
#അന്തര്ഭാവ <stdarg.h>

പൂർണ്ണസംഖ്യ compile_errors(ശൂന്യം)
{
#എങ്കിൽ TEST == 1
  {
    /* Not constant */
    സ്ഥിതം പൂർണ്ണസംഖ്യ i = (&"Foobar"[1] - &"Foobar"[0]);
  }
#endif
#എങ്കിൽ TEST == 2
  {
    /* Not constant */
    ഘടന{പൂർണ്ണസംഖ്യ c;}v;
    സ്ഥിതം long i=((അക്ഷരം*)&(v.c)-(അക്ഷരം*)&v);
  }
#endif
#എങ്കിൽ TEST == 3
  {
    /* Not constant */
    സ്ഥിതം സ്ഥിരം short ar[] = { &&l1 - &&l1, &&l2 - &&l1 };
    ശൂന്യം *p = &&l1 + ar[0];
    പോകുക *p;
   l1: തിരികെ 1;
   l2: തിരികെ 2;
  }
#endif
  തിരികെ 0;
}

പൂർണ്ണസംഖ്യ
പ്രധാന(ശൂന്യം)
{
}
