#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <stdarg.h>

ಪೂರ್ಣಾಂಕ compile_errors(ಶೂನ್ಯ)
{
#ಆದರೆ TEST == 1
  {
    /* Not constant */
    ಸ್ಥಿರ ಪೂರ್ಣಾಂಕ i = (&"Foobar"[1] - &"Foobar"[0]);
  }
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ TEST == 2
  {
    /* Not constant */
    ರಚನೆ{ಪೂರ್ಣಾಂಕ c;}v;
    ಸ್ಥಿರ ದೀರ್ಘ i=((ಅಕ್ಷರ*)&(v.c)-(ಅಕ್ಷರ*)&v);
  }
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ TEST == 3
  {
    /* Not constant */
    ಸ್ಥಿರ ಸ್ಥಿರಾಂಕ ಗಿಡ್ಡ ar[] = { &&l1 - &&l1, &&l2 - &&l1 };
    ಶೂನ್ಯ *p = &&l1 + ar[0];
    ಹೋಗು *p;
   l1: ಹಿಂತಿರುಗಿ 1;
   l2: ಹಿಂತಿರುಗಿ 2;
  }
#ಆದರೆ_ಅಂತ್ಯ
  ಹಿಂತಿರುಗಿ 0;
}

ಪೂರ್ಣಾಂಕ
ಮುಖ್ಯ(ಶೂನ್ಯ)
{
}
