#ضمن <stdio.h>
#ضمن <stdarg.h>

صحيح compile_errors(فراغ)
{
#إذا TEST == 1
  {
    /* Not constant */
    ساكن صحيح i = (&"Foobar"[1] - &"Foobar"[0]);
  }
#جيڪڏهن_پورو
#إذا TEST == 2
  {
    /* Not constant */
    بنية{صحيح c;}v;
    ساكن ڊگهو i=((حرف*)&(v.c)-(حرف*)&v);
  }
#جيڪڏهن_پورو
#إذا TEST == 3
  {
    /* Not constant */
    ساكن ثابت ننڍو ar[] = { &&l1 - &&l1, &&l2 - &&l1 };
    فراغ *p = &&l1 + ar[0];
    اذهب *p;
   l1: أرجع 1;
   l2: أرجع 2;
  }
#جيڪڏهن_پورو
  أرجع 0;
}

صحيح
مکيه(فراغ)
{
}
