#अन्तर्भाव <stdio.h>
#अन्तर्भाव <stdarg.h>

पूर्णाङ्क compile_errors(शून्य)
{
#यदि TEST == 1
  {
    /* Not constant */
    स्थिर पूर्णाङ्क i = (&"Foobar"[1] - &"Foobar"[0]);
  }
#यदि_अन्तः
#यदि TEST == 2
  {
    /* Not constant */
    संरचना{पूर्णाङ्क c;}v;
    स्थिर दीर्घ i=((वर्ण*)&(v.c)-(वर्ण*)&v);
  }
#यदि_अन्तः
#यदि TEST == 3
  {
    /* Not constant */
    स्थिर ध्रुव ह्रस्व ar[] = { &&l1 - &&l1, &&l2 - &&l1 };
    शून्य *p = &&l1 + ar[0];
    गच्छ *p;
   l1: प्रत्यागम 1;
   l2: प्रत्यागम 2;
  }
#यदि_अन्तः
  प्रत्यागम 0;
}

पूर्णाङ्क
मुख्यम्(शून्य)
{
}
