#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <stdarg.h>

ਪੂਰਨ compile_errors(ਖਾਲੀ)
{
#ਜੇ TEST == 1
  {
    /* Not constant */
    ਸਥਿਰ ਪੂਰਨ i = (&"Foobar"[1] - &"Foobar"[0]);
  }
#ਜੇ_ਅੰਤ
#ਜੇ TEST == 2
  {
    /* Not constant */
    ਬਣਤਰ{ਪੂਰਨ c;}v;
    ਸਥਿਰ ਲੰਮਾ i=((ਅੱਖਰ*)&(v.c)-(ਅੱਖਰ*)&v);
  }
#ਜੇ_ਅੰਤ
#ਜੇ TEST == 3
  {
    /* Not constant */
    ਸਥਿਰ ਅਚਲ ਛੋਟਾ ar[] = { &&l1 - &&l1, &&l2 - &&l1 };
    ਖਾਲੀ *p = &&l1 + ar[0];
    ਜਾਓ *p;
   l1: ਵਾਪਸ 1;
   l2: ਵਾਪਸ 2;
  }
#ਜੇ_ਅੰਤ
  ਵਾਪਸ 0;
}

ਪੂਰਨ
ਮੁੱਖ(ਖਾਲੀ)
{
}
