#समावेश <stdio.h>
#समावेश <stdarg.h>

पूर्णांक compile_errors(व्योम)
{
#अगर TEST == 1
  {
    /* Not constant */
    अटल पूर्णांक i = (&"Foobar"[1] - &"Foobar"[0]);
  }
#पूर्ण_अगर
#अगर TEST == 2
  {
    /* Not constant */
    काष्ठा{पूर्णांक c;}v;
    अटल दीर्घ i=((अक्षर*)&(v.c)-(अक्षर*)&v);
  }
#पूर्ण_अगर
#अगर TEST == 3
  {
    /* Not constant */
    अटल स्थिर लघु ar[] = { &&l1 - &&l1, &&l2 - &&l1 };
    व्योम *p = &&l1 + ar[0];
    जाओ *p;
   l1: वापस 1;
   l2: वापस 2;
  }
#पूर्ण_अगर
  वापस 0;
}

पूर्णांक
मुख्य(व्योम)
{
}
