#అన్తర్భావ <stdio.h>
#అన్తర్భావ <stdarg.h>

పూర్ణాంకం compile_errors(శూన్య)
{
#ఒకవేళ TEST == 1
  {
    /* Not constant */
    స్థిర పూర్ణాంకం i = (&"Foobar"[1] - &"Foobar"[0]);
  }
#అయితే_ముగింపు
#ఒకవేళ TEST == 2
  {
    /* Not constant */
    నిర్మాణం{పూర్ణాంకం c;}v;
    స్థిర దీర్ఘ i=((అక్షరం*)&(v.c)-(అక్షరం*)&v);
  }
#అయితే_ముగింపు
#ఒకవేళ TEST == 3
  {
    /* Not constant */
    స్థిర స్థిరరాశి పొట్టి ar[] = { &&l1 - &&l1, &&l2 - &&l1 };
    శూన్య *p = &&l1 + ar[0];
    వెళ్ళు *p;
   l1: తిరిగి 1;
   l2: తిరిగి 2;
  }
#అయితే_ముగింపు
  తిరిగి 0;
}

పూర్ణాంకం
ప్రధాన(శూన్య)
{
}
