#समावेश <stdio.h>

/* ------------------------------------------------------- */
#अगर defined test_backtrace_1

व्योम f3()
{
    म_लिखो("* f3()\n"), ख_साफ(मानक_निकास);
    *(व्योम**)0 = 0;
}
व्योम f2()
{
    म_लिखो("* f2()\n"), ख_साफ(मानक_निकास);
    f3();
}
व्योम f1()
{
    म_लिखो("* f1()\n"), ख_साफ(मानक_निकास);
    f2();
}
पूर्णांक मुख्य(पूर्णांक argc, अक्षर **argv)
{
    म_लिखो("* main\n"), ख_साफ(मानक_निकास);
    f1();
    म_लिखो("* exit main\n"), ख_साफ(मानक_निकास);
    वापस 0;
}

/* ------------------------------------------------------- */
#या_अगर defined test_bcheck_1

काष्ठा s { पूर्णांक a,b,c,d,e; };
काष्ठा s s[3];
काष्ठा s *ps = s;
व्योम f1()
{
    म_लिखो("* f1()\n"), ख_साफ(मानक_निकास);
    ps[3] = ps[2];
}
पूर्णांक मुख्य(पूर्णांक argc, अक्षर **argv)
{
    म_लिखो("* main\n"), ख_साफ(मानक_निकास);
    f1();
    म_लिखो("* exit main\n"), ख_साफ(मानक_निकास);
    वापस 0;
}

/* ------------------------------------------------------- */
#या_अगर defined test_tcc_backtrace_2

/* test custom backtrace and 'exit()' redirection */
पूर्णांक tcc_backtrace(स्थिर अक्षर *fmt, ...);
व्योम निकास(पूर्णांक);

व्योम f2()
{
    म_लिखो("* f2()\n");
    म_लिखो("* exit f2\n"), ख_साफ(मानक_निकास);
    निकास(34);
}
व्योम f1()
{
    म_लिखो("* f1()\n"), ख_साफ(मानक_निकास);
    tcc_backtrace("Hello from %s!", "f1");
    f2();
}
पूर्णांक मुख्य(पूर्णांक argc, अक्षर **argv)
{
    म_लिखो("* main\n"), ख_साफ(मानक_निकास);
    f1();
    म_लिखो("* exit main\n"), ख_साफ(मानक_निकास);
    वापस 0;
}

/* ------------------------------------------------------- */
#या_अगर defined test_tcc_backtrace_3

/* this test should be run despite of the exit(34) above */
पूर्णांक मुख्य(पूर्णांक argc, अक्षर **argv)
{
    म_लिखो("* main\n"), ख_साफ(मानक_निकास);
    वापस 1;
}

/* ------------------------------------------------------- */
#अन्यथा
#समावेश <stdlib.h>
#समावेश <string.h>
अक्षर *strdup();
पूर्णांक मुख्य()
{
    अक्षर pad1[10];
    अक्षर a[10];
    अक्षर pad2[10];
    अक्षर b[10];
    अक्षर pad3[10];
    स_रखो (pad1, 0, माप(pad1));
    स_रखो (pad2, 0, माप(pad2));
    स_रखो (pad3, 0, माप(pad3));

    स_रखो (a, 'a', 10);
    a[3] = 0;
    a[9] = 0;
    स_रखो (b, 'b', 10);

#अगर defined test_bcheck_100
    स_नकल(&a[1],&b[0],10);
#या_अगर defined test_bcheck_101
    स_नकल(&a[0],&b[1],10);
#या_अगर defined test_bcheck_102
    स_नकल(&a[0],&a[3],4);
#या_अगर defined test_bcheck_103
    स_नकल(&a[3],&a[0],4);
#या_अगर defined test_bcheck_104
    स_भेद(&b[1],&b[0],10);
#या_अगर defined test_bcheck_105
    स_भेद(&b[0],&b[1],10);
#या_अगर defined test_bcheck_106
    स_हटाओ(&b[1],&b[0],10);
#या_अगर defined test_bcheck_107
    स_हटाओ(&b[0],&b[1],10);
#या_अगर defined test_bcheck_108
    स_रखो(&b[1],'b',10);
#या_अगर defined test_bcheck_109
    म_माप(&b[0]);
#या_अगर defined test_bcheck_110
    म_नकल(&a[7], &a[0]);
#या_अगर defined test_bcheck_111
    म_नकल(&a[0], &b[7]);
#या_अगर defined test_bcheck_112
    म_नकल(&a[0], &a[1]);
#या_अगर defined test_bcheck_113
    म_नकल(&a[2], &a[0]);
#या_अगर defined test_bcheck_114
    म_नकलन(&a[7], &a[0], 10);
#या_अगर defined test_bcheck_115
    म_नकलन(&a[0], &b[7], 10);
#या_अगर defined test_bcheck_116
    म_नकलन(&a[0], &a[1], 10);
#या_अगर defined test_bcheck_117
    म_नकलन(&a[2], &a[0], 10);
#या_अगर defined test_bcheck_118
    म_भेद(&b[2], &b[0]);
#या_अगर defined test_bcheck_119
    म_भेद(&b[0], &b[2]);
#या_अगर defined test_bcheck_120
    म_भेदन(&b[5], &b[0], 10);
#या_अगर defined test_bcheck_121
    म_भेदन(&b[0], &b[5], 10);
#या_अगर defined test_bcheck_122
    म_जोड़ो(&a[7], &a[0]);
#या_अगर defined test_bcheck_123
    म_जोड़ो(&a[0], &b[3]);
#या_अगर defined test_bcheck_124
    म_जोड़ो(&a[0], &a[4]);
#या_अगर defined test_bcheck_125
    म_जोड़ो(&a[3], &a[0]);
#या_अगर defined test_bcheck_126
    म_जोड़न(&a[7], &a[0], 3);
#या_अगर defined test_bcheck_127
    म_जोड़न(&a[0], &b[3], 8);
#या_अगर defined test_bcheck_128
    म_जोड़न(&a[0], &a[4], 3);
#या_अगर defined test_bcheck_129
    म_जोड़न(&a[3], &a[0], 10);
#या_अगर defined test_bcheck_130
    म_अक्षर(&b[0], 'a');
#या_अगर defined test_bcheck_131
    म_खोजप(&b[0], 'a');
#या_अगर defined test_bcheck_132
    मुक्त(strdup(&b[0]));
#पूर्ण_अगर
}
/* ------------------------------------------------------- */
#पूर्ण_अगर
