#अन्तर्भाव <stdio.h>

/* ------------------------------------------------------- */
#यदि defined test_backtrace_1

शून्य f3()
{
    म_लिखो("* f3()\n"), ख_साफ(मानक_निकास);
    *(शून्य**)0 = 0;
}
शून्य f2()
{
    म_लिखो("* f2()\n"), ख_साफ(मानक_निकास);
    f3();
}
शून्य f1()
{
    म_लिखो("* f1()\n"), ख_साफ(मानक_निकास);
    f2();
}
पूर्णाङ्क main(पूर्णाङ्क argc, वर्ण **argv)
{
    म_लिखो("* main\n"), ख_साफ(मानक_निकास);
    f1();
    म_लिखो("* exit main\n"), ख_साफ(मानक_निकास);
    प्रत्यागम 0;
}

/* ------------------------------------------------------- */
#नोचेद्यदि defined test_bcheck_1

संरचना s { पूर्णाङ्क a,b,c,d,e; };
संरचना s s[3];
संरचना s *ps = s;
शून्य f1()
{
    म_लिखो("* f1()\n"), ख_साफ(मानक_निकास);
    ps[3] = ps[2];
}
पूर्णाङ्क main(पूर्णाङ्क argc, वर्ण **argv)
{
    म_लिखो("* main\n"), ख_साफ(मानक_निकास);
    f1();
    म_लिखो("* exit main\n"), ख_साफ(मानक_निकास);
    प्रत्यागम 0;
}

/* ------------------------------------------------------- */
#नोचेद्यदि defined test_tcc_backtrace_2

/* test custom backtrace and 'exit()' redirection */
पूर्णाङ्क tcc_backtrace(ध्रुव वर्ण *fmt, ...);
शून्य निकास(पूर्णाङ्क);

शून्य f2()
{
    म_लिखो("* f2()\n");
    म_लिखो("* exit f2\n"), ख_साफ(मानक_निकास);
    निकास(34);
}
शून्य f1()
{
    म_लिखो("* f1()\n"), ख_साफ(मानक_निकास);
    tcc_backtrace("Hello from %s!", "f1");
    f2();
}
पूर्णाङ्क main(पूर्णाङ्क argc, वर्ण **argv)
{
    म_लिखो("* main\n"), ख_साफ(मानक_निकास);
    f1();
    म_लिखो("* exit main\n"), ख_साफ(मानक_निकास);
    प्रत्यागम 0;
}

/* ------------------------------------------------------- */
#नोचेद्यदि defined test_tcc_backtrace_3

/* this test should be run despite of the exit(34) above */
पूर्णाङ्क main(पूर्णाङ्क argc, वर्ण **argv)
{
    म_लिखो("* main\n"), ख_साफ(मानक_निकास);
    प्रत्यागम 1;
}

/* ------------------------------------------------------- */
#अन्यथा
#अन्तर्भाव <stdlib.h>
#अन्तर्भाव <string.h>
वर्ण *strdup();
पूर्णाङ्क main()
{
    वर्ण pad1[10];
    वर्ण a[10];
    वर्ण pad2[10];
    वर्ण b[10];
    वर्ण pad3[10];
    स_रखो (pad1, 0, परिमाण(pad1));
    स_रखो (pad2, 0, परिमाण(pad2));
    स_रखो (pad3, 0, परिमाण(pad3));

    स_रखो (a, 'a', 10);
    a[3] = 0;
    a[9] = 0;
    स_रखो (b, 'b', 10);

#यदि defined test_bcheck_100
    स_नकल(&a[1],&b[0],10);
#नोचेद्यदि defined test_bcheck_101
    स_नकल(&a[0],&b[1],10);
#नोचेद्यदि defined test_bcheck_102
    स_नकल(&a[0],&a[3],4);
#नोचेद्यदि defined test_bcheck_103
    स_नकल(&a[3],&a[0],4);
#नोचेद्यदि defined test_bcheck_104
    स_भेद(&b[1],&b[0],10);
#नोचेद्यदि defined test_bcheck_105
    स_भेद(&b[0],&b[1],10);
#नोचेद्यदि defined test_bcheck_106
    स_हटाओ(&b[1],&b[0],10);
#नोचेद्यदि defined test_bcheck_107
    स_हटाओ(&b[0],&b[1],10);
#नोचेद्यदि defined test_bcheck_108
    स_रखो(&b[1],'b',10);
#नोचेद्यदि defined test_bcheck_109
    म_माप(&b[0]);
#नोचेद्यदि defined test_bcheck_110
    म_नकल(&a[7], &a[0]);
#नोचेद्यदि defined test_bcheck_111
    म_नकल(&a[0], &b[7]);
#नोचेद्यदि defined test_bcheck_112
    म_नकल(&a[0], &a[1]);
#नोचेद्यदि defined test_bcheck_113
    म_नकल(&a[2], &a[0]);
#नोचेद्यदि defined test_bcheck_114
    म_नकलन(&a[7], &a[0], 10);
#नोचेद्यदि defined test_bcheck_115
    म_नकलन(&a[0], &b[7], 10);
#नोचेद्यदि defined test_bcheck_116
    म_नकलन(&a[0], &a[1], 10);
#नोचेद्यदि defined test_bcheck_117
    म_नकलन(&a[2], &a[0], 10);
#नोचेद्यदि defined test_bcheck_118
    म_भेद(&b[2], &b[0]);
#नोचेद्यदि defined test_bcheck_119
    म_भेद(&b[0], &b[2]);
#नोचेद्यदि defined test_bcheck_120
    म_भेदन(&b[5], &b[0], 10);
#नोचेद्यदि defined test_bcheck_121
    म_भेदन(&b[0], &b[5], 10);
#नोचेद्यदि defined test_bcheck_122
    म_जोड़ो(&a[7], &a[0]);
#नोचेद्यदि defined test_bcheck_123
    म_जोड़ो(&a[0], &b[3]);
#नोचेद्यदि defined test_bcheck_124
    म_जोड़ो(&a[0], &a[4]);
#नोचेद्यदि defined test_bcheck_125
    म_जोड़ो(&a[3], &a[0]);
#नोचेद्यदि defined test_bcheck_126
    म_जोड़न(&a[7], &a[0], 3);
#नोचेद्यदि defined test_bcheck_127
    म_जोड़न(&a[0], &b[3], 8);
#नोचेद्यदि defined test_bcheck_128
    म_जोड़न(&a[0], &a[4], 3);
#नोचेद्यदि defined test_bcheck_129
    म_जोड़न(&a[3], &a[0], 10);
#नोचेद्यदि defined test_bcheck_130
    म_अक्षर(&b[0], 'a');
#नोचेद्यदि defined test_bcheck_131
    म_खोजप(&b[0], 'a');
#नोचेद्यदि defined test_bcheck_132
    मुक्त(strdup(&b[0]));
#endif
}
/* ------------------------------------------------------- */
#endif
