#समावेश <stdio.h>
#समावेश <string.h>
#समावेश <setjmp.h>

#घोषणा TST   पूर्णांक i, a[2], b[2];                \
              क्रम (i = 0; i < 2; i++) a[i] = 0; \
              क्रम (i = 0; i < 2; i++) b[i] = 0

अटल लाँघ_बफ jmp;

अटल व्योम tst1 (व्योम)
{
    TST;
    दीर्घ_लाँघ(jmp, 1);
}

अटल व्योम tst2(व्योम)
{
    लाँघ_बफ jmp;

    बनाओ_लाँघ (jmp);
    TST;
    tst1();
}

अटल व्योम tst3 (लाँघ_बफ loc)
{
    TST;
    दीर्घ_लाँघ(loc, 1);
}

अटल व्योम tst4(लाँघ_बफ loc)
{
    लाँघ_बफ jmp;

    बनाओ_लाँघ (jmp);
    TST;
    tst3(loc);
}

अटल व्योम tst (व्योम)
{
    लाँघ_बफ loc;
    अटल पूर्णांक cnt;

    cnt = 0;
    अगर (बनाओ_लाँघ (jmp) == 0) {
        TST;
        tst2();
    }
    अन्यथा {
        cnt++;
    }
    अगर (बनाओ_लाँघ (loc) == 0) {
        TST;
        tst4(loc);
    }
    अन्यथा {
        cnt++;
    }
    अगर (cnt != 2)
        म_लिखो ("incorrect cnt %d\n", cnt);
}

अटल लाँघ_बफ buf1;
अटल लाँघ_बफ buf2;
अटल पूर्णांक *p;
अटल पूर्णांक n_x = 6;
अटल पूर्णांक g_गणक;

अटल व्योम ढेर (व्योम)
{
    अटल पूर्णांक गणक;
    अटल पूर्णांक way_point1;
    अटल पूर्णांक way_point2;

    गणक = 0;
    way_point1 = 3;
    way_point2 = 2;
    g_गणक = 0;
    अगर (बनाओ_लाँघ (buf1) != 101) {
        पूर्णांक a[n_x];
        g_गणक++;
        p = &a[0];
        अगर (g_गणक < 5)
            दीर्घ_लाँघ (buf1, 2);
        अन्यथा अगर (g_गणक == 5)
            दीर्घ_लाँघ (buf1, 101);
        अन्यथा {
            बनाओ_लाँघ (buf2); 
            दीर्घ_लाँघ (buf1, 101);
        }
    }
    
    way_point1--;

    अगर (गणक == 0) {
        गणक++;
        {
            पूर्णांक a[n_x];
            g_गणक++;
            p = &a[0];
            अगर (g_गणक < 5)
                दीर्घ_लाँघ (buf1, 2);
            अन्यथा अगर (g_गणक == 5)
                दीर्घ_लाँघ (buf1, 101);
            अन्यथा {
                बनाओ_लाँघ (buf2);
                दीर्घ_लाँघ (buf1, 101);
            }
        }
    }

    way_point2--;

    अगर (गणक == 1) {
        गणक++;
        दीर्घ_लाँघ (buf2, 2);
    }

    अगर (!(way_point1 == 0 && way_point2 == 0 &&
          g_गणक == 6 && गणक == 2))
        म_लिखो ("Failed %d %d %d %d\n",
                way_point1, way_point2, g_गणक, गणक);
}

अटल लाँघ_बफ env;
अटल पूर्णांक last_मूल्य;

अटल व्योम jump (पूर्णांक val)
{
    दीर्घ_लाँघ (env, val);
}

अटल व्योम check (व्योम)
{
    पूर्णांक मूल्य;

    last_मूल्य = -1;
    मूल्य = बनाओ_लाँघ (env);
    अगर (मूल्य != last_मूल्य + 1) {
        म_लिखो ("incorrect value %d %d\n",
                मूल्य, last_मूल्य + 1);
        वापस;
    }
    last_मूल्य = मूल्य;
    चयन (मूल्य) {
#अगर !(defined(__FreeBSD__) || defined(__NetBSD__))
    /* longjmp(jmp_buf, 0) not supported */
    हाल 0:
        jump (0);
#पूर्ण_अगर
    शेष:
        अगर (मूल्य < 10)
          jump (मूल्य + 1);
    }
}

पूर्णांक
मुख्य (व्योम)
{
    पूर्णांक i;

    क्रम (i = 0; i < 10;  i++) {
        tst();
        ढेर();
        check();
    }
    वापस 0;
}


