#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>
#अन्तर्भाव <setjmp.h>
#यदि !defined(_WIN32)
#अन्तर्भाव <pthread.h>
#अन्यथा
#अन्तर्भाव <windows.h>
#यदि_अन्तः

#परिभाषय	आकार_2	10
#परिभाषय	गणनम्_4	10

#परिभाषय TST   पूर्णाङ्क i, a[2], b[2];                \
              प्रति (i = 0; i < 2; i++) a[i] = 0; \
              प्रति (i = 0; i < 2; i++) b[i] = 0

स्थिर पूर्णाङ्क गणनम्_2[आकार_2];

स्थिर शून्य tst1 (jmp_buf loc)
{
    TST;
    longjmp(loc, 1);
}

स्थिर शून्य tst2(jmp_buf loc)
{
    jmp_buf jmp;

    setjmp (jmp);
    TST;
    tst1(loc);
}

स्थिर शून्य *tst (शून्य * सूचकांक)
{
    jmp_buf loc;
    पूर्णाङ्क i = *(पूर्णाङ्क *) सूचकांक;
    स्थिर पूर्णाङ्क v[आकार_2];

    प्रति (v[i] = 0; v[i] < गणनम्_4; v[i]++) {
        यदि (setjmp (loc) == 0) {
            TST;
            tst2(loc);
        }
        अन्यथा {
            गणनम्_2[i]++;
        }
        i = *(पूर्णाङ्क *) सूचकांक;
    }
    प्रत्यागम रिक्त;
}

पूर्णाङ्क
मुख्यम् (शून्य)
{
    पूर्णाङ्क i;
#यदि !defined(_WIN32)
    pthread_t id[आकार_2];
#अन्यथा
    HANDLE id[आकार_2];
#यदि_अन्तः
    पूर्णाङ्क सूचकांक[आकार_2];

    प्रति (i = 0; i < आकार_2; i++) {
        सूचकांक[i] = i;
#यदि !defined(_WIN32)
        pthread_create (&id[i], रिक्त, tst, (शून्य *) &सूचकांक[i]);
#अन्यथा
        id[i] = CreateThread(रिक्त, 8192, (LPTHREAD_START_ROUTINE) tst, (शून्य *) &सूचकांक[i], 0, रिक्त);
#यदि_अन्तः
    }
    प्रति (i = 0; i < आकार_2; i++) {
#यदि !defined(_WIN32)
        pthread_join (id[i], रिक्त);
#अन्यथा
        WaitForSingleObject(id[i], INFINITE);
#यदि_अन्तः
    }
    प्रति (i = 0; i < आकार_2; i++) {
        यदि (गणनम्_2[i] != गणनम्_4)
            प्रारूप_लिख ("error: %d %d\n", i, गणनम्_2[i]);
    }
    प्रत्यागम 0;
}
