#అన్తర్భావ <stdio.h>
#అన్తర్భావ <string.h>
#అన్తర్భావ <setjmp.h>
#ఒకవేళ !defined(_WIN32)
#అన్తర్భావ <pthread.h>
#లేకపోతే
#అన్తర్భావ <windows.h>
#అయితే_ముగింపు

#నిర్వచించు	కొలత_2	10
#నిర్వచించు	లెక్క_4	10

#నిర్వచించు TST   పూర్ణాంకం i, a[2], b[2];                \
              కొరకు (i = 0; i < 2; i++) a[i] = 0; \
              కొరకు (i = 0; i < 2; i++) b[i] = 0

స్థిర పూర్ణాంకం లెక్క_2[కొలత_2];

స్థిర శూన్య tst1 (jmp_buf loc)
{
    TST;
    longjmp(loc, 1);
}

స్థిర శూన్య tst2(jmp_buf loc)
{
    jmp_buf jmp;

    setjmp (jmp);
    TST;
    tst1(loc);
}

స్థిర శూన్య *tst (శూన్య * సూచీ)
{
    jmp_buf loc;
    పూర్ణాంకం i = *(పూర్ణాంకం *) సూచీ;
    స్థిర పూర్ణాంకం v[కొలత_2];

    కొరకు (v[i] = 0; v[i] < లెక్క_4; v[i]++) {
        ఒకవేళ (setjmp (loc) == 0) {
            TST;
            tst2(loc);
        }
        లేకపోతే {
            లెక్క_2[i]++;
        }
        i = *(పూర్ణాంకం *) సూచీ;
    }
    తిరిగి ఖాళీ;
}

పూర్ణాంకం
ప్రధాన (శూన్య)
{
    పూర్ణాంకం i;
#ఒకవేళ !defined(_WIN32)
    pthread_t id[కొలత_2];
#లేకపోతే
    HANDLE id[కొలత_2];
#అయితే_ముగింపు
    పూర్ణాంకం సూచీ[కొలత_2];

    కొరకు (i = 0; i < కొలత_2; i++) {
        సూచీ[i] = i;
#ఒకవేళ !defined(_WIN32)
        pthread_create (&id[i], ఖాళీ, tst, (శూన్య *) &సూచీ[i]);
#లేకపోతే
        id[i] = CreateThread(ఖాళీ, 8192, (LPTHREAD_ప్రారంభం_ROUTINE) tst, (శూన్య *) &సూచీ[i], 0, ఖాళీ);
#అయితే_ముగింపు
    }
    కొరకు (i = 0; i < కొలత_2; i++) {
#ఒకవేళ !defined(_WIN32)
        pthread_join (id[i], ఖాళీ);
#లేకపోతే
        WaitForSingleObject(id[i], INFINITE);
#అయితే_ముగింపు
    }
    కొరకు (i = 0; i < కొలత_2; i++) {
        ఒకవేళ (లెక్క_2[i] != లెక్క_4)
            రాయి ("error: %d %d\n", i, లెక్క_2[i]);
    }
    తిరిగి 0;
}
