#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <string.h>
#ಅನ್ತರ್ಭಾವ <setjmp.h>
#ಆದರೆ !defined(_WIN32)
#ಅನ್ತರ್ಭಾವ <pthread.h>
#ಇಲ್ಲದಿದ್ದರೆ
#ಅನ್ತರ್ಭಾವ <windows.h>
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿಸು	ಗಾತ್ರ_3	10
#ವ್ಯಾಖ್ಯಾನಿಸು	ಎಣಿಕೆ_5	10

#ವ್ಯಾಖ್ಯಾನಿಸು TST   ಪೂರ್ಣಾಂಕ i, a[2], b[2];                \
              ಗಾಗಿ (i = 0; i < 2; i++) a[i] = 0; \
              ಗಾಗಿ (i = 0; i < 2; i++) b[i] = 0

ಸ್ಥಿರ ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_3[ಗಾತ್ರ_3];

ಸ್ಥಿರ ಶೂನ್ಯ tst1 (jmp_buf loc)
{
    TST;
    longjmp(loc, 1);
}

ಸ್ಥಿರ ಶೂನ್ಯ tst2(jmp_buf loc)
{
    jmp_buf jmp;

    setjmp (jmp);
    TST;
    tst1(loc);
}

ಸ್ಥಿರ ಶೂನ್ಯ *tst (ಶೂನ್ಯ * ಸೂಚ್ಯಂಕ)
{
    jmp_buf loc;
    ಪೂರ್ಣಾಂಕ i = *(ಪೂರ್ಣಾಂಕ *) ಸೂಚ್ಯಂಕ;
    ಸ್ಥಿರ ಪೂರ್ಣಾಂಕ v[ಗಾತ್ರ_3];

    ಗಾಗಿ (v[i] = 0; v[i] < ಎಣಿಕೆ_5; v[i]++) {
        ಆದರೆ (setjmp (loc) == 0) {
            TST;
            tst2(loc);
        }
        ಇಲ್ಲದಿದ್ದರೆ {
            ಎಣಿಕೆ_3[i]++;
        }
        i = *(ಪೂರ್ಣಾಂಕ *) ಸೂಚ್ಯಂಕ;
    }
    ಹಿಂತಿರುಗಿ ಖಾಲಿ;
}

ಪೂರ್ಣಾಂಕ
ಮುಖ್ಯ (ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i;
#ಆದರೆ !defined(_WIN32)
    pthread_t id[ಗಾತ್ರ_3];
#ಇಲ್ಲದಿದ್ದರೆ
    HANDLE id[ಗಾತ್ರ_3];
#ಆದರೆ_ಅಂತ್ಯ
    ಪೂರ್ಣಾಂಕ ಸೂಚ್ಯಂಕ[ಗಾತ್ರ_3];

    ಗಾಗಿ (i = 0; i < ಗಾತ್ರ_3; i++) {
        ಸೂಚ್ಯಂಕ[i] = i;
#ಆದರೆ !defined(_WIN32)
        pthread_create (&id[i], ಖಾಲಿ, tst, (ಶೂನ್ಯ *) &ಸೂಚ್ಯಂಕ[i]);
#ಇಲ್ಲದಿದ್ದರೆ
        id[i] = CreateThread(ಖಾಲಿ, 8192, (LPTHREAD_ಆರಂಭ_ROUTINE) tst, (ಶೂನ್ಯ *) &ಸೂಚ್ಯಂಕ[i], 0, ಖಾಲಿ);
#ಆದರೆ_ಅಂತ್ಯ
    }
    ಗಾಗಿ (i = 0; i < ಗಾತ್ರ_3; i++) {
#ಆದರೆ !defined(_WIN32)
        pthread_join (id[i], ಖಾಲಿ);
#ಇಲ್ಲದಿದ್ದರೆ
        WaitForSingleObject(id[i], INFINITE);
#ಆದರೆ_ಅಂತ್ಯ
    }
    ಗಾಗಿ (i = 0; i < ಗಾತ್ರ_3; i++) {
        ಆದರೆ (ಎಣಿಕೆ_3[i] != ಎಣಿಕೆ_5)
            ಬರೆ ("error: %d %d\n", i, ಎಣಿಕೆ_3[i]);
    }
    ಹಿಂತಿರುಗಿ 0;
}
