#समावेश <stdio.h>
#समावेश <string.h>
#समावेश <setjmp.h>
#अगर !defined(_WIN32)
#समावेश <pthread.h>
#अन्यथा
#समावेश <windows.h>
#पूर्ण_अगर

#घोषणा	आकार_2	10
#घोषणा	गिनती_4	10

#घोषणा TST   पूर्णांक i, a[2], b[2];                \
              क्रम (i = 0; i < 2; i++) a[i] = 0; \
              क्रम (i = 0; i < 2; i++) b[i] = 0

अटल पूर्णांक गिनती_2[आकार_2];

अटल व्योम tst1 (लाँघ_बफ loc)
{
    TST;
    दीर्घ_लाँघ(loc, 1);
}

अटल व्योम tst2(लाँघ_बफ loc)
{
    लाँघ_बफ jmp;

    बनाओ_लाँघ (jmp);
    TST;
    tst1(loc);
}

अटल व्योम *tst (व्योम * सूचकांक)
{
    लाँघ_बफ loc;
    पूर्णांक i = *(पूर्णांक *) सूचकांक;
    अटल पूर्णांक v[आकार_2];

    क्रम (v[i] = 0; v[i] < गिनती_4; v[i]++) {
        अगर (बनाओ_लाँघ (loc) == 0) {
            TST;
            tst2(loc);
        }
        अन्यथा {
            गिनती_2[i]++;
        }
        i = *(पूर्णांक *) सूचकांक;
    }
    वापस शून्य;
}

पूर्णांक
मुख्य (व्योम)
{
    पूर्णांक i;
#अगर !defined(_WIN32)
    pthread_t id[आकार_2];
#अन्यथा
    HANDLE id[आकार_2];
#पूर्ण_अगर
    पूर्णांक सूचकांक[आकार_2];

    क्रम (i = 0; i < आकार_2; i++) {
        सूचकांक[i] = i;
#अगर !defined(_WIN32)
        pthread_create (&id[i], शून्य, tst, (व्योम *) &सूचकांक[i]);
#अन्यथा
        id[i] = CreateThread(शून्य, 8192, (LPTHREAD_START_ROUTINE) tst, (व्योम *) &सूचकांक[i], 0, शून्य);
#पूर्ण_अगर
    }
    क्रम (i = 0; i < आकार_2; i++) {
#अगर !defined(_WIN32)
        pthread_join (id[i], शून्य);
#अन्यथा
        WaitForSingleObject(id[i], INFINITE);
#पूर्ण_अगर
    }
    क्रम (i = 0; i < आकार_2; i++) {
        अगर (गिनती_2[i] != गिनती_4)
            म_लिखो ("error: %d %d\n", i, गिनती_2[i]);
    }
    वापस 0;
}
