#समावेश <limits.h>
#समावेश <stdio.h>
#समावेश <stdlib.h>

पूर्णांक ibdg(दीर्घ दीर्घ n)
{
    चयन (n) {
    हाल                     1LL ...                   9LL: वापस 1;
    हाल                    10LL ...                  99LL: वापस 2;
    हाल                   100LL ...                 999LL: वापस 3;
    हाल                  1000LL ...                9999LL: वापस 4;
    हाल                 10000LL ...               99999LL: वापस 5;
    हाल                100000LL ...              999999LL: वापस 6;
    हाल               1000000LL ...             9999999LL: वापस 7;
    हाल              10000000LL ...            99999999LL: वापस 8;
    हाल             100000000LL ...           999999999LL: वापस 9;
    हाल            1000000000LL ...          9999999999LL: वापस 10;
    हाल           10000000000LL ...         99999999999LL: वापस 11;
    हाल          100000000000LL ...        999999999999LL: वापस 12;
    हाल         1000000000000LL ...       9999999999999LL: वापस 13;
    हाल        10000000000000LL ...      99999999999999LL: वापस 14;
    हाल       100000000000000LL ...     999999999999999LL: वापस 15;
    हाल      1000000000000000LL ...    9999999999999999LL: वापस 16;
    हाल     10000000000000000LL ...   99999999999999999LL: वापस 17;
    हाल    100000000000000000LL ...  999999999999999999LL: वापस 18;
    हाल   1000000000000000000LL ... 9223372036854775807LL: वापस 19;
    हाल  -9223372036854775807LL-1LL ...              -1LL: वापस 20;
    }
    वापस 0;
}

पूर्णांक ubdg(अचिन्हित दीर्घ दीर्घ n)
{
    चयन (n) {
    हाल                    1ULL ...                    9ULL: वापस 1;
    हाल                   10ULL ...                   99ULL: वापस 2;
    हाल                  100ULL ...                  999ULL: वापस 3;
    हाल                 1000ULL ...                 9999ULL: वापस 4;
    हाल                10000ULL ...                99999ULL: वापस 5;
    हाल               100000ULL ...               999999ULL: वापस 6;
    हाल              1000000ULL ...              9999999ULL: वापस 7;
    हाल             10000000ULL ...             99999999ULL: वापस 8;
    हाल            100000000ULL ...            999999999ULL: वापस 9;
    हाल           1000000000ULL ...           9999999999ULL: वापस 10;
    हाल          10000000000ULL ...          99999999999ULL: वापस 11;
    हाल         100000000000ULL ...         999999999999ULL: वापस 12;
    हाल        1000000000000ULL ...        9999999999999ULL: वापस 13;
    हाल       10000000000000ULL ...       99999999999999ULL: वापस 14;
    हाल      100000000000000ULL ...      999999999999999ULL: वापस 15;
    हाल     1000000000000000ULL ...     9999999999999999ULL: वापस 16;
    हाल    10000000000000000ULL ...    99999999999999999ULL: वापस 17;
    हाल   100000000000000000ULL ...   999999999999999999ULL: वापस 18;
    हाल  1000000000000000000ULL ...  9999999999999999999ULL: वापस 19;
    हाल 10000000000000000000ULL ... 18446744073709551615ULL: वापस 20;
    }
    वापस 0;
}

पूर्णांक मुख्य(पूर्णांक argc, अक्षर **argv)
{
    अचिन्हित पूर्णांक i;
    अचिन्हित दीर्घ दीर्घ v = 1;

    v = 1;
    क्रम (i = 1; i <= 20; i++) {
        म_लिखो("%lld : %d\n", (दीर्घ दीर्घ) v, ibdg((दीर्घ दीर्घ)v));
        v *= 10;
    }
    v = 1;
    क्रम (i = 1; i <= 20; i++) {
        म_लिखो("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    वापस 0;
}
