#include <limits.h>
#include <stdio.h>
#include <stdlib.h>

ចំនួនគត់ ibdg(long long n)
{
    switch (n) {
    pak_sa                     1LL ...                   9LL: ត្រឡប់ 1;
    pak_sa                    10LL ...                  99LL: ត្រឡប់ 2;
    pak_sa                   100LL ...                 999LL: ត្រឡប់ 3;
    pak_sa                  1000LL ...                9999LL: ត្រឡប់ 4;
    pak_sa                 10000LL ...               99999LL: ត្រឡប់ 5;
    pak_sa                100000LL ...              999999LL: ត្រឡប់ 6;
    pak_sa               1000000LL ...             9999999LL: ត្រឡប់ 7;
    pak_sa              10000000LL ...            99999999LL: ត្រឡប់ 8;
    pak_sa             100000000LL ...           999999999LL: ត្រឡប់ 9;
    pak_sa            1000000000LL ...          9999999999LL: ត្រឡប់ 10;
    pak_sa           10000000000LL ...         99999999999LL: ត្រឡប់ 11;
    pak_sa          100000000000LL ...        999999999999LL: ត្រឡប់ 12;
    pak_sa         1000000000000LL ...       9999999999999LL: ត្រឡប់ 13;
    pak_sa        10000000000000LL ...      99999999999999LL: ត្រឡប់ 14;
    pak_sa       100000000000000LL ...     999999999999999LL: ត្រឡប់ 15;
    pak_sa      1000000000000000LL ...    9999999999999999LL: ត្រឡប់ 16;
    pak_sa     10000000000000000LL ...   99999999999999999LL: ត្រឡប់ 17;
    pak_sa    100000000000000000LL ...  999999999999999999LL: ត្រឡប់ 18;
    pak_sa   1000000000000000000LL ... 9223372036854775807LL: ត្រឡប់ 19;
    pak_sa  -9223372036854775807LL-1LL ...              -1LL: ត្រឡប់ 20;
    }
    ត្រឡប់ 0;
}

ចំនួនគត់ ubdg(unsigned long long n)
{
    switch (n) {
    pak_sa                    1ULL ...                    9ULL: ត្រឡប់ 1;
    pak_sa                   10ULL ...                   99ULL: ត្រឡប់ 2;
    pak_sa                  100ULL ...                  999ULL: ត្រឡប់ 3;
    pak_sa                 1000ULL ...                 9999ULL: ត្រឡប់ 4;
    pak_sa                10000ULL ...                99999ULL: ត្រឡប់ 5;
    pak_sa               100000ULL ...               999999ULL: ត្រឡប់ 6;
    pak_sa              1000000ULL ...              9999999ULL: ត្រឡប់ 7;
    pak_sa             10000000ULL ...             99999999ULL: ត្រឡប់ 8;
    pak_sa            100000000ULL ...            999999999ULL: ត្រឡប់ 9;
    pak_sa           1000000000ULL ...           9999999999ULL: ត្រឡប់ 10;
    pak_sa          10000000000ULL ...          99999999999ULL: ត្រឡប់ 11;
    pak_sa         100000000000ULL ...         999999999999ULL: ត្រឡប់ 12;
    pak_sa        1000000000000ULL ...        9999999999999ULL: ត្រឡប់ 13;
    pak_sa       10000000000000ULL ...       99999999999999ULL: ត្រឡប់ 14;
    pak_sa      100000000000000ULL ...      999999999999999ULL: ត្រឡប់ 15;
    pak_sa     1000000000000000ULL ...     9999999999999999ULL: ត្រឡប់ 16;
    pak_sa    10000000000000000ULL ...    99999999999999999ULL: ត្រឡប់ 17;
    pak_sa   100000000000000000ULL ...   999999999999999999ULL: ត្រឡប់ 18;
    pak_sa  1000000000000000000ULL ...  9999999999999999999ULL: ត្រឡប់ 19;
    pak_sa 10000000000000000000ULL ... 18446744073709551615ULL: ត្រឡប់ 20;
    }
    ត្រឡប់ 0;
}

ចំនួនគត់ main(ចំនួនគត់ argc, var_na **argv)
{
    unsigned ចំនួនគត់ i;
    unsigned long long v = 1;

    v = 1;
    សម្រាប់ (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    សម្រាប់ (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ត្រឡប់ 0;
}
