#include <limits.h>
#include <stdio.h>
#include <stdlib.h>

ကိန်းပြည့် ibdg(long long n)
{
    switch (n) {
    pak_sa                     1LL ...                   9LL: ပြန်ပေး 1;
    pak_sa                    10LL ...                  99LL: ပြန်ပေး 2;
    pak_sa                   100LL ...                 999LL: ပြန်ပေး 3;
    pak_sa                  1000LL ...                9999LL: ပြန်ပေး 4;
    pak_sa                 10000LL ...               99999LL: ပြန်ပေး 5;
    pak_sa                100000LL ...              999999LL: ပြန်ပေး 6;
    pak_sa               1000000LL ...             9999999LL: ပြန်ပေး 7;
    pak_sa              10000000LL ...            99999999LL: ပြန်ပေး 8;
    pak_sa             100000000LL ...           999999999LL: ပြန်ပေး 9;
    pak_sa            1000000000LL ...          9999999999LL: ပြန်ပေး 10;
    pak_sa           10000000000LL ...         99999999999LL: ပြန်ပေး 11;
    pak_sa          100000000000LL ...        999999999999LL: ပြန်ပေး 12;
    pak_sa         1000000000000LL ...       9999999999999LL: ပြန်ပေး 13;
    pak_sa        10000000000000LL ...      99999999999999LL: ပြန်ပေး 14;
    pak_sa       100000000000000LL ...     999999999999999LL: ပြန်ပေး 15;
    pak_sa      1000000000000000LL ...    9999999999999999LL: ပြန်ပေး 16;
    pak_sa     10000000000000000LL ...   99999999999999999LL: ပြန်ပေး 17;
    pak_sa    100000000000000000LL ...  999999999999999999LL: ပြန်ပေး 18;
    pak_sa   1000000000000000000LL ... 9223372036854775807LL: ပြန်ပေး 19;
    pak_sa  -9223372036854775807LL-1LL ...              -1LL: ပြန်ပေး 20;
    }
    ပြန်ပေး 0;
}

ကိန်းပြည့် ubdg(unsigned long long n)
{
    switch (n) {
    pak_sa                    1ULL ...                    9ULL: ပြန်ပေး 1;
    pak_sa                   10ULL ...                   99ULL: ပြန်ပေး 2;
    pak_sa                  100ULL ...                  999ULL: ပြန်ပေး 3;
    pak_sa                 1000ULL ...                 9999ULL: ပြန်ပေး 4;
    pak_sa                10000ULL ...                99999ULL: ပြန်ပေး 5;
    pak_sa               100000ULL ...               999999ULL: ပြန်ပေး 6;
    pak_sa              1000000ULL ...              9999999ULL: ပြန်ပေး 7;
    pak_sa             10000000ULL ...             99999999ULL: ပြန်ပေး 8;
    pak_sa            100000000ULL ...            999999999ULL: ပြန်ပေး 9;
    pak_sa           1000000000ULL ...           9999999999ULL: ပြန်ပေး 10;
    pak_sa          10000000000ULL ...          99999999999ULL: ပြန်ပေး 11;
    pak_sa         100000000000ULL ...         999999999999ULL: ပြန်ပေး 12;
    pak_sa        1000000000000ULL ...        9999999999999ULL: ပြန်ပေး 13;
    pak_sa       10000000000000ULL ...       99999999999999ULL: ပြန်ပေး 14;
    pak_sa      100000000000000ULL ...      999999999999999ULL: ပြန်ပေး 15;
    pak_sa     1000000000000000ULL ...     9999999999999999ULL: ပြန်ပေး 16;
    pak_sa    10000000000000000ULL ...    99999999999999999ULL: ပြန်ပေး 17;
    pak_sa   100000000000000000ULL ...   999999999999999999ULL: ပြန်ပေး 18;
    pak_sa  1000000000000000000ULL ...  9999999999999999999ULL: ပြန်ပေး 19;
    pak_sa 10000000000000000000ULL ... 18446744073709551615ULL: ပြန်ပေး 20;
    }
    ပြန်ပေး 0;
}

ကိန်းပြည့် main(ကိန်းပြည့် argc, var_na **argv)
{
    unsigned ကိန်းပြည့် i;
    unsigned long long v = 1;

    v = 1;
    အတွက် (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    အတွက် (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ပြန်ပေး 0;
}
