#include <limits.h>
#include <stdio.h>
#include <stdlib.h>

整数 ibdg(long long n)
{
    switch (n) {
    case                     1LL ...                   9LL: 戻る 1;
    case                    10LL ...                  99LL: 戻る 2;
    case                   100LL ...                 999LL: 戻る 3;
    case                  1000LL ...                9999LL: 戻る 4;
    case                 10000LL ...               99999LL: 戻る 5;
    case                100000LL ...              999999LL: 戻る 6;
    case               1000000LL ...             9999999LL: 戻る 7;
    case              10000000LL ...            99999999LL: 戻る 8;
    case             100000000LL ...           999999999LL: 戻る 9;
    case            1000000000LL ...          9999999999LL: 戻る 10;
    case           10000000000LL ...         99999999999LL: 戻る 11;
    case          100000000000LL ...        999999999999LL: 戻る 12;
    case         1000000000000LL ...       9999999999999LL: 戻る 13;
    case        10000000000000LL ...      99999999999999LL: 戻る 14;
    case       100000000000000LL ...     999999999999999LL: 戻る 15;
    case      1000000000000000LL ...    9999999999999999LL: 戻る 16;
    case     10000000000000000LL ...   99999999999999999LL: 戻る 17;
    case    100000000000000000LL ...  999999999999999999LL: 戻る 18;
    case   1000000000000000000LL ... 9223372036854775807LL: 戻る 19;
    case  -9223372036854775807LL-1LL ...              -1LL: 戻る 20;
    }
    戻る 0;
}

整数 ubdg(unsigned long long n)
{
    switch (n) {
    case                    1ULL ...                    9ULL: 戻る 1;
    case                   10ULL ...                   99ULL: 戻る 2;
    case                  100ULL ...                  999ULL: 戻る 3;
    case                 1000ULL ...                 9999ULL: 戻る 4;
    case                10000ULL ...                99999ULL: 戻る 5;
    case               100000ULL ...               999999ULL: 戻る 6;
    case              1000000ULL ...              9999999ULL: 戻る 7;
    case             10000000ULL ...             99999999ULL: 戻る 8;
    case            100000000ULL ...            999999999ULL: 戻る 9;
    case           1000000000ULL ...           9999999999ULL: 戻る 10;
    case          10000000000ULL ...          99999999999ULL: 戻る 11;
    case         100000000000ULL ...         999999999999ULL: 戻る 12;
    case        1000000000000ULL ...        9999999999999ULL: 戻る 13;
    case       10000000000000ULL ...       99999999999999ULL: 戻る 14;
    case      100000000000000ULL ...      999999999999999ULL: 戻る 15;
    case     1000000000000000ULL ...     9999999999999999ULL: 戻る 16;
    case    10000000000000000ULL ...    99999999999999999ULL: 戻る 17;
    case   100000000000000000ULL ...   999999999999999999ULL: 戻る 18;
    case  1000000000000000000ULL ...  9999999999999999999ULL: 戻る 19;
    case 10000000000000000000ULL ... 18446744073709551615ULL: 戻る 20;
    }
    戻る 0;
}

整数 メインページ(整数 argc, char **argv)
{
    unsigned 整数 i;
    unsigned long long v = 1;

    v = 1;
    ために (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    ために (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    戻る 0;
}
