#ಅನ್ತರ್ಭಾವ <limits.h>
#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <stdlib.h>

ಪೂರ್ಣಾಙ್ಕ ibdg(long long n)
{
    ವಿಕಲ್ಪ (n) {
    ಪಕ್ಷ                     1LL ...                   9LL: ಪ್ರತ್ಯಾಗಮ 1;
    ಪಕ್ಷ                    10LL ...                  99LL: ಪ್ರತ್ಯಾಗಮ 2;
    ಪಕ್ಷ                   100LL ...                 999LL: ಪ್ರತ್ಯಾಗಮ 3;
    ಪಕ್ಷ                  1000LL ...                9999LL: ಪ್ರತ್ಯಾಗಮ 4;
    ಪಕ್ಷ                 10000LL ...               99999LL: ಪ್ರತ್ಯಾಗಮ 5;
    ಪಕ್ಷ                100000LL ...              999999LL: ಪ್ರತ್ಯಾಗಮ 6;
    ಪಕ್ಷ               1000000LL ...             9999999LL: ಪ್ರತ್ಯಾಗಮ 7;
    ಪಕ್ಷ              10000000LL ...            99999999LL: ಪ್ರತ್ಯಾಗಮ 8;
    ಪಕ್ಷ             100000000LL ...           999999999LL: ಪ್ರತ್ಯಾಗಮ 9;
    ಪಕ್ಷ            1000000000LL ...          9999999999LL: ಪ್ರತ್ಯಾಗಮ 10;
    ಪಕ್ಷ           10000000000LL ...         99999999999LL: ಪ್ರತ್ಯಾಗಮ 11;
    ಪಕ್ಷ          100000000000LL ...        999999999999LL: ಪ್ರತ್ಯಾಗಮ 12;
    ಪಕ್ಷ         1000000000000LL ...       9999999999999LL: ಪ್ರತ್ಯಾಗಮ 13;
    ಪಕ್ಷ        10000000000000LL ...      99999999999999LL: ಪ್ರತ್ಯಾಗಮ 14;
    ಪಕ್ಷ       100000000000000LL ...     999999999999999LL: ಪ್ರತ್ಯಾಗಮ 15;
    ಪಕ್ಷ      1000000000000000LL ...    9999999999999999LL: ಪ್ರತ್ಯಾಗಮ 16;
    ಪಕ್ಷ     10000000000000000LL ...   99999999999999999LL: ಪ್ರತ್ಯಾಗಮ 17;
    ಪಕ್ಷ    100000000000000000LL ...  999999999999999999LL: ಪ್ರತ್ಯಾಗಮ 18;
    ಪಕ್ಷ   1000000000000000000LL ... 9223372036854775807LL: ಪ್ರತ್ಯಾಗಮ 19;
    ಪಕ್ಷ  -9223372036854775807LL-1LL ...              -1LL: ಪ್ರತ್ಯಾಗಮ 20;
    }
    ಪ್ರತ್ಯಾಗಮ 0;
}

ಪೂರ್ಣಾಙ್ಕ ubdg(unsigned long long n)
{
    ವಿಕಲ್ಪ (n) {
    ಪಕ್ಷ                    1ULL ...                    9ULL: ಪ್ರತ್ಯಾಗಮ 1;
    ಪಕ್ಷ                   10ULL ...                   99ULL: ಪ್ರತ್ಯಾಗಮ 2;
    ಪಕ್ಷ                  100ULL ...                  999ULL: ಪ್ರತ್ಯಾಗಮ 3;
    ಪಕ್ಷ                 1000ULL ...                 9999ULL: ಪ್ರತ್ಯಾಗಮ 4;
    ಪಕ್ಷ                10000ULL ...                99999ULL: ಪ್ರತ್ಯಾಗಮ 5;
    ಪಕ್ಷ               100000ULL ...               999999ULL: ಪ್ರತ್ಯಾಗಮ 6;
    ಪಕ್ಷ              1000000ULL ...              9999999ULL: ಪ್ರತ್ಯಾಗಮ 7;
    ಪಕ್ಷ             10000000ULL ...             99999999ULL: ಪ್ರತ್ಯಾಗಮ 8;
    ಪಕ್ಷ            100000000ULL ...            999999999ULL: ಪ್ರತ್ಯಾಗಮ 9;
    ಪಕ್ಷ           1000000000ULL ...           9999999999ULL: ಪ್ರತ್ಯಾಗಮ 10;
    ಪಕ್ಷ          10000000000ULL ...          99999999999ULL: ಪ್ರತ್ಯಾಗಮ 11;
    ಪಕ್ಷ         100000000000ULL ...         999999999999ULL: ಪ್ರತ್ಯಾಗಮ 12;
    ಪಕ್ಷ        1000000000000ULL ...        9999999999999ULL: ಪ್ರತ್ಯಾಗಮ 13;
    ಪಕ್ಷ       10000000000000ULL ...       99999999999999ULL: ಪ್ರತ್ಯಾಗಮ 14;
    ಪಕ್ಷ      100000000000000ULL ...      999999999999999ULL: ಪ್ರತ್ಯಾಗಮ 15;
    ಪಕ್ಷ     1000000000000000ULL ...     9999999999999999ULL: ಪ್ರತ್ಯಾಗಮ 16;
    ಪಕ್ಷ    10000000000000000ULL ...    99999999999999999ULL: ಪ್ರತ್ಯಾಗಮ 17;
    ಪಕ್ಷ   100000000000000000ULL ...   999999999999999999ULL: ಪ್ರತ್ಯಾಗಮ 18;
    ಪಕ್ಷ  1000000000000000000ULL ...  9999999999999999999ULL: ಪ್ರತ್ಯಾಗಮ 19;
    ಪಕ್ಷ 10000000000000000000ULL ... 18446744073709551615ULL: ಪ್ರತ್ಯಾಗಮ 20;
    }
    ಪ್ರತ್ಯಾಗಮ 0;
}

ಪೂರ್ಣಾಙ್ಕ main(ಪೂರ್ಣಾಙ್ಕ argc, ವರ್ಣ **argv)
{
    unsigned ಪೂರ್ಣಾಙ್ಕ i;
    unsigned long long v = 1;

    v = 1;
    ಪ್ರತಿ (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    ಪ್ರತಿ (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ಪ್ರತ್ಯಾಗಮ 0;
}
