#अन्तर्भाव <limits.h>
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <stdlib.h>

पूर्णांक ibdg(दीर्घ दीर्घ n)
{
    निवड (n) {
    स्थिती                     1LL ...                   9LL: परत 1;
    स्थिती                    10LL ...                  99LL: परत 2;
    स्थिती                   100LL ...                 999LL: परत 3;
    स्थिती                  1000LL ...                9999LL: परत 4;
    स्थिती                 10000LL ...               99999LL: परत 5;
    स्थिती                100000LL ...              999999LL: परत 6;
    स्थिती               1000000LL ...             9999999LL: परत 7;
    स्थिती              10000000LL ...            99999999LL: परत 8;
    स्थिती             100000000LL ...           999999999LL: परत 9;
    स्थिती            1000000000LL ...          9999999999LL: परत 10;
    स्थिती           10000000000LL ...         99999999999LL: परत 11;
    स्थिती          100000000000LL ...        999999999999LL: परत 12;
    स्थिती         1000000000000LL ...       9999999999999LL: परत 13;
    स्थिती        10000000000000LL ...      99999999999999LL: परत 14;
    स्थिती       100000000000000LL ...     999999999999999LL: परत 15;
    स्थिती      1000000000000000LL ...    9999999999999999LL: परत 16;
    स्थिती     10000000000000000LL ...   99999999999999999LL: परत 17;
    स्थिती    100000000000000000LL ...  999999999999999999LL: परत 18;
    स्थिती   1000000000000000000LL ... 9223372036854775807LL: परत 19;
    स्थिती  -9223372036854775807LL-1LL ...              -1LL: परत 20;
    }
    परत 0;
}

पूर्णांक ubdg(अचिन्हित दीर्घ दीर्घ n)
{
    निवड (n) {
    स्थिती                    1ULL ...                    9ULL: परत 1;
    स्थिती                   10ULL ...                   99ULL: परत 2;
    स्थिती                  100ULL ...                  999ULL: परत 3;
    स्थिती                 1000ULL ...                 9999ULL: परत 4;
    स्थिती                10000ULL ...                99999ULL: परत 5;
    स्थिती               100000ULL ...               999999ULL: परत 6;
    स्थिती              1000000ULL ...              9999999ULL: परत 7;
    स्थिती             10000000ULL ...             99999999ULL: परत 8;
    स्थिती            100000000ULL ...            999999999ULL: परत 9;
    स्थिती           1000000000ULL ...           9999999999ULL: परत 10;
    स्थिती          10000000000ULL ...          99999999999ULL: परत 11;
    स्थिती         100000000000ULL ...         999999999999ULL: परत 12;
    स्थिती        1000000000000ULL ...        9999999999999ULL: परत 13;
    स्थिती       10000000000000ULL ...       99999999999999ULL: परत 14;
    स्थिती      100000000000000ULL ...      999999999999999ULL: परत 15;
    स्थिती     1000000000000000ULL ...     9999999999999999ULL: परत 16;
    स्थिती    10000000000000000ULL ...    99999999999999999ULL: परत 17;
    स्थिती   100000000000000000ULL ...   999999999999999999ULL: परत 18;
    स्थिती  1000000000000000000ULL ...  9999999999999999999ULL: परत 19;
    स्थिती 10000000000000000000ULL ... 18446744073709551615ULL: परत 20;
    }
    परत 0;
}

पूर्णांक main(पूर्णांक argc, अक्षर **argv)
{
    अचिन्हित पूर्णांक i;
    अचिन्हित दीर्घ दीर्घ v = 1;

    v = 1;
    साठी (i = 1; i <= 20; i++) {
        म_लिखो("%lld : %d\n", (दीर्घ दीर्घ) v, ibdg((दीर्घ दीर्घ)v));
        v *= 10;
    }
    v = 1;
    साठी (i = 1; i <= 20; i++) {
        म_लिखो("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    परत 0;
}
