#अन्तर्भाव <limits.h>
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <stdlib.h>

पूर्णाङ्क ibdg(long long n)
{
    विकल्प (n) {
    पक्ष                     1LL ...                   9LL: पटिनिवत्त 1;
    पक्ष                    10LL ...                  99LL: पटिनिवत्त 2;
    पक्ष                   100LL ...                 999LL: पटिनिवत्त 3;
    पक्ष                  1000LL ...                9999LL: पटिनिवत्त 4;
    पक्ष                 10000LL ...               99999LL: पटिनिवत्त 5;
    पक्ष                100000LL ...              999999LL: पटिनिवत्त 6;
    पक्ष               1000000LL ...             9999999LL: पटिनिवत्त 7;
    पक्ष              10000000LL ...            99999999LL: पटिनिवत्त 8;
    पक्ष             100000000LL ...           999999999LL: पटिनिवत्त 9;
    पक्ष            1000000000LL ...          9999999999LL: पटिनिवत्त 10;
    पक्ष           10000000000LL ...         99999999999LL: पटिनिवत्त 11;
    पक्ष          100000000000LL ...        999999999999LL: पटिनिवत्त 12;
    पक्ष         1000000000000LL ...       9999999999999LL: पटिनिवत्त 13;
    पक्ष        10000000000000LL ...      99999999999999LL: पटिनिवत्त 14;
    पक्ष       100000000000000LL ...     999999999999999LL: पटिनिवत्त 15;
    पक्ष      1000000000000000LL ...    9999999999999999LL: पटिनिवत्त 16;
    पक्ष     10000000000000000LL ...   99999999999999999LL: पटिनिवत्त 17;
    पक्ष    100000000000000000LL ...  999999999999999999LL: पटिनिवत्त 18;
    पक्ष   1000000000000000000LL ... 9223372036854775807LL: पटिनिवत्त 19;
    पक्ष  -9223372036854775807LL-1LL ...              -1LL: पटिनिवत्त 20;
    }
    पटिनिवत्त 0;
}

पूर्णाङ्क ubdg(unsigned long long n)
{
    विकल्प (n) {
    पक्ष                    1ULL ...                    9ULL: पटिनिवत्त 1;
    पक्ष                   10ULL ...                   99ULL: पटिनिवत्त 2;
    पक्ष                  100ULL ...                  999ULL: पटिनिवत्त 3;
    पक्ष                 1000ULL ...                 9999ULL: पटिनिवत्त 4;
    पक्ष                10000ULL ...                99999ULL: पटिनिवत्त 5;
    पक्ष               100000ULL ...               999999ULL: पटिनिवत्त 6;
    पक्ष              1000000ULL ...              9999999ULL: पटिनिवत्त 7;
    पक्ष             10000000ULL ...             99999999ULL: पटिनिवत्त 8;
    पक्ष            100000000ULL ...            999999999ULL: पटिनिवत्त 9;
    पक्ष           1000000000ULL ...           9999999999ULL: पटिनिवत्त 10;
    पक्ष          10000000000ULL ...          99999999999ULL: पटिनिवत्त 11;
    पक्ष         100000000000ULL ...         999999999999ULL: पटिनिवत्त 12;
    पक्ष        1000000000000ULL ...        9999999999999ULL: पटिनिवत्त 13;
    पक्ष       10000000000000ULL ...       99999999999999ULL: पटिनिवत्त 14;
    पक्ष      100000000000000ULL ...      999999999999999ULL: पटिनिवत्त 15;
    पक्ष     1000000000000000ULL ...     9999999999999999ULL: पटिनिवत्त 16;
    पक्ष    10000000000000000ULL ...    99999999999999999ULL: पटिनिवत्त 17;
    पक्ष   100000000000000000ULL ...   999999999999999999ULL: पटिनिवत्त 18;
    पक्ष  1000000000000000000ULL ...  9999999999999999999ULL: पटिनिवत्त 19;
    पक्ष 10000000000000000000ULL ... 18446744073709551615ULL: पटिनिवत्त 20;
    }
    पटिनिवत्त 0;
}

पूर्णाङ्क main(पूर्णाङ्क argc, वर्ण **argv)
{
    unsigned पूर्णाङ्क i;
    unsigned long long v = 1;

    v = 1;
    अत्थाय (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    अत्थाय (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    पटिनिवत्त 0;
}
