#അന്തര്ഭാവ <limits.h>
#അന്തര്ഭാവ <stdio.h>
#അന്തര്ഭാവ <stdlib.h>

പൂർണ്ണസംഖ്യ ibdg(long long n)
{
    തിരഞ്ഞെടുപ്പ് (n) {
    അവസ്ഥ                     1LL ...                   9LL: തിരികെ 1;
    അവസ്ഥ                    10LL ...                  99LL: തിരികെ 2;
    അവസ്ഥ                   100LL ...                 999LL: തിരികെ 3;
    അവസ്ഥ                  1000LL ...                9999LL: തിരികെ 4;
    അവസ്ഥ                 10000LL ...               99999LL: തിരികെ 5;
    അവസ്ഥ                100000LL ...              999999LL: തിരികെ 6;
    അവസ്ഥ               1000000LL ...             9999999LL: തിരികെ 7;
    അവസ്ഥ              10000000LL ...            99999999LL: തിരികെ 8;
    അവസ്ഥ             100000000LL ...           999999999LL: തിരികെ 9;
    അവസ്ഥ            1000000000LL ...          9999999999LL: തിരികെ 10;
    അവസ്ഥ           10000000000LL ...         99999999999LL: തിരികെ 11;
    അവസ്ഥ          100000000000LL ...        999999999999LL: തിരികെ 12;
    അവസ്ഥ         1000000000000LL ...       9999999999999LL: തിരികെ 13;
    അവസ്ഥ        10000000000000LL ...      99999999999999LL: തിരികെ 14;
    അവസ്ഥ       100000000000000LL ...     999999999999999LL: തിരികെ 15;
    അവസ്ഥ      1000000000000000LL ...    9999999999999999LL: തിരികെ 16;
    അവസ്ഥ     10000000000000000LL ...   99999999999999999LL: തിരികെ 17;
    അവസ്ഥ    100000000000000000LL ...  999999999999999999LL: തിരികെ 18;
    അവസ്ഥ   1000000000000000000LL ... 9223372036854775807LL: തിരികെ 19;
    അവസ്ഥ  -9223372036854775807LL-1LL ...              -1LL: തിരികെ 20;
    }
    തിരികെ 0;
}

പൂർണ്ണസംഖ്യ ubdg(unsigned long long n)
{
    തിരഞ്ഞെടുപ്പ് (n) {
    അവസ്ഥ                    1ULL ...                    9ULL: തിരികെ 1;
    അവസ്ഥ                   10ULL ...                   99ULL: തിരികെ 2;
    അവസ്ഥ                  100ULL ...                  999ULL: തിരികെ 3;
    അവസ്ഥ                 1000ULL ...                 9999ULL: തിരികെ 4;
    അവസ്ഥ                10000ULL ...                99999ULL: തിരികെ 5;
    അവസ്ഥ               100000ULL ...               999999ULL: തിരികെ 6;
    അവസ്ഥ              1000000ULL ...              9999999ULL: തിരികെ 7;
    അവസ്ഥ             10000000ULL ...             99999999ULL: തിരികെ 8;
    അവസ്ഥ            100000000ULL ...            999999999ULL: തിരികെ 9;
    അവസ്ഥ           1000000000ULL ...           9999999999ULL: തിരികെ 10;
    അവസ്ഥ          10000000000ULL ...          99999999999ULL: തിരികെ 11;
    അവസ്ഥ         100000000000ULL ...         999999999999ULL: തിരികെ 12;
    അവസ്ഥ        1000000000000ULL ...        9999999999999ULL: തിരികെ 13;
    അവസ്ഥ       10000000000000ULL ...       99999999999999ULL: തിരികെ 14;
    അവസ്ഥ      100000000000000ULL ...      999999999999999ULL: തിരികെ 15;
    അവസ്ഥ     1000000000000000ULL ...     9999999999999999ULL: തിരികെ 16;
    അവസ്ഥ    10000000000000000ULL ...    99999999999999999ULL: തിരികെ 17;
    അവസ്ഥ   100000000000000000ULL ...   999999999999999999ULL: തിരികെ 18;
    അവസ്ഥ  1000000000000000000ULL ...  9999999999999999999ULL: തിരികെ 19;
    അവസ്ഥ 10000000000000000000ULL ... 18446744073709551615ULL: തിരികെ 20;
    }
    തിരികെ 0;
}

പൂർണ്ണസംഖ്യ പ്രധാന(പൂർണ്ണസംഖ്യ argc, അക്ഷരം **argv)
{
    unsigned പൂർണ്ണസംഖ്യ i;
    unsigned long long v = 1;

    v = 1;
    വേണ്ടി (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    വേണ്ടി (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    തിരികെ 0;
}
