#include <limits.h>
#include <stdio.h>
#include <stdlib.h>

පූර්ණ_සංඛ්‍යා ibdg(long long n)
{
    switch (n) {
    pak_sa                     1LL ...                   9LL: ආපසු 1;
    pak_sa                    10LL ...                  99LL: ආපසු 2;
    pak_sa                   100LL ...                 999LL: ආපසු 3;
    pak_sa                  1000LL ...                9999LL: ආපසු 4;
    pak_sa                 10000LL ...               99999LL: ආපසු 5;
    pak_sa                100000LL ...              999999LL: ආපසු 6;
    pak_sa               1000000LL ...             9999999LL: ආපසු 7;
    pak_sa              10000000LL ...            99999999LL: ආපසු 8;
    pak_sa             100000000LL ...           999999999LL: ආපසු 9;
    pak_sa            1000000000LL ...          9999999999LL: ආපසු 10;
    pak_sa           10000000000LL ...         99999999999LL: ආපසු 11;
    pak_sa          100000000000LL ...        999999999999LL: ආපසු 12;
    pak_sa         1000000000000LL ...       9999999999999LL: ආපසු 13;
    pak_sa        10000000000000LL ...      99999999999999LL: ආපසු 14;
    pak_sa       100000000000000LL ...     999999999999999LL: ආපසු 15;
    pak_sa      1000000000000000LL ...    9999999999999999LL: ආපසු 16;
    pak_sa     10000000000000000LL ...   99999999999999999LL: ආපසු 17;
    pak_sa    100000000000000000LL ...  999999999999999999LL: ආපසු 18;
    pak_sa   1000000000000000000LL ... 9223372036854775807LL: ආපසු 19;
    pak_sa  -9223372036854775807LL-1LL ...              -1LL: ආපසු 20;
    }
    ආපසු 0;
}

පූර්ණ_සංඛ්‍යා ubdg(unsigned long long n)
{
    switch (n) {
    pak_sa                    1ULL ...                    9ULL: ආපසු 1;
    pak_sa                   10ULL ...                   99ULL: ආපසු 2;
    pak_sa                  100ULL ...                  999ULL: ආපසු 3;
    pak_sa                 1000ULL ...                 9999ULL: ආපසු 4;
    pak_sa                10000ULL ...                99999ULL: ආපසු 5;
    pak_sa               100000ULL ...               999999ULL: ආපසු 6;
    pak_sa              1000000ULL ...              9999999ULL: ආපසු 7;
    pak_sa             10000000ULL ...             99999999ULL: ආපසු 8;
    pak_sa            100000000ULL ...            999999999ULL: ආපසු 9;
    pak_sa           1000000000ULL ...           9999999999ULL: ආපසු 10;
    pak_sa          10000000000ULL ...          99999999999ULL: ආපසු 11;
    pak_sa         100000000000ULL ...         999999999999ULL: ආපසු 12;
    pak_sa        1000000000000ULL ...        9999999999999ULL: ආපසු 13;
    pak_sa       10000000000000ULL ...       99999999999999ULL: ආපසු 14;
    pak_sa      100000000000000ULL ...      999999999999999ULL: ආපසු 15;
    pak_sa     1000000000000000ULL ...     9999999999999999ULL: ආපසු 16;
    pak_sa    10000000000000000ULL ...    99999999999999999ULL: ආපසු 17;
    pak_sa   100000000000000000ULL ...   999999999999999999ULL: ආපසු 18;
    pak_sa  1000000000000000000ULL ...  9999999999999999999ULL: ආපසු 19;
    pak_sa 10000000000000000000ULL ... 18446744073709551615ULL: ආපසු 20;
    }
    ආපසු 0;
}

පූර්ණ_සංඛ්‍යා main(පූර්ණ_සංඛ්‍යා argc, var_na **argv)
{
    unsigned පූර්ණ_සංඛ්‍යා i;
    unsigned long long v = 1;

    v = 1;
    සඳහා (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    සඳහා (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ආපසු 0;
}
