#include <limits.h>
#include <stdio.h>
#include <stdlib.h>

цео ibdg(long long n)
{
    switch (n) {
    case                     1LL ...                   9LL: врати 1;
    case                    10LL ...                  99LL: врати 2;
    case                   100LL ...                 999LL: врати 3;
    case                  1000LL ...                9999LL: врати 4;
    case                 10000LL ...               99999LL: врати 5;
    case                100000LL ...              999999LL: врати 6;
    case               1000000LL ...             9999999LL: врати 7;
    case              10000000LL ...            99999999LL: врати 8;
    case             100000000LL ...           999999999LL: врати 9;
    case            1000000000LL ...          9999999999LL: врати 10;
    case           10000000000LL ...         99999999999LL: врати 11;
    case          100000000000LL ...        999999999999LL: врати 12;
    case         1000000000000LL ...       9999999999999LL: врати 13;
    case        10000000000000LL ...      99999999999999LL: врати 14;
    case       100000000000000LL ...     999999999999999LL: врати 15;
    case      1000000000000000LL ...    9999999999999999LL: врати 16;
    case     10000000000000000LL ...   99999999999999999LL: врати 17;
    case    100000000000000000LL ...  999999999999999999LL: врати 18;
    case   1000000000000000000LL ... 9223372036854775807LL: врати 19;
    case  -9223372036854775807LL-1LL ...              -1LL: врати 20;
    }
    врати 0;
}

цео ubdg(unsigned long long n)
{
    switch (n) {
    case                    1ULL ...                    9ULL: врати 1;
    case                   10ULL ...                   99ULL: врати 2;
    case                  100ULL ...                  999ULL: врати 3;
    case                 1000ULL ...                 9999ULL: врати 4;
    case                10000ULL ...                99999ULL: врати 5;
    case               100000ULL ...               999999ULL: врати 6;
    case              1000000ULL ...              9999999ULL: врати 7;
    case             10000000ULL ...             99999999ULL: врати 8;
    case            100000000ULL ...            999999999ULL: врати 9;
    case           1000000000ULL ...           9999999999ULL: врати 10;
    case          10000000000ULL ...          99999999999ULL: врати 11;
    case         100000000000ULL ...         999999999999ULL: врати 12;
    case        1000000000000ULL ...        9999999999999ULL: врати 13;
    case       10000000000000ULL ...       99999999999999ULL: врати 14;
    case      100000000000000ULL ...      999999999999999ULL: врати 15;
    case     1000000000000000ULL ...     9999999999999999ULL: врати 16;
    case    10000000000000000ULL ...    99999999999999999ULL: врати 17;
    case   100000000000000000ULL ...   999999999999999999ULL: врати 18;
    case  1000000000000000000ULL ...  9999999999999999999ULL: врати 19;
    case 10000000000000000000ULL ... 18446744073709551615ULL: врати 20;
    }
    врати 0;
}

цео main(цео argc, char **argv)
{
    unsigned цео i;
    unsigned long long v = 1;

    v = 1;
    за (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    за (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    врати 0;
}
