#અન્તર્ભાવ <limits.h>
#અન્તર્ભાવ <stdio.h>
#અન્તર્ભાવ <stdlib.h>

પૂર્ણાંક ibdg(long long n)
{
    પસંદગી (n) {
    સ્થિતિ                     1LL ...                   9LL: પાછા 1;
    સ્થિતિ                    10LL ...                  99LL: પાછા 2;
    સ્થિતિ                   100LL ...                 999LL: પાછા 3;
    સ્થિતિ                  1000LL ...                9999LL: પાછા 4;
    સ્થિતિ                 10000LL ...               99999LL: પાછા 5;
    સ્થિતિ                100000LL ...              999999LL: પાછા 6;
    સ્થિતિ               1000000LL ...             9999999LL: પાછા 7;
    સ્થિતિ              10000000LL ...            99999999LL: પાછા 8;
    સ્થિતિ             100000000LL ...           999999999LL: પાછા 9;
    સ્થિતિ            1000000000LL ...          9999999999LL: પાછા 10;
    સ્થિતિ           10000000000LL ...         99999999999LL: પાછા 11;
    સ્થિતિ          100000000000LL ...        999999999999LL: પાછા 12;
    સ્થિતિ         1000000000000LL ...       9999999999999LL: પાછા 13;
    સ્થિતિ        10000000000000LL ...      99999999999999LL: પાછા 14;
    સ્થિતિ       100000000000000LL ...     999999999999999LL: પાછા 15;
    સ્થિતિ      1000000000000000LL ...    9999999999999999LL: પાછા 16;
    સ્થિતિ     10000000000000000LL ...   99999999999999999LL: પાછા 17;
    સ્થિતિ    100000000000000000LL ...  999999999999999999LL: પાછા 18;
    સ્થિતિ   1000000000000000000LL ... 9223372036854775807LL: પાછા 19;
    સ્થિતિ  -9223372036854775807LL-1LL ...              -1LL: પાછા 20;
    }
    પાછા 0;
}

પૂર્ણાંક ubdg(unsigned long long n)
{
    પસંદગી (n) {
    સ્થિતિ                    1ULL ...                    9ULL: પાછા 1;
    સ્થિતિ                   10ULL ...                   99ULL: પાછા 2;
    સ્થિતિ                  100ULL ...                  999ULL: પાછા 3;
    સ્થિતિ                 1000ULL ...                 9999ULL: પાછા 4;
    સ્થિતિ                10000ULL ...                99999ULL: પાછા 5;
    સ્થિતિ               100000ULL ...               999999ULL: પાછા 6;
    સ્થિતિ              1000000ULL ...              9999999ULL: પાછા 7;
    સ્થિતિ             10000000ULL ...             99999999ULL: પાછા 8;
    સ્થિતિ            100000000ULL ...            999999999ULL: પાછા 9;
    સ્થિતિ           1000000000ULL ...           9999999999ULL: પાછા 10;
    સ્થિતિ          10000000000ULL ...          99999999999ULL: પાછા 11;
    સ્થિતિ         100000000000ULL ...         999999999999ULL: પાછા 12;
    સ્થિતિ        1000000000000ULL ...        9999999999999ULL: પાછા 13;
    સ્થિતિ       10000000000000ULL ...       99999999999999ULL: પાછા 14;
    સ્થિતિ      100000000000000ULL ...      999999999999999ULL: પાછા 15;
    સ્થિતિ     1000000000000000ULL ...     9999999999999999ULL: પાછા 16;
    સ્થિતિ    10000000000000000ULL ...    99999999999999999ULL: પાછા 17;
    સ્થિતિ   100000000000000000ULL ...   999999999999999999ULL: પાછા 18;
    સ્થિતિ  1000000000000000000ULL ...  9999999999999999999ULL: પાછા 19;
    સ્થિતિ 10000000000000000000ULL ... 18446744073709551615ULL: પાછા 20;
    }
    પાછા 0;
}

પૂર્ણાંક મુખ્ય(પૂર્ણાંક argc, અક્ષર **argv)
{
    unsigned પૂર્ણાંક i;
    unsigned long long v = 1;

    v = 1;
    માટે (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    માટે (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    પાછા 0;
}
