#অন্তর্ভাৱ <limits.h>
#অন্তর্ভাৱ <stdio.h>
#অন্তর্ভাৱ <stdlib.h>

পূর্ণাঙ্ক ibdg(long long n)
{
    ৱিকল্প (n) {
    পক্ষ                     1LL ...                   9LL: ঘূৰাই 1;
    পক্ষ                    10LL ...                  99LL: ঘূৰাই 2;
    পক্ষ                   100LL ...                 999LL: ঘূৰাই 3;
    পক্ষ                  1000LL ...                9999LL: ঘূৰাই 4;
    পক্ষ                 10000LL ...               99999LL: ঘূৰাই 5;
    পক্ষ                100000LL ...              999999LL: ঘূৰাই 6;
    পক্ষ               1000000LL ...             9999999LL: ঘূৰাই 7;
    পক্ষ              10000000LL ...            99999999LL: ঘূৰাই 8;
    পক্ষ             100000000LL ...           999999999LL: ঘূৰাই 9;
    পক্ষ            1000000000LL ...          9999999999LL: ঘূৰাই 10;
    পক্ষ           10000000000LL ...         99999999999LL: ঘূৰাই 11;
    পক্ষ          100000000000LL ...        999999999999LL: ঘূৰাই 12;
    পক্ষ         1000000000000LL ...       9999999999999LL: ঘূৰাই 13;
    পক্ষ        10000000000000LL ...      99999999999999LL: ঘূৰাই 14;
    পক্ষ       100000000000000LL ...     999999999999999LL: ঘূৰাই 15;
    পক্ষ      1000000000000000LL ...    9999999999999999LL: ঘূৰাই 16;
    পক্ষ     10000000000000000LL ...   99999999999999999LL: ঘূৰাই 17;
    পক্ষ    100000000000000000LL ...  999999999999999999LL: ঘূৰাই 18;
    পক্ষ   1000000000000000000LL ... 9223372036854775807LL: ঘূৰাই 19;
    পক্ষ  -9223372036854775807LL-1LL ...              -1LL: ঘূৰাই 20;
    }
    ঘূৰাই 0;
}

পূর্ণাঙ্ক ubdg(unsigned long long n)
{
    ৱিকল্প (n) {
    পক্ষ                    1ULL ...                    9ULL: ঘূৰাই 1;
    পক্ষ                   10ULL ...                   99ULL: ঘূৰাই 2;
    পক্ষ                  100ULL ...                  999ULL: ঘূৰাই 3;
    পক্ষ                 1000ULL ...                 9999ULL: ঘূৰাই 4;
    পক্ষ                10000ULL ...                99999ULL: ঘূৰাই 5;
    পক্ষ               100000ULL ...               999999ULL: ঘূৰাই 6;
    পক্ষ              1000000ULL ...              9999999ULL: ঘূৰাই 7;
    পক্ষ             10000000ULL ...             99999999ULL: ঘূৰাই 8;
    পক্ষ            100000000ULL ...            999999999ULL: ঘূৰাই 9;
    পক্ষ           1000000000ULL ...           9999999999ULL: ঘূৰাই 10;
    পক্ষ          10000000000ULL ...          99999999999ULL: ঘূৰাই 11;
    পক্ষ         100000000000ULL ...         999999999999ULL: ঘূৰাই 12;
    পক্ষ        1000000000000ULL ...        9999999999999ULL: ঘূৰাই 13;
    পক্ষ       10000000000000ULL ...       99999999999999ULL: ঘূৰাই 14;
    পক্ষ      100000000000000ULL ...      999999999999999ULL: ঘূৰাই 15;
    পক্ষ     1000000000000000ULL ...     9999999999999999ULL: ঘূৰাই 16;
    পক্ষ    10000000000000000ULL ...    99999999999999999ULL: ঘূৰাই 17;
    পক্ষ   100000000000000000ULL ...   999999999999999999ULL: ঘূৰাই 18;
    পক্ষ  1000000000000000000ULL ...  9999999999999999999ULL: ঘূৰাই 19;
    পক্ষ 10000000000000000000ULL ... 18446744073709551615ULL: ঘূৰাই 20;
    }
    ঘূৰাই 0;
}

পূর্ণাঙ্ক main(পূর্ণাঙ্ক argc, ৱর্ণ **argv)
{
    unsigned পূর্ণাঙ্ক i;
    unsigned long long v = 1;

    v = 1;
    বাবে (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    বাবে (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ঘূৰাই 0;
}
