#ಅನ್ತರ್ಭಾವ <limits.h>
#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <stdlib.h>

ಪೂರ್ಣಾಂಕ ibdg(ದೀರ್ಘ ದೀರ್ಘ n)
{
    ಆಯ್ಕೆ (n) {
    ಸ್ಥಿತಿ                     1LL ...                   9LL: ಹಿಂತಿರುಗಿ 1;
    ಸ್ಥಿತಿ                    10LL ...                  99LL: ಹಿಂತಿರುಗಿ 2;
    ಸ್ಥಿತಿ                   100LL ...                 999LL: ಹಿಂತಿರುಗಿ 3;
    ಸ್ಥಿತಿ                  1000LL ...                9999LL: ಹಿಂತಿರುಗಿ 4;
    ಸ್ಥಿತಿ                 10000LL ...               99999LL: ಹಿಂತಿರುಗಿ 5;
    ಸ್ಥಿತಿ                100000LL ...              999999LL: ಹಿಂತಿರುಗಿ 6;
    ಸ್ಥಿತಿ               1000000LL ...             9999999LL: ಹಿಂತಿರುಗಿ 7;
    ಸ್ಥಿತಿ              10000000LL ...            99999999LL: ಹಿಂತಿರುಗಿ 8;
    ಸ್ಥಿತಿ             100000000LL ...           999999999LL: ಹಿಂತಿರುಗಿ 9;
    ಸ್ಥಿತಿ            1000000000LL ...          9999999999LL: ಹಿಂತಿರುಗಿ 10;
    ಸ್ಥಿತಿ           10000000000LL ...         99999999999LL: ಹಿಂತಿರುಗಿ 11;
    ಸ್ಥಿತಿ          100000000000LL ...        999999999999LL: ಹಿಂತಿರುಗಿ 12;
    ಸ್ಥಿತಿ         1000000000000LL ...       9999999999999LL: ಹಿಂತಿರುಗಿ 13;
    ಸ್ಥಿತಿ        10000000000000LL ...      99999999999999LL: ಹಿಂತಿರುಗಿ 14;
    ಸ್ಥಿತಿ       100000000000000LL ...     999999999999999LL: ಹಿಂತಿರುಗಿ 15;
    ಸ್ಥಿತಿ      1000000000000000LL ...    9999999999999999LL: ಹಿಂತಿರುಗಿ 16;
    ಸ್ಥಿತಿ     10000000000000000LL ...   99999999999999999LL: ಹಿಂತಿರುಗಿ 17;
    ಸ್ಥಿತಿ    100000000000000000LL ...  999999999999999999LL: ಹಿಂತಿರುಗಿ 18;
    ಸ್ಥಿತಿ   1000000000000000000LL ... 9223372036854775807LL: ಹಿಂತಿರುಗಿ 19;
    ಸ್ಥಿತಿ  -9223372036854775807LL-1LL ...              -1LL: ಹಿಂತಿರುಗಿ 20;
    }
    ಹಿಂತಿರುಗಿ 0;
}

ಪೂರ್ಣಾಂಕ ubdg(ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ n)
{
    ಆಯ್ಕೆ (n) {
    ಸ್ಥಿತಿ                    1ULL ...                    9ULL: ಹಿಂತಿರುಗಿ 1;
    ಸ್ಥಿತಿ                   10ULL ...                   99ULL: ಹಿಂತಿರುಗಿ 2;
    ಸ್ಥಿತಿ                  100ULL ...                  999ULL: ಹಿಂತಿರುಗಿ 3;
    ಸ್ಥಿತಿ                 1000ULL ...                 9999ULL: ಹಿಂತಿರುಗಿ 4;
    ಸ್ಥಿತಿ                10000ULL ...                99999ULL: ಹಿಂತಿರುಗಿ 5;
    ಸ್ಥಿತಿ               100000ULL ...               999999ULL: ಹಿಂತಿರುಗಿ 6;
    ಸ್ಥಿತಿ              1000000ULL ...              9999999ULL: ಹಿಂತಿರುಗಿ 7;
    ಸ್ಥಿತಿ             10000000ULL ...             99999999ULL: ಹಿಂತಿರುಗಿ 8;
    ಸ್ಥಿತಿ            100000000ULL ...            999999999ULL: ಹಿಂತಿರುಗಿ 9;
    ಸ್ಥಿತಿ           1000000000ULL ...           9999999999ULL: ಹಿಂತಿರುಗಿ 10;
    ಸ್ಥಿತಿ          10000000000ULL ...          99999999999ULL: ಹಿಂತಿರುಗಿ 11;
    ಸ್ಥಿತಿ         100000000000ULL ...         999999999999ULL: ಹಿಂತಿರುಗಿ 12;
    ಸ್ಥಿತಿ        1000000000000ULL ...        9999999999999ULL: ಹಿಂತಿರುಗಿ 13;
    ಸ್ಥಿತಿ       10000000000000ULL ...       99999999999999ULL: ಹಿಂತಿರುಗಿ 14;
    ಸ್ಥಿತಿ      100000000000000ULL ...      999999999999999ULL: ಹಿಂತಿರುಗಿ 15;
    ಸ್ಥಿತಿ     1000000000000000ULL ...     9999999999999999ULL: ಹಿಂತಿರುಗಿ 16;
    ಸ್ಥಿತಿ    10000000000000000ULL ...    99999999999999999ULL: ಹಿಂತಿರುಗಿ 17;
    ಸ್ಥಿತಿ   100000000000000000ULL ...   999999999999999999ULL: ಹಿಂತಿರುಗಿ 18;
    ಸ್ಥಿತಿ  1000000000000000000ULL ...  9999999999999999999ULL: ಹಿಂತಿರುಗಿ 19;
    ಸ್ಥಿತಿ 10000000000000000000ULL ... 18446744073709551615ULL: ಹಿಂತಿರುಗಿ 20;
    }
    ಹಿಂತಿರುಗಿ 0;
}

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv)
{
    ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ i;
    ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ v = 1;

    v = 1;
    ಗಾಗಿ (i = 1; i <= 20; i++) {
        ಬರೆ("%lld : %d\n", (ದೀರ್ಘ ದೀರ್ಘ) v, ibdg((ದೀರ್ಘ ದೀರ್ಘ)v));
        v *= 10;
    }
    v = 1;
    ಗಾಗಿ (i = 1; i <= 20; i++) {
        ಬರೆ("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ಹಿಂತಿರುಗಿ 0;
}
