#شامل <limits.h>
#شامل <stdio.h>
#شامل <stdlib.h>

صحیح ibdg(long long n)
{
    انتخاب (n) {
    حالت                     1LL ...                   9LL: بازگشت 1;
    حالت                    10LL ...                  99LL: بازگشت 2;
    حالت                   100LL ...                 999LL: بازگشت 3;
    حالت                  1000LL ...                9999LL: بازگشت 4;
    حالت                 10000LL ...               99999LL: بازگشت 5;
    حالت                100000LL ...              999999LL: بازگشت 6;
    حالت               1000000LL ...             9999999LL: بازگشت 7;
    حالت              10000000LL ...            99999999LL: بازگشت 8;
    حالت             100000000LL ...           999999999LL: بازگشت 9;
    حالت            1000000000LL ...          9999999999LL: بازگشت 10;
    حالت           10000000000LL ...         99999999999LL: بازگشت 11;
    حالت          100000000000LL ...        999999999999LL: بازگشت 12;
    حالت         1000000000000LL ...       9999999999999LL: بازگشت 13;
    حالت        10000000000000LL ...      99999999999999LL: بازگشت 14;
    حالت       100000000000000LL ...     999999999999999LL: بازگشت 15;
    حالت      1000000000000000LL ...    9999999999999999LL: بازگشت 16;
    حالت     10000000000000000LL ...   99999999999999999LL: بازگشت 17;
    حالت    100000000000000000LL ...  999999999999999999LL: بازگشت 18;
    حالت   1000000000000000000LL ... 9223372036854775807LL: بازگشت 19;
    حالت  -9223372036854775807LL-1LL ...              -1LL: بازگشت 20;
    }
    بازگشت 0;
}

صحیح ubdg(unsigned long long n)
{
    انتخاب (n) {
    حالت                    1ULL ...                    9ULL: بازگشت 1;
    حالت                   10ULL ...                   99ULL: بازگشت 2;
    حالت                  100ULL ...                  999ULL: بازگشت 3;
    حالت                 1000ULL ...                 9999ULL: بازگشت 4;
    حالت                10000ULL ...                99999ULL: بازگشت 5;
    حالت               100000ULL ...               999999ULL: بازگشت 6;
    حالت              1000000ULL ...              9999999ULL: بازگشت 7;
    حالت             10000000ULL ...             99999999ULL: بازگشت 8;
    حالت            100000000ULL ...            999999999ULL: بازگشت 9;
    حالت           1000000000ULL ...           9999999999ULL: بازگشت 10;
    حالت          10000000000ULL ...          99999999999ULL: بازگشت 11;
    حالت         100000000000ULL ...         999999999999ULL: بازگشت 12;
    حالت        1000000000000ULL ...        9999999999999ULL: بازگشت 13;
    حالت       10000000000000ULL ...       99999999999999ULL: بازگشت 14;
    حالت      100000000000000ULL ...      999999999999999ULL: بازگشت 15;
    حالت     1000000000000000ULL ...     9999999999999999ULL: بازگشت 16;
    حالت    10000000000000000ULL ...    99999999999999999ULL: بازگشت 17;
    حالت   100000000000000000ULL ...   999999999999999999ULL: بازگشت 18;
    حالت  1000000000000000000ULL ...  9999999999999999999ULL: بازگشت 19;
    حالت 10000000000000000000ULL ... 18446744073709551615ULL: بازگشت 20;
    }
    بازگشت 0;
}

صحیح اصلی(صحیح argc, نویسه **argv)
{
    unsigned صحیح i;
    unsigned long long v = 1;

    v = 1;
    برای (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    برای (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    بازگشت 0;
}
