#ਅਨ੍ਤਰ੍ਭਾਵ <limits.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <stdlib.h>

ਪੂਰਨ ibdg(ਲੰਮਾ ਲੰਮਾ n)
{
    ਚੋਣ (n) {
    ਹਾਲਤ                     1LL ...                   9LL: ਵਾਪਸ 1;
    ਹਾਲਤ                    10LL ...                  99LL: ਵਾਪਸ 2;
    ਹਾਲਤ                   100LL ...                 999LL: ਵਾਪਸ 3;
    ਹਾਲਤ                  1000LL ...                9999LL: ਵਾਪਸ 4;
    ਹਾਲਤ                 10000LL ...               99999LL: ਵਾਪਸ 5;
    ਹਾਲਤ                100000LL ...              999999LL: ਵਾਪਸ 6;
    ਹਾਲਤ               1000000LL ...             9999999LL: ਵਾਪਸ 7;
    ਹਾਲਤ              10000000LL ...            99999999LL: ਵਾਪਸ 8;
    ਹਾਲਤ             100000000LL ...           999999999LL: ਵਾਪਸ 9;
    ਹਾਲਤ            1000000000LL ...          9999999999LL: ਵਾਪਸ 10;
    ਹਾਲਤ           10000000000LL ...         99999999999LL: ਵਾਪਸ 11;
    ਹਾਲਤ          100000000000LL ...        999999999999LL: ਵਾਪਸ 12;
    ਹਾਲਤ         1000000000000LL ...       9999999999999LL: ਵਾਪਸ 13;
    ਹਾਲਤ        10000000000000LL ...      99999999999999LL: ਵਾਪਸ 14;
    ਹਾਲਤ       100000000000000LL ...     999999999999999LL: ਵਾਪਸ 15;
    ਹਾਲਤ      1000000000000000LL ...    9999999999999999LL: ਵਾਪਸ 16;
    ਹਾਲਤ     10000000000000000LL ...   99999999999999999LL: ਵਾਪਸ 17;
    ਹਾਲਤ    100000000000000000LL ...  999999999999999999LL: ਵਾਪਸ 18;
    ਹਾਲਤ   1000000000000000000LL ... 9223372036854775807LL: ਵਾਪਸ 19;
    ਹਾਲਤ  -9223372036854775807LL-1LL ...              -1LL: ਵਾਪਸ 20;
    }
    ਵਾਪਸ 0;
}

ਪੂਰਨ ubdg(ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ ਲੰਮਾ n)
{
    ਚੋਣ (n) {
    ਹਾਲਤ                    1ULL ...                    9ULL: ਵਾਪਸ 1;
    ਹਾਲਤ                   10ULL ...                   99ULL: ਵਾਪਸ 2;
    ਹਾਲਤ                  100ULL ...                  999ULL: ਵਾਪਸ 3;
    ਹਾਲਤ                 1000ULL ...                 9999ULL: ਵਾਪਸ 4;
    ਹਾਲਤ                10000ULL ...                99999ULL: ਵਾਪਸ 5;
    ਹਾਲਤ               100000ULL ...               999999ULL: ਵਾਪਸ 6;
    ਹਾਲਤ              1000000ULL ...              9999999ULL: ਵਾਪਸ 7;
    ਹਾਲਤ             10000000ULL ...             99999999ULL: ਵਾਪਸ 8;
    ਹਾਲਤ            100000000ULL ...            999999999ULL: ਵਾਪਸ 9;
    ਹਾਲਤ           1000000000ULL ...           9999999999ULL: ਵਾਪਸ 10;
    ਹਾਲਤ          10000000000ULL ...          99999999999ULL: ਵਾਪਸ 11;
    ਹਾਲਤ         100000000000ULL ...         999999999999ULL: ਵਾਪਸ 12;
    ਹਾਲਤ        1000000000000ULL ...        9999999999999ULL: ਵਾਪਸ 13;
    ਹਾਲਤ       10000000000000ULL ...       99999999999999ULL: ਵਾਪਸ 14;
    ਹਾਲਤ      100000000000000ULL ...      999999999999999ULL: ਵਾਪਸ 15;
    ਹਾਲਤ     1000000000000000ULL ...     9999999999999999ULL: ਵਾਪਸ 16;
    ਹਾਲਤ    10000000000000000ULL ...    99999999999999999ULL: ਵਾਪਸ 17;
    ਹਾਲਤ   100000000000000000ULL ...   999999999999999999ULL: ਵਾਪਸ 18;
    ਹਾਲਤ  1000000000000000000ULL ...  9999999999999999999ULL: ਵਾਪਸ 19;
    ਹਾਲਤ 10000000000000000000ULL ... 18446744073709551615ULL: ਵਾਪਸ 20;
    }
    ਵਾਪਸ 0;
}

ਪੂਰਨ ਮੁੱਖ(ਪੂਰਨ argc, ਅੱਖਰ **argv)
{
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ i;
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ ਲੰਮਾ v = 1;

    v = 1;
    ਲਈ (i = 1; i <= 20; i++) {
        ਲਿਖੋ("%lld : %d\n", (ਲੰਮਾ ਲੰਮਾ) v, ibdg((ਲੰਮਾ ਲੰਮਾ)v));
        v *= 10;
    }
    v = 1;
    ਲਈ (i = 1; i <= 20; i++) {
        ਲਿਖੋ("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ਵਾਪਸ 0;
}
