#ضمن <limits.h>
#ضمن <stdio.h>
#ضمن <stdlib.h>

صحيح ibdg(ڊگهو ڊگهو n)
{
    بدل (n) {
    حالة                     1LL ...                   9LL: أرجع 1;
    حالة                    10LL ...                  99LL: أرجع 2;
    حالة                   100LL ...                 999LL: أرجع 3;
    حالة                  1000LL ...                9999LL: أرجع 4;
    حالة                 10000LL ...               99999LL: أرجع 5;
    حالة                100000LL ...              999999LL: أرجع 6;
    حالة               1000000LL ...             9999999LL: أرجع 7;
    حالة              10000000LL ...            99999999LL: أرجع 8;
    حالة             100000000LL ...           999999999LL: أرجع 9;
    حالة            1000000000LL ...          9999999999LL: أرجع 10;
    حالة           10000000000LL ...         99999999999LL: أرجع 11;
    حالة          100000000000LL ...        999999999999LL: أرجع 12;
    حالة         1000000000000LL ...       9999999999999LL: أرجع 13;
    حالة        10000000000000LL ...      99999999999999LL: أرجع 14;
    حالة       100000000000000LL ...     999999999999999LL: أرجع 15;
    حالة      1000000000000000LL ...    9999999999999999LL: أرجع 16;
    حالة     10000000000000000LL ...   99999999999999999LL: أرجع 17;
    حالة    100000000000000000LL ...  999999999999999999LL: أرجع 18;
    حالة   1000000000000000000LL ... 9223372036854775807LL: أرجع 19;
    حالة  -9223372036854775807LL-1LL ...              -1LL: أرجع 20;
    }
    أرجع 0;
}

صحيح ubdg(بنانشان ڊگهو ڊگهو n)
{
    بدل (n) {
    حالة                    1ULL ...                    9ULL: أرجع 1;
    حالة                   10ULL ...                   99ULL: أرجع 2;
    حالة                  100ULL ...                  999ULL: أرجع 3;
    حالة                 1000ULL ...                 9999ULL: أرجع 4;
    حالة                10000ULL ...                99999ULL: أرجع 5;
    حالة               100000ULL ...               999999ULL: أرجع 6;
    حالة              1000000ULL ...              9999999ULL: أرجع 7;
    حالة             10000000ULL ...             99999999ULL: أرجع 8;
    حالة            100000000ULL ...            999999999ULL: أرجع 9;
    حالة           1000000000ULL ...           9999999999ULL: أرجع 10;
    حالة          10000000000ULL ...          99999999999ULL: أرجع 11;
    حالة         100000000000ULL ...         999999999999ULL: أرجع 12;
    حالة        1000000000000ULL ...        9999999999999ULL: أرجع 13;
    حالة       10000000000000ULL ...       99999999999999ULL: أرجع 14;
    حالة      100000000000000ULL ...      999999999999999ULL: أرجع 15;
    حالة     1000000000000000ULL ...     9999999999999999ULL: أرجع 16;
    حالة    10000000000000000ULL ...    99999999999999999ULL: أرجع 17;
    حالة   100000000000000000ULL ...   999999999999999999ULL: أرجع 18;
    حالة  1000000000000000000ULL ...  9999999999999999999ULL: أرجع 19;
    حالة 10000000000000000000ULL ... 18446744073709551615ULL: أرجع 20;
    }
    أرجع 0;
}

صحيح مکيه(صحيح argc, حرف **argv)
{
    بنانشان صحيح i;
    بنانشان ڊگهو ڊگهو v = 1;

    v = 1;
    لكل (i = 1; i <= 20; i++) {
        لکو("%lld : %d\n", (ڊگهو ڊگهو) v, ibdg((ڊگهو ڊگهو)v));
        v *= 10;
    }
    v = 1;
    لكل (i = 1; i <= 20; i++) {
        لکو("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    أرجع 0;
}
