#అన్తర్భావ <limits.h>
#అన్తర్భావ <stdio.h>
#అన్తర్భావ <stdlib.h>

పూర్ణాంకం ibdg(దీర్ఘ దీర్ఘ n)
{
    ఎంపిక (n) {
    స్థితి                     1LL ...                   9LL: తిరిగి 1;
    స్థితి                    10LL ...                  99LL: తిరిగి 2;
    స్థితి                   100LL ...                 999LL: తిరిగి 3;
    స్థితి                  1000LL ...                9999LL: తిరిగి 4;
    స్థితి                 10000LL ...               99999LL: తిరిగి 5;
    స్థితి                100000LL ...              999999LL: తిరిగి 6;
    స్థితి               1000000LL ...             9999999LL: తిరిగి 7;
    స్థితి              10000000LL ...            99999999LL: తిరిగి 8;
    స్థితి             100000000LL ...           999999999LL: తిరిగి 9;
    స్థితి            1000000000LL ...          9999999999LL: తిరిగి 10;
    స్థితి           10000000000LL ...         99999999999LL: తిరిగి 11;
    స్థితి          100000000000LL ...        999999999999LL: తిరిగి 12;
    స్థితి         1000000000000LL ...       9999999999999LL: తిరిగి 13;
    స్థితి        10000000000000LL ...      99999999999999LL: తిరిగి 14;
    స్థితి       100000000000000LL ...     999999999999999LL: తిరిగి 15;
    స్థితి      1000000000000000LL ...    9999999999999999LL: తిరిగి 16;
    స్థితి     10000000000000000LL ...   99999999999999999LL: తిరిగి 17;
    స్థితి    100000000000000000LL ...  999999999999999999LL: తిరిగి 18;
    స్థితి   1000000000000000000LL ... 9223372036854775807LL: తిరిగి 19;
    స్థితి  -9223372036854775807LL-1LL ...              -1LL: తిరిగి 20;
    }
    తిరిగి 0;
}

పూర్ణాంకం ubdg(గుర్తులేని దీర్ఘ దీర్ఘ n)
{
    ఎంపిక (n) {
    స్థితి                    1ULL ...                    9ULL: తిరిగి 1;
    స్థితి                   10ULL ...                   99ULL: తిరిగి 2;
    స్థితి                  100ULL ...                  999ULL: తిరిగి 3;
    స్థితి                 1000ULL ...                 9999ULL: తిరిగి 4;
    స్థితి                10000ULL ...                99999ULL: తిరిగి 5;
    స్థితి               100000ULL ...               999999ULL: తిరిగి 6;
    స్థితి              1000000ULL ...              9999999ULL: తిరిగి 7;
    స్థితి             10000000ULL ...             99999999ULL: తిరిగి 8;
    స్థితి            100000000ULL ...            999999999ULL: తిరిగి 9;
    స్థితి           1000000000ULL ...           9999999999ULL: తిరిగి 10;
    స్థితి          10000000000ULL ...          99999999999ULL: తిరిగి 11;
    స్థితి         100000000000ULL ...         999999999999ULL: తిరిగి 12;
    స్థితి        1000000000000ULL ...        9999999999999ULL: తిరిగి 13;
    స్థితి       10000000000000ULL ...       99999999999999ULL: తిరిగి 14;
    స్థితి      100000000000000ULL ...      999999999999999ULL: తిరిగి 15;
    స్థితి     1000000000000000ULL ...     9999999999999999ULL: తిరిగి 16;
    స్థితి    10000000000000000ULL ...    99999999999999999ULL: తిరిగి 17;
    స్థితి   100000000000000000ULL ...   999999999999999999ULL: తిరిగి 18;
    స్థితి  1000000000000000000ULL ...  9999999999999999999ULL: తిరిగి 19;
    స్థితి 10000000000000000000ULL ... 18446744073709551615ULL: తిరిగి 20;
    }
    తిరిగి 0;
}

పూర్ణాంకం ప్రధాన(పూర్ణాంకం argc, అక్షరం **argv)
{
    గుర్తులేని పూర్ణాంకం i;
    గుర్తులేని దీర్ఘ దీర్ఘ v = 1;

    v = 1;
    కొరకు (i = 1; i <= 20; i++) {
        రాయి("%lld : %d\n", (దీర్ఘ దీర్ఘ) v, ibdg((దీర్ఘ దీర్ఘ)v));
        v *= 10;
    }
    v = 1;
    కొరకు (i = 1; i <= 20; i++) {
        రాయి("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    తిరిగి 0;
}
