#অন্তর্ভাব <limits.h>
#অন্তর্ভাব <stdio.h>
#অন্তর্ভাব <stdlib.h>

পূর্ণসংখ্যা ibdg(long long n)
{
    নির্বাচন (n) {
    ক্ষেত্র                     1LL ...                   9LL: ফেরত 1;
    ক্ষেত্র                    10LL ...                  99LL: ফেরত 2;
    ক্ষেত্র                   100LL ...                 999LL: ফেরত 3;
    ক্ষেত্র                  1000LL ...                9999LL: ফেরত 4;
    ক্ষেত্র                 10000LL ...               99999LL: ফেরত 5;
    ক্ষেত্র                100000LL ...              999999LL: ফেরত 6;
    ক্ষেত্র               1000000LL ...             9999999LL: ফেরত 7;
    ক্ষেত্র              10000000LL ...            99999999LL: ফেরত 8;
    ক্ষেত্র             100000000LL ...           999999999LL: ফেরত 9;
    ক্ষেত্র            1000000000LL ...          9999999999LL: ফেরত 10;
    ক্ষেত্র           10000000000LL ...         99999999999LL: ফেরত 11;
    ক্ষেত্র          100000000000LL ...        999999999999LL: ফেরত 12;
    ক্ষেত্র         1000000000000LL ...       9999999999999LL: ফেরত 13;
    ক্ষেত্র        10000000000000LL ...      99999999999999LL: ফেরত 14;
    ক্ষেত্র       100000000000000LL ...     999999999999999LL: ফেরত 15;
    ক্ষেত্র      1000000000000000LL ...    9999999999999999LL: ফেরত 16;
    ক্ষেত্র     10000000000000000LL ...   99999999999999999LL: ফেরত 17;
    ক্ষেত্র    100000000000000000LL ...  999999999999999999LL: ফেরত 18;
    ক্ষেত্র   1000000000000000000LL ... 9223372036854775807LL: ফেরত 19;
    ক্ষেত্র  -9223372036854775807LL-1LL ...              -1LL: ফেরত 20;
    }
    ফেরত 0;
}

পূর্ণসংখ্যা ubdg(unsigned long long n)
{
    নির্বাচন (n) {
    ক্ষেত্র                    1ULL ...                    9ULL: ফেরত 1;
    ক্ষেত্র                   10ULL ...                   99ULL: ফেরত 2;
    ক্ষেত্র                  100ULL ...                  999ULL: ফেরত 3;
    ক্ষেত্র                 1000ULL ...                 9999ULL: ফেরত 4;
    ক্ষেত্র                10000ULL ...                99999ULL: ফেরত 5;
    ক্ষেত্র               100000ULL ...               999999ULL: ফেরত 6;
    ক্ষেত্র              1000000ULL ...              9999999ULL: ফেরত 7;
    ক্ষেত্র             10000000ULL ...             99999999ULL: ফেরত 8;
    ক্ষেত্র            100000000ULL ...            999999999ULL: ফেরত 9;
    ক্ষেত্র           1000000000ULL ...           9999999999ULL: ফেরত 10;
    ক্ষেত্র          10000000000ULL ...          99999999999ULL: ফেরত 11;
    ক্ষেত্র         100000000000ULL ...         999999999999ULL: ফেরত 12;
    ক্ষেত্র        1000000000000ULL ...        9999999999999ULL: ফেরত 13;
    ক্ষেত্র       10000000000000ULL ...       99999999999999ULL: ফেরত 14;
    ক্ষেত্র      100000000000000ULL ...      999999999999999ULL: ফেরত 15;
    ক্ষেত্র     1000000000000000ULL ...     9999999999999999ULL: ফেরত 16;
    ক্ষেত্র    10000000000000000ULL ...    99999999999999999ULL: ফেরত 17;
    ক্ষেত্র   100000000000000000ULL ...   999999999999999999ULL: ফেরত 18;
    ক্ষেত্র  1000000000000000000ULL ...  9999999999999999999ULL: ফেরত 19;
    ক্ষেত্র 10000000000000000000ULL ... 18446744073709551615ULL: ফেরত 20;
    }
    ফেরত 0;
}

পূর্ণসংখ্যা প্রধান(পূর্ণসংখ্যা argc, অক্ষর **argv)
{
    unsigned পূর্ণসংখ্যা i;
    unsigned long long v = 1;

    v = 1;
    জন্য (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    জন্য (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ফেরত 0;
}
