#include <limits.h>
#include <stdio.h>
#include <stdlib.h>

ціле ibdg(long long n)
{
    switch (n) {
    case                     1LL ...                   9LL: повернути 1;
    case                    10LL ...                  99LL: повернути 2;
    case                   100LL ...                 999LL: повернути 3;
    case                  1000LL ...                9999LL: повернути 4;
    case                 10000LL ...               99999LL: повернути 5;
    case                100000LL ...              999999LL: повернути 6;
    case               1000000LL ...             9999999LL: повернути 7;
    case              10000000LL ...            99999999LL: повернути 8;
    case             100000000LL ...           999999999LL: повернути 9;
    case            1000000000LL ...          9999999999LL: повернути 10;
    case           10000000000LL ...         99999999999LL: повернути 11;
    case          100000000000LL ...        999999999999LL: повернути 12;
    case         1000000000000LL ...       9999999999999LL: повернути 13;
    case        10000000000000LL ...      99999999999999LL: повернути 14;
    case       100000000000000LL ...     999999999999999LL: повернути 15;
    case      1000000000000000LL ...    9999999999999999LL: повернути 16;
    case     10000000000000000LL ...   99999999999999999LL: повернути 17;
    case    100000000000000000LL ...  999999999999999999LL: повернути 18;
    case   1000000000000000000LL ... 9223372036854775807LL: повернути 19;
    case  -9223372036854775807LL-1LL ...              -1LL: повернути 20;
    }
    повернути 0;
}

ціле ubdg(unsigned long long n)
{
    switch (n) {
    case                    1ULL ...                    9ULL: повернути 1;
    case                   10ULL ...                   99ULL: повернути 2;
    case                  100ULL ...                  999ULL: повернути 3;
    case                 1000ULL ...                 9999ULL: повернути 4;
    case                10000ULL ...                99999ULL: повернути 5;
    case               100000ULL ...               999999ULL: повернути 6;
    case              1000000ULL ...              9999999ULL: повернути 7;
    case             10000000ULL ...             99999999ULL: повернути 8;
    case            100000000ULL ...            999999999ULL: повернути 9;
    case           1000000000ULL ...           9999999999ULL: повернути 10;
    case          10000000000ULL ...          99999999999ULL: повернути 11;
    case         100000000000ULL ...         999999999999ULL: повернути 12;
    case        1000000000000ULL ...        9999999999999ULL: повернути 13;
    case       10000000000000ULL ...       99999999999999ULL: повернути 14;
    case      100000000000000ULL ...      999999999999999ULL: повернути 15;
    case     1000000000000000ULL ...     9999999999999999ULL: повернути 16;
    case    10000000000000000ULL ...    99999999999999999ULL: повернути 17;
    case   100000000000000000ULL ...   999999999999999999ULL: повернути 18;
    case  1000000000000000000ULL ...  9999999999999999999ULL: повернути 19;
    case 10000000000000000000ULL ... 18446744073709551615ULL: повернути 20;
    }
    повернути 0;
}

ціле main(ціле argc, char **argv)
{
    unsigned ціле i;
    unsigned long long v = 1;

    v = 1;
    для (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    для (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    повернути 0;
}
