#شامل <limits.h>
#شامل <stdio.h>
#شامل <stdlib.h>

صحیح ibdg(طویل طویل n)
{
    انتخاب (n) {
    حالت                     1LL ...                   9LL: واپس 1;
    حالت                    10LL ...                  99LL: واپس 2;
    حالت                   100LL ...                 999LL: واپس 3;
    حالت                  1000LL ...                9999LL: واپس 4;
    حالت                 10000LL ...               99999LL: واپس 5;
    حالت                100000LL ...              999999LL: واپس 6;
    حالت               1000000LL ...             9999999LL: واپس 7;
    حالت              10000000LL ...            99999999LL: واپس 8;
    حالت             100000000LL ...           999999999LL: واپس 9;
    حالت            1000000000LL ...          9999999999LL: واپس 10;
    حالت           10000000000LL ...         99999999999LL: واپس 11;
    حالت          100000000000LL ...        999999999999LL: واپس 12;
    حالت         1000000000000LL ...       9999999999999LL: واپس 13;
    حالت        10000000000000LL ...      99999999999999LL: واپس 14;
    حالت       100000000000000LL ...     999999999999999LL: واپس 15;
    حالت      1000000000000000LL ...    9999999999999999LL: واپس 16;
    حالت     10000000000000000LL ...   99999999999999999LL: واپس 17;
    حالت    100000000000000000LL ...  999999999999999999LL: واپس 18;
    حالت   1000000000000000000LL ... 9223372036854775807LL: واپس 19;
    حالت  -9223372036854775807LL-1LL ...              -1LL: واپس 20;
    }
    واپس 0;
}

صحیح ubdg(غیرعلامتی طویل طویل n)
{
    انتخاب (n) {
    حالت                    1ULL ...                    9ULL: واپس 1;
    حالت                   10ULL ...                   99ULL: واپس 2;
    حالت                  100ULL ...                  999ULL: واپس 3;
    حالت                 1000ULL ...                 9999ULL: واپس 4;
    حالت                10000ULL ...                99999ULL: واپس 5;
    حالت               100000ULL ...               999999ULL: واپس 6;
    حالت              1000000ULL ...              9999999ULL: واپس 7;
    حالت             10000000ULL ...             99999999ULL: واپس 8;
    حالت            100000000ULL ...            999999999ULL: واپس 9;
    حالت           1000000000ULL ...           9999999999ULL: واپس 10;
    حالت          10000000000ULL ...          99999999999ULL: واپس 11;
    حالت         100000000000ULL ...         999999999999ULL: واپس 12;
    حالت        1000000000000ULL ...        9999999999999ULL: واپس 13;
    حالت       10000000000000ULL ...       99999999999999ULL: واپس 14;
    حالت      100000000000000ULL ...      999999999999999ULL: واپس 15;
    حالت     1000000000000000ULL ...     9999999999999999ULL: واپس 16;
    حالت    10000000000000000ULL ...    99999999999999999ULL: واپس 17;
    حالت   100000000000000000ULL ...   999999999999999999ULL: واپس 18;
    حالت  1000000000000000000ULL ...  9999999999999999999ULL: واپس 19;
    حالت 10000000000000000000ULL ... 18446744073709551615ULL: واپس 20;
    }
    واپس 0;
}

صحیح مین(صحیح argc, حرف **argv)
{
    غیرعلامتی صحیح i;
    غیرعلامتی طویل طویل v = 1;

    v = 1;
    برائے (i = 1; i <= 20; i++) {
        لکھو("%lld : %d\n", (طویل طویل) v, ibdg((طویل طویل)v));
        v *= 10;
    }
    v = 1;
    برائے (i = 1; i <= 20; i++) {
        لکھو("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    واپس 0;
}
