#ضمن <limits.h>
#ضمن <stdio.h>
#ضمن <stdlib.h>

صحيح ibdg(long long n)
{
    بدل (n) {
    حالة                     1LL ...                   9LL: إرجاع 1;
    حالة                    10LL ...                  99LL: إرجاع 2;
    حالة                   100LL ...                 999LL: إرجاع 3;
    حالة                  1000LL ...                9999LL: إرجاع 4;
    حالة                 10000LL ...               99999LL: إرجاع 5;
    حالة                100000LL ...              999999LL: إرجاع 6;
    حالة               1000000LL ...             9999999LL: إرجاع 7;
    حالة              10000000LL ...            99999999LL: إرجاع 8;
    حالة             100000000LL ...           999999999LL: إرجاع 9;
    حالة            1000000000LL ...          9999999999LL: إرجاع 10;
    حالة           10000000000LL ...         99999999999LL: إرجاع 11;
    حالة          100000000000LL ...        999999999999LL: إرجاع 12;
    حالة         1000000000000LL ...       9999999999999LL: إرجاع 13;
    حالة        10000000000000LL ...      99999999999999LL: إرجاع 14;
    حالة       100000000000000LL ...     999999999999999LL: إرجاع 15;
    حالة      1000000000000000LL ...    9999999999999999LL: إرجاع 16;
    حالة     10000000000000000LL ...   99999999999999999LL: إرجاع 17;
    حالة    100000000000000000LL ...  999999999999999999LL: إرجاع 18;
    حالة   1000000000000000000LL ... 9223372036854775807LL: إرجاع 19;
    حالة  -9223372036854775807LL-1LL ...              -1LL: إرجاع 20;
    }
    إرجاع 0;
}

صحيح ubdg(unsigned long long n)
{
    بدل (n) {
    حالة                    1ULL ...                    9ULL: إرجاع 1;
    حالة                   10ULL ...                   99ULL: إرجاع 2;
    حالة                  100ULL ...                  999ULL: إرجاع 3;
    حالة                 1000ULL ...                 9999ULL: إرجاع 4;
    حالة                10000ULL ...                99999ULL: إرجاع 5;
    حالة               100000ULL ...               999999ULL: إرجاع 6;
    حالة              1000000ULL ...              9999999ULL: إرجاع 7;
    حالة             10000000ULL ...             99999999ULL: إرجاع 8;
    حالة            100000000ULL ...            999999999ULL: إرجاع 9;
    حالة           1000000000ULL ...           9999999999ULL: إرجاع 10;
    حالة          10000000000ULL ...          99999999999ULL: إرجاع 11;
    حالة         100000000000ULL ...         999999999999ULL: إرجاع 12;
    حالة        1000000000000ULL ...        9999999999999ULL: إرجاع 13;
    حالة       10000000000000ULL ...       99999999999999ULL: إرجاع 14;
    حالة      100000000000000ULL ...      999999999999999ULL: إرجاع 15;
    حالة     1000000000000000ULL ...     9999999999999999ULL: إرجاع 16;
    حالة    10000000000000000ULL ...    99999999999999999ULL: إرجاع 17;
    حالة   100000000000000000ULL ...   999999999999999999ULL: إرجاع 18;
    حالة  1000000000000000000ULL ...  9999999999999999999ULL: إرجاع 19;
    حالة 10000000000000000000ULL ... 18446744073709551615ULL: إرجاع 20;
    }
    إرجاع 0;
}

صحيح الرئيسية(صحيح argc, حرف **argv)
{
    unsigned صحيح i;
    unsigned long long v = 1;

    v = 1;
    لكل (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    لكل (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    إرجاع 0;
}
