#अन्तर्भाव <limits.h>
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <stdlib.h>

पूर्णाङ्क ibdg(दीर्घ दीर्घ n)
{
    विकल्प (n) {
    पक्ष                     1LL ...                   9LL: प्रत्यागम 1;
    पक्ष                    10LL ...                  99LL: प्रत्यागम 2;
    पक्ष                   100LL ...                 999LL: प्रत्यागम 3;
    पक्ष                  1000LL ...                9999LL: प्रत्यागम 4;
    पक्ष                 10000LL ...               99999LL: प्रत्यागम 5;
    पक्ष                100000LL ...              999999LL: प्रत्यागम 6;
    पक्ष               1000000LL ...             9999999LL: प्रत्यागम 7;
    पक्ष              10000000LL ...            99999999LL: प्रत्यागम 8;
    पक्ष             100000000LL ...           999999999LL: प्रत्यागम 9;
    पक्ष            1000000000LL ...          9999999999LL: प्रत्यागम 10;
    पक्ष           10000000000LL ...         99999999999LL: प्रत्यागम 11;
    पक्ष          100000000000LL ...        999999999999LL: प्रत्यागम 12;
    पक्ष         1000000000000LL ...       9999999999999LL: प्रत्यागम 13;
    पक्ष        10000000000000LL ...      99999999999999LL: प्रत्यागम 14;
    पक्ष       100000000000000LL ...     999999999999999LL: प्रत्यागम 15;
    पक्ष      1000000000000000LL ...    9999999999999999LL: प्रत्यागम 16;
    पक्ष     10000000000000000LL ...   99999999999999999LL: प्रत्यागम 17;
    पक्ष    100000000000000000LL ...  999999999999999999LL: प्रत्यागम 18;
    पक्ष   1000000000000000000LL ... 9223372036854775807LL: प्रत्यागम 19;
    पक्ष  -9223372036854775807LL-1LL ...              -1LL: प्रत्यागम 20;
    }
    प्रत्यागम 0;
}

पूर्णाङ्क ubdg(अचिह्नित दीर्घ दीर्घ n)
{
    विकल्प (n) {
    पक्ष                    1ULL ...                    9ULL: प्रत्यागम 1;
    पक्ष                   10ULL ...                   99ULL: प्रत्यागम 2;
    पक्ष                  100ULL ...                  999ULL: प्रत्यागम 3;
    पक्ष                 1000ULL ...                 9999ULL: प्रत्यागम 4;
    पक्ष                10000ULL ...                99999ULL: प्रत्यागम 5;
    पक्ष               100000ULL ...               999999ULL: प्रत्यागम 6;
    पक्ष              1000000ULL ...              9999999ULL: प्रत्यागम 7;
    पक्ष             10000000ULL ...             99999999ULL: प्रत्यागम 8;
    पक्ष            100000000ULL ...            999999999ULL: प्रत्यागम 9;
    पक्ष           1000000000ULL ...           9999999999ULL: प्रत्यागम 10;
    पक्ष          10000000000ULL ...          99999999999ULL: प्रत्यागम 11;
    पक्ष         100000000000ULL ...         999999999999ULL: प्रत्यागम 12;
    पक्ष        1000000000000ULL ...        9999999999999ULL: प्रत्यागम 13;
    पक्ष       10000000000000ULL ...       99999999999999ULL: प्रत्यागम 14;
    पक्ष      100000000000000ULL ...      999999999999999ULL: प्रत्यागम 15;
    पक्ष     1000000000000000ULL ...     9999999999999999ULL: प्रत्यागम 16;
    पक्ष    10000000000000000ULL ...    99999999999999999ULL: प्रत्यागम 17;
    पक्ष   100000000000000000ULL ...   999999999999999999ULL: प्रत्यागम 18;
    पक्ष  1000000000000000000ULL ...  9999999999999999999ULL: प्रत्यागम 19;
    पक्ष 10000000000000000000ULL ... 18446744073709551615ULL: प्रत्यागम 20;
    }
    प्रत्यागम 0;
}

पूर्णाङ्क मुख्यम्(पूर्णाङ्क argc, वर्ण **argv)
{
    अचिह्नित पूर्णाङ्क i;
    अचिह्नित दीर्घ दीर्घ v = 1;

    v = 1;
    प्रति (i = 1; i <= 20; i++) {
        प्रारूप_लिख("%lld : %d\n", (दीर्घ दीर्घ) v, ibdg((दीर्घ दीर्घ)v));
        v *= 10;
    }
    v = 1;
    प्रति (i = 1; i <= 20; i++) {
        प्रारूप_लिख("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    प्रत्यागम 0;
}
