#ଅନ୍ତର୍ଭାଵ <limits.h>
#ଅନ୍ତର୍ଭାଵ <stdio.h>
#ଅନ୍ତର୍ଭାଵ <stdlib.h>

ପୂର୍ଣ୍ଣସଂଖ୍ୟା ibdg(long long n)
{
    ବାଛ (n) {
    ସ୍ଥିତି                     1LL ...                   9LL: ଫେରନ୍ତୁ 1;
    ସ୍ଥିତି                    10LL ...                  99LL: ଫେରନ୍ତୁ 2;
    ସ୍ଥିତି                   100LL ...                 999LL: ଫେରନ୍ତୁ 3;
    ସ୍ଥିତି                  1000LL ...                9999LL: ଫେରନ୍ତୁ 4;
    ସ୍ଥିତି                 10000LL ...               99999LL: ଫେରନ୍ତୁ 5;
    ସ୍ଥିତି                100000LL ...              999999LL: ଫେରନ୍ତୁ 6;
    ସ୍ଥିତି               1000000LL ...             9999999LL: ଫେରନ୍ତୁ 7;
    ସ୍ଥିତି              10000000LL ...            99999999LL: ଫେରନ୍ତୁ 8;
    ସ୍ଥିତି             100000000LL ...           999999999LL: ଫେରନ୍ତୁ 9;
    ସ୍ଥିତି            1000000000LL ...          9999999999LL: ଫେରନ୍ତୁ 10;
    ସ୍ଥିତି           10000000000LL ...         99999999999LL: ଫେରନ୍ତୁ 11;
    ସ୍ଥିତି          100000000000LL ...        999999999999LL: ଫେରନ୍ତୁ 12;
    ସ୍ଥିତି         1000000000000LL ...       9999999999999LL: ଫେରନ୍ତୁ 13;
    ସ୍ଥିତି        10000000000000LL ...      99999999999999LL: ଫେରନ୍ତୁ 14;
    ସ୍ଥିତି       100000000000000LL ...     999999999999999LL: ଫେରନ୍ତୁ 15;
    ସ୍ଥିତି      1000000000000000LL ...    9999999999999999LL: ଫେରନ୍ତୁ 16;
    ସ୍ଥିତି     10000000000000000LL ...   99999999999999999LL: ଫେରନ୍ତୁ 17;
    ସ୍ଥିତି    100000000000000000LL ...  999999999999999999LL: ଫେରନ୍ତୁ 18;
    ସ୍ଥିତି   1000000000000000000LL ... 9223372036854775807LL: ଫେରନ୍ତୁ 19;
    ସ୍ଥିତି  -9223372036854775807LL-1LL ...              -1LL: ଫେରନ୍ତୁ 20;
    }
    ଫେରନ୍ତୁ 0;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା ubdg(unsigned long long n)
{
    ବାଛ (n) {
    ସ୍ଥିତି                    1ULL ...                    9ULL: ଫେରନ୍ତୁ 1;
    ସ୍ଥିତି                   10ULL ...                   99ULL: ଫେରନ୍ତୁ 2;
    ସ୍ଥିତି                  100ULL ...                  999ULL: ଫେରନ୍ତୁ 3;
    ସ୍ଥିତି                 1000ULL ...                 9999ULL: ଫେରନ୍ତୁ 4;
    ସ୍ଥିତି                10000ULL ...                99999ULL: ଫେରନ୍ତୁ 5;
    ସ୍ଥିତି               100000ULL ...               999999ULL: ଫେରନ୍ତୁ 6;
    ସ୍ଥିତି              1000000ULL ...              9999999ULL: ଫେରନ୍ତୁ 7;
    ସ୍ଥିତି             10000000ULL ...             99999999ULL: ଫେରନ୍ତୁ 8;
    ସ୍ଥିତି            100000000ULL ...            999999999ULL: ଫେରନ୍ତୁ 9;
    ସ୍ଥିତି           1000000000ULL ...           9999999999ULL: ଫେରନ୍ତୁ 10;
    ସ୍ଥିତି          10000000000ULL ...          99999999999ULL: ଫେରନ୍ତୁ 11;
    ସ୍ଥିତି         100000000000ULL ...         999999999999ULL: ଫେରନ୍ତୁ 12;
    ସ୍ଥିତି        1000000000000ULL ...        9999999999999ULL: ଫେରନ୍ତୁ 13;
    ସ୍ଥିତି       10000000000000ULL ...       99999999999999ULL: ଫେରନ୍ତୁ 14;
    ସ୍ଥିତି      100000000000000ULL ...      999999999999999ULL: ଫେରନ୍ତୁ 15;
    ସ୍ଥିତି     1000000000000000ULL ...     9999999999999999ULL: ଫେରନ୍ତୁ 16;
    ସ୍ଥିତି    10000000000000000ULL ...    99999999999999999ULL: ଫେରନ୍ତୁ 17;
    ସ୍ଥିତି   100000000000000000ULL ...   999999999999999999ULL: ଫେରନ୍ତୁ 18;
    ସ୍ଥିତି  1000000000000000000ULL ...  9999999999999999999ULL: ଫେରନ୍ତୁ 19;
    ସ୍ଥିତି 10000000000000000000ULL ... 18446744073709551615ULL: ଫେରନ୍ତୁ 20;
    }
    ଫେରନ୍ତୁ 0;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା ମୁଖ୍ୟ(ପୂର୍ଣ୍ଣସଂଖ୍ୟା argc, ଅକ୍ଷର **argv)
{
    unsigned ପୂର୍ଣ୍ଣସଂଖ୍ୟା i;
    unsigned long long v = 1;

    v = 1;
    ପାଇଁ (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    ପାଇଁ (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    ଫେରନ୍ତୁ 0;
}
