#அந்தர்பாவ <limits.h>
#அந்தர்பாவ <stdio.h>
#அந்தர்பாவ <stdlib.h>

முழு ibdg(long long n)
{
    தேர்வு (n) {
    நிலை                     1LL ...                   9LL: திரும்பு 1;
    நிலை                    10LL ...                  99LL: திரும்பு 2;
    நிலை                   100LL ...                 999LL: திரும்பு 3;
    நிலை                  1000LL ...                9999LL: திரும்பு 4;
    நிலை                 10000LL ...               99999LL: திரும்பு 5;
    நிலை                100000LL ...              999999LL: திரும்பு 6;
    நிலை               1000000LL ...             9999999LL: திரும்பு 7;
    நிலை              10000000LL ...            99999999LL: திரும்பு 8;
    நிலை             100000000LL ...           999999999LL: திரும்பு 9;
    நிலை            1000000000LL ...          9999999999LL: திரும்பு 10;
    நிலை           10000000000LL ...         99999999999LL: திரும்பு 11;
    நிலை          100000000000LL ...        999999999999LL: திரும்பு 12;
    நிலை         1000000000000LL ...       9999999999999LL: திரும்பு 13;
    நிலை        10000000000000LL ...      99999999999999LL: திரும்பு 14;
    நிலை       100000000000000LL ...     999999999999999LL: திரும்பு 15;
    நிலை      1000000000000000LL ...    9999999999999999LL: திரும்பு 16;
    நிலை     10000000000000000LL ...   99999999999999999LL: திரும்பு 17;
    நிலை    100000000000000000LL ...  999999999999999999LL: திரும்பு 18;
    நிலை   1000000000000000000LL ... 9223372036854775807LL: திரும்பு 19;
    நிலை  -9223372036854775807LL-1LL ...              -1LL: திரும்பு 20;
    }
    திரும்பு 0;
}

முழு ubdg(unsigned long long n)
{
    தேர்வு (n) {
    நிலை                    1ULL ...                    9ULL: திரும்பு 1;
    நிலை                   10ULL ...                   99ULL: திரும்பு 2;
    நிலை                  100ULL ...                  999ULL: திரும்பு 3;
    நிலை                 1000ULL ...                 9999ULL: திரும்பு 4;
    நிலை                10000ULL ...                99999ULL: திரும்பு 5;
    நிலை               100000ULL ...               999999ULL: திரும்பு 6;
    நிலை              1000000ULL ...              9999999ULL: திரும்பு 7;
    நிலை             10000000ULL ...             99999999ULL: திரும்பு 8;
    நிலை            100000000ULL ...            999999999ULL: திரும்பு 9;
    நிலை           1000000000ULL ...           9999999999ULL: திரும்பு 10;
    நிலை          10000000000ULL ...          99999999999ULL: திரும்பு 11;
    நிலை         100000000000ULL ...         999999999999ULL: திரும்பு 12;
    நிலை        1000000000000ULL ...        9999999999999ULL: திரும்பு 13;
    நிலை       10000000000000ULL ...       99999999999999ULL: திரும்பு 14;
    நிலை      100000000000000ULL ...      999999999999999ULL: திரும்பு 15;
    நிலை     1000000000000000ULL ...     9999999999999999ULL: திரும்பு 16;
    நிலை    10000000000000000ULL ...    99999999999999999ULL: திரும்பு 17;
    நிலை   100000000000000000ULL ...   999999999999999999ULL: திரும்பு 18;
    நிலை  1000000000000000000ULL ...  9999999999999999999ULL: திரும்பு 19;
    நிலை 10000000000000000000ULL ... 18446744073709551615ULL: திரும்பு 20;
    }
    திரும்பு 0;
}

முழு முதன்மை(முழு argc, எழுத்து **argv)
{
    unsigned முழு i;
    unsigned long long v = 1;

    v = 1;
    க்கு (i = 1; i <= 20; i++) {
        printf("%lld : %d\n", (long long) v, ibdg((long long)v));
        v *= 10;
    }
    v = 1;
    க்கு (i = 1; i <= 20; i++) {
        printf("%llu : %d\n", v, ubdg(v));
        v *= 10;
    }
    திரும்பு 0;
}
