//#include <stdio.h>
خارجی صحیح لکھو(ثابت حرف *, ...);

صحیح مین()
{
   صحیح a;
   صحیح b;
   صحیح c;
   صحیح d;
   صحیح e;
   صحیح f;
   صحیح x;
   صحیح y;

   a = 12;
   b = 34;
   c = 56;
   d = 78;
   e = 0;
   f = 1;

   لکھو("%d\n", c + d);
   لکھو("%d\n", (y = c + d));
   لکھو("%d\n", e || e && f);
   لکھو("%d\n", e || f && f);
   لکھو("%d\n", e && e || f);
   لکھو("%d\n", e && f || f);
   لکھو("%d\n", a && f | f);
   لکھو("%d\n", a | b ^ c & d);
   لکھو("%d, %d\n", a == a, a == b);
   لکھو("%d, %d\n", a != a, a != b);
   لکھو("%d\n", a != b && c != d);
   لکھو("%d\n", a + b * c / f);
   لکھو("%d\n", a + b * c / f);
   لکھو("%d\n", (4 << 4));
   لکھو("%d\n", (64 >> 4));

   واپس 0;
}

// vim: set expandtab ts=4 sw=3 sts=3 tw=80 :
