//#include <stdio.h>
बाह्य पूर्णाङ्क प्रारूप_लिख(ध्रुव वर्ण *, ...);

पूर्णाङ्क मुख्यम्()
{
   पूर्णाङ्क a;
   पूर्णाङ्क b;
   पूर्णाङ्क c;
   पूर्णाङ्क d;
   पूर्णाङ्क e;
   पूर्णाङ्क f;
   पूर्णाङ्क x;
   पूर्णाङ्क y;

   a = 12;
   b = 34;
   c = 56;
   d = 78;
   e = 0;
   f = 1;

   प्रारूप_लिख("%d\n", c + d);
   प्रारूप_लिख("%d\n", (y = c + d));
   प्रारूप_लिख("%d\n", e || e && f);
   प्रारूप_लिख("%d\n", e || f && f);
   प्रारूप_लिख("%d\n", e && e || f);
   प्रारूप_लिख("%d\n", e && f || f);
   प्रारूप_लिख("%d\n", a && f | f);
   प्रारूप_लिख("%d\n", a | b ^ c & d);
   प्रारूप_लिख("%d, %d\n", a == a, a == b);
   प्रारूप_लिख("%d, %d\n", a != a, a != b);
   प्रारूप_लिख("%d\n", a != b && c != d);
   प्रारूप_लिख("%d\n", a + b * c / f);
   प्रारूप_लिख("%d\n", a + b * c / f);
   प्रारूप_लिख("%d\n", (4 << 4));
   प्रारूप_लिख("%d\n", (64 >> 4));

   प्रत्यागम 0;
}

// vim: set expandtab ts=4 sw=3 sts=3 tw=80 :
