//#include <stdio.h>
बाह्य पूर्णांक म_लिखो(स्थिर अक्षर *, ...);

पूर्णांक मुख्य()
{
   पूर्णांक a;
   पूर्णांक b;
   पूर्णांक c;
   पूर्णांक d;
   पूर्णांक e;
   पूर्णांक f;
   पूर्णांक x;
   पूर्णांक y;

   a = 12;
   b = 34;
   c = 56;
   d = 78;
   e = 0;
   f = 1;

   म_लिखो("%d\n", c + d);
   म_लिखो("%d\n", (y = c + d));
   म_लिखो("%d\n", e || e && f);
   म_लिखो("%d\n", e || f && f);
   म_लिखो("%d\n", e && e || f);
   म_लिखो("%d\n", e && f || f);
   म_लिखो("%d\n", a && f | f);
   म_लिखो("%d\n", a | b ^ c & d);
   म_लिखो("%d, %d\n", a == a, a == b);
   म_लिखो("%d, %d\n", a != a, a != b);
   म_लिखो("%d\n", a != b && c != d);
   म_लिखो("%d\n", a + b * c / f);
   म_लिखो("%d\n", a + b * c / f);
   म_लिखो("%d\n", (4 << 4));
   म_लिखो("%d\n", (64 >> 4));

   वापस 0;
}

// vim: set expandtab ts=4 sw=3 sts=3 tw=80 :
