//#include <stdio.h>
ਬਾਹਰੀ ਪੂਰਨ ਲਿਖੋ(ਅਚਲ ਅੱਖਰ *, ...);

ਪੂਰਨ ਮੁੱਖ()
{
   ਪੂਰਨ a;
   ਪੂਰਨ b;
   ਪੂਰਨ c;
   ਪੂਰਨ d;
   ਪੂਰਨ e;
   ਪੂਰਨ f;
   ਪੂਰਨ x;
   ਪੂਰਨ y;

   a = 12;
   b = 34;
   c = 56;
   d = 78;
   e = 0;
   f = 1;

   ਲਿਖੋ("%d\n", c + d);
   ਲਿਖੋ("%d\n", (y = c + d));
   ਲਿਖੋ("%d\n", e || e && f);
   ਲਿਖੋ("%d\n", e || f && f);
   ਲਿਖੋ("%d\n", e && e || f);
   ਲਿਖੋ("%d\n", e && f || f);
   ਲਿਖੋ("%d\n", a && f | f);
   ਲਿਖੋ("%d\n", a | b ^ c & d);
   ਲਿਖੋ("%d, %d\n", a == a, a == b);
   ਲਿਖੋ("%d, %d\n", a != a, a != b);
   ਲਿਖੋ("%d\n", a != b && c != d);
   ਲਿਖੋ("%d\n", a + b * c / f);
   ਲਿਖੋ("%d\n", a + b * c / f);
   ਲਿਖੋ("%d\n", (4 << 4));
   ਲਿਖੋ("%d\n", (64 >> 4));

   ਵਾਪਸ 0;
}

// vim: set expandtab ts=4 sw=3 sts=3 tw=80 :
