//#include <stdio.h>
خارجي صحيح چاپ_کړه(ثابت حرف *, ...);

صحيح اصلي()
{
   صحيح a;
   صحيح b;
   صحيح c;
   صحيح d;
   صحيح e;
   صحيح f;
   صحيح x;
   صحيح y;

   a = 12;
   b = 34;
   c = 56;
   d = 78;
   e = 0;
   f = 1;

   چاپ_کړه("%d\n", c + d);
   چاپ_کړه("%d\n", (y = c + d));
   چاپ_کړه("%d\n", e || e && f);
   چاپ_کړه("%d\n", e || f && f);
   چاپ_کړه("%d\n", e && e || f);
   چاپ_کړه("%d\n", e && f || f);
   چاپ_کړه("%d\n", a && f | f);
   چاپ_کړه("%d\n", a | b ^ c & d);
   چاپ_کړه("%d, %d\n", a == a, a == b);
   چاپ_کړه("%d, %d\n", a != a, a != b);
   چاپ_کړه("%d\n", a != b && c != d);
   چاپ_کړه("%d\n", a + b * c / f);
   چاپ_کړه("%d\n", a + b * c / f);
   چاپ_کړه("%d\n", (4 << 4));
   چاپ_کړه("%d\n", (64 >> 4));

   أرجع 0;
}

// vim: set expandtab ts=4 sw=3 sts=3 tw=80 :
