//#include <stdio.h>
ಬಾಹ್ಯ ಪೂರ್ಣಾಂಕ ಬರೆ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ...);

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
   ಪೂರ್ಣಾಂಕ a;
   ಪೂರ್ಣಾಂಕ b;
   ಪೂರ್ಣಾಂಕ c;
   ಪೂರ್ಣಾಂಕ d;
   ಪೂರ್ಣಾಂಕ e;
   ಪೂರ್ಣಾಂಕ f;
   ಪೂರ್ಣಾಂಕ x;
   ಪೂರ್ಣಾಂಕ y;

   a = 12;
   b = 34;
   c = 56;
   d = 78;
   e = 0;
   f = 1;

   ಬರೆ("%d\n", c + d);
   ಬರೆ("%d\n", (y = c + d));
   ಬರೆ("%d\n", e || e && f);
   ಬರೆ("%d\n", e || f && f);
   ಬರೆ("%d\n", e && e || f);
   ಬರೆ("%d\n", e && f || f);
   ಬರೆ("%d\n", a && f | f);
   ಬರೆ("%d\n", a | b ^ c & d);
   ಬರೆ("%d, %d\n", a == a, a == b);
   ಬರೆ("%d, %d\n", a != a, a != b);
   ಬರೆ("%d\n", a != b && c != d);
   ಬರೆ("%d\n", a + b * c / f);
   ಬರೆ("%d\n", a + b * c / f);
   ಬರೆ("%d\n", (4 << 4));
   ಬರೆ("%d\n", (64 >> 4));

   ಹಿಂತಿರುಗಿ 0;
}

// vim: set expandtab ts=4 sw=3 sts=3 tw=80 :
