//#include <stdio.h>
బాహ్య పూర్ణాంకం రాయి(స్థిరరాశి అక్షరం *, ...);

పూర్ణాంకం ప్రధాన()
{
   పూర్ణాంకం a;
   పూర్ణాంకం b;
   పూర్ణాంకం c;
   పూర్ణాంకం d;
   పూర్ణాంకం e;
   పూర్ణాంకం f;
   పూర్ణాంకం x;
   పూర్ణాంకం y;

   a = 12;
   b = 34;
   c = 56;
   d = 78;
   e = 0;
   f = 1;

   రాయి("%d\n", c + d);
   రాయి("%d\n", (y = c + d));
   రాయి("%d\n", e || e && f);
   రాయి("%d\n", e || f && f);
   రాయి("%d\n", e && e || f);
   రాయి("%d\n", e && f || f);
   రాయి("%d\n", a && f | f);
   రాయి("%d\n", a | b ^ c & d);
   రాయి("%d, %d\n", a == a, a == b);
   రాయి("%d, %d\n", a != a, a != b);
   రాయి("%d\n", a != b && c != d);
   రాయి("%d\n", a + b * c / f);
   రాయి("%d\n", a + b * c / f);
   రాయి("%d\n", (4 << 4));
   రాయి("%d\n", (64 >> 4));

   తిరిగి 0;
}

// vim: set expandtab ts=4 sw=3 sts=3 tw=80 :
