#ضمن <stdio.h>

تعريفنوع بنية {
    صحيح انکڑے[4];
    مزدوج d1;
    مزدوج d2;
} گرہ_2;

تعريفنوع بنية {
    صحيح a, b, c;
} A;

گرہ_2 init(گرہ_2 self) {
    self.انکڑے[0] = 0;
    self.انکڑے[1] = 1;
    self.انکڑے[2] = 2;
    self.انکڑے[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    أرجع self;
}

فراغ dummy(گرہ_2 self) {
}

فراغ print_انکڑے(گرہ_2 انکڑے) {
    لکھو ("%d %d %d %d %g %g\n",
            انکڑے.انکڑے[0], انکڑے.انکڑے[1], انکڑے.انکڑے[2], انکڑے.انکڑے[3],
            انکڑے.d1, انکڑے.d2);
}

A test(فراغ)
{
    صحيح i;
    A arr[30];

    لكل (i = 0; i < 30; i++)
        arr[i].b = i;
    أرجع arr[29];
}

صحيح مکھ(فراغ) {
    /* This code resulted in a bounds checking error */
    گرہ_2 انکڑے;
    A a;
    dummy (انکڑے);
    حرف val;
    انکڑے = init (انکڑے);
    print_انکڑے(انکڑے);
    a = test();
    لکھو("%d\n", a.b);
    أرجع 0;
}
