#ಅನ್ತರ್ಭಾವ <stdio.h>

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ರಚನೆ {
    ಪೂರ್ಣಾಂಕ ದತ್ತಾಂಶ[4];
    ದ್ವಿಗುಣ d1;
    ದ್ವಿಗುಣ d2;
} ಗಂಟು_2;

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ರಚನೆ {
    ಪೂರ್ಣಾಂಕ a, b, c;
} A;

ಗಂಟು_2 init(ಗಂಟು_2 self) {
    self.ದತ್ತಾಂಶ[0] = 0;
    self.ದತ್ತಾಂಶ[1] = 1;
    self.ದತ್ತಾಂಶ[2] = 2;
    self.ದತ್ತಾಂಶ[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    ಹಿಂತಿರುಗಿ self;
}

ಶೂನ್ಯ dummy(ಗಂಟು_2 self) {
}

ಶೂನ್ಯ print_ದತ್ತಾಂಶ(ಗಂಟು_2 ದತ್ತಾಂಶ) {
    ಬರೆ ("%d %d %d %d %g %g\n",
            ದತ್ತಾಂಶ.ದತ್ತಾಂಶ[0], ದತ್ತಾಂಶ.ದತ್ತಾಂಶ[1], ದತ್ತಾಂಶ.ದತ್ತಾಂಶ[2], ದತ್ತಾಂಶ.ದತ್ತಾಂಶ[3],
            ದತ್ತಾಂಶ.d1, ದತ್ತಾಂಶ.d2);
}

A test(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ i;
    A arr[30];

    ಗಾಗಿ (i = 0; i < 30; i++)
        arr[i].b = i;
    ಹಿಂತಿರುಗಿ arr[29];
}

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ) {
    /* This code resulted in a bounds checking error */
    ಗಂಟು_2 ದತ್ತಾಂಶ;
    A a;
    dummy (ದತ್ತಾಂಶ);
    ಅಕ್ಷರ val;
    ದತ್ತಾಂಶ = init (ದತ್ತಾಂಶ);
    print_ದತ್ತಾಂಶ(ದತ್ತಾಂಶ);
    a = test();
    ಬರೆ("%d\n", a.b);
    ಹಿಂತಿರುಗಿ 0;
}
