#ضمن <stdio.h>

تعريفنوع بنية {
    صحيح معلومات[4];
    مزدوج d1;
    مزدوج d2;
} غوټه_2;

تعريفنوع بنية {
    صحيح a, b, c;
} A;

غوټه_2 init(غوټه_2 self) {
    self.معلومات[0] = 0;
    self.معلومات[1] = 1;
    self.معلومات[2] = 2;
    self.معلومات[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    أرجع self;
}

فراغ dummy(غوټه_2 self) {
}

فراغ print_معلومات(غوټه_2 معلومات) {
    چاپ_کړه ("%d %d %d %d %g %g\n",
            معلومات.معلومات[0], معلومات.معلومات[1], معلومات.معلومات[2], معلومات.معلومات[3],
            معلومات.d1, معلومات.d2);
}

A test(فراغ)
{
    صحيح i;
    A arr[30];

    لكل (i = 0; i < 30; i++)
        arr[i].b = i;
    أرجع arr[29];
}

صحيح اصلي(فراغ) {
    /* This code resulted in a bounds checking error */
    غوټه_2 معلومات;
    A a;
    dummy (معلومات);
    حرف val;
    معلومات = init (معلومات);
    print_معلومات(معلومات);
    a = test();
    چاپ_کړه("%d\n", a.b);
    أرجع 0;
}
