#अन्तर्भाव <stdio.h>

प्रकारनिर्देश संरचना {
    पूर्णाङ्क दत्त[4];
    द्विगुण d1;
    द्विगुण d2;
} ग्रन्थिः_2;

प्रकारनिर्देश संरचना {
    पूर्णाङ्क a, b, c;
} A;

ग्रन्थिः_2 init(ग्रन्थिः_2 self) {
    self.दत्त[0] = 0;
    self.दत्त[1] = 1;
    self.दत्त[2] = 2;
    self.दत्त[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    प्रत्यागम self;
}

शून्य dummy(ग्रन्थिः_2 self) {
}

शून्य print_दत्त(ग्रन्थिः_2 दत्त) {
    प्रारूप_लिख ("%d %d %d %d %g %g\n",
            दत्त.दत्त[0], दत्त.दत्त[1], दत्त.दत्त[2], दत्त.दत्त[3],
            दत्त.d1, दत्त.d2);
}

A test(शून्य)
{
    पूर्णाङ्क i;
    A arr[30];

    प्रति (i = 0; i < 30; i++)
        arr[i].b = i;
    प्रत्यागम arr[29];
}

पूर्णाङ्क मुख्यम्(शून्य) {
    /* This code resulted in a bounds checking error */
    ग्रन्थिः_2 दत्त;
    A a;
    dummy (दत्त);
    वर्ण val;
    दत्त = init (दत्त);
    print_दत्त(दत्त);
    a = test();
    प्रारूप_लिख("%d\n", a.b);
    प्रत्यागम 0;
}
