#समावेश <stdio.h>

प्रकार काष्ठा {
    पूर्णांक तथ्य[4];
    द्विगुन d1;
    द्विगुन d2;
} गाँठ_2;

प्रकार काष्ठा {
    पूर्णांक a, b, c;
} A;

गाँठ_2 init(गाँठ_2 self) {
    self.तथ्य[0] = 0;
    self.तथ्य[1] = 1;
    self.तथ्य[2] = 2;
    self.तथ्य[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    वापस self;
}

व्योम dummy(गाँठ_2 self) {
}

व्योम print_तथ्य(गाँठ_2 तथ्य) {
    म_लिखो ("%d %d %d %d %g %g\n",
            तथ्य.तथ्य[0], तथ्य.तथ्य[1], तथ्य.तथ्य[2], तथ्य.तथ्य[3],
            तथ्य.d1, तथ्य.d2);
}

A test(व्योम)
{
    पूर्णांक i;
    A arr[30];

    क्रम (i = 0; i < 30; i++)
        arr[i].b = i;
    वापस arr[29];
}

पूर्णांक मुख्य(व्योम) {
    /* This code resulted in a bounds checking error */
    गाँठ_2 तथ्य;
    A a;
    dummy (तथ्य);
    अक्षर val;
    तथ्य = init (तथ्य);
    print_तथ्य(तथ्य);
    a = test();
    म_लिखो("%d\n", a.b);
    वापस 0;
}
