#شامل <stdio.h>

قسمتعریف ساخت {
    صحیح ڈیٹا[4];
    دوہرا d1;
    دوہرا d2;
} گرہ_2;

قسمتعریف ساخت {
    صحیح a, b, c;
} A;

گرہ_2 init(گرہ_2 self) {
    self.ڈیٹا[0] = 0;
    self.ڈیٹا[1] = 1;
    self.ڈیٹا[2] = 2;
    self.ڈیٹا[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    واپس self;
}

خالی dummy(گرہ_2 self) {
}

خالی print_ڈیٹا(گرہ_2 ڈیٹا) {
    لکھو ("%d %d %d %d %g %g\n",
            ڈیٹا.ڈیٹا[0], ڈیٹا.ڈیٹا[1], ڈیٹا.ڈیٹا[2], ڈیٹا.ڈیٹا[3],
            ڈیٹا.d1, ڈیٹا.d2);
}

A test(خالی)
{
    صحیح i;
    A arr[30];

    برائے (i = 0; i < 30; i++)
        arr[i].b = i;
    واپس arr[29];
}

صحیح مین(خالی) {
    /* This code resulted in a bounds checking error */
    گرہ_2 ڈیٹا;
    A a;
    dummy (ڈیٹا);
    حرف val;
    ڈیٹا = init (ڈیٹا);
    print_ڈیٹا(ڈیٹا);
    a = test();
    لکھو("%d\n", a.b);
    واپس 0;
}
