#অন্তর্ভাব <stdio.h>

প্রকারলেখ কাঠামো {
    পূর্ণসংখ্যা তথ্য[4];
    দ্বিগুণ d1;
    দ্বিগুণ d2;
} গ্রন্থি_2;

প্রকারলেখ কাঠামো {
    পূর্ণসংখ্যা a, b, c;
} A;

গ্রন্থি_2 init(গ্রন্থি_2 self) {
    self.তথ্য[0] = 0;
    self.তথ্য[1] = 1;
    self.তথ্য[2] = 2;
    self.তথ্য[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    ফেরত self;
}

শূন্য dummy(গ্রন্থি_2 self) {
}

শূন্য print_তথ্য(গ্রন্থি_2 তথ্য) {
    printf ("%d %d %d %d %g %g\n",
            তথ্য.তথ্য[0], তথ্য.তথ্য[1], তথ্য.তথ্য[2], তথ্য.তথ্য[3],
            তথ্য.d1, তথ্য.d2);
}

A test(শূন্য)
{
    পূর্ণসংখ্যা i;
    A arr[30];

    জন্য (i = 0; i < 30; i++)
        arr[i].b = i;
    ফেরত arr[29];
}

পূর্ণসংখ্যা প্রধান(শূন্য) {
    /* This code resulted in a bounds checking error */
    গ্রন্থি_2 তথ্য;
    A a;
    dummy (তথ্য);
    অক্ষর val;
    তথ্য = init (তথ্য);
    print_তথ্য(তথ্য);
    a = test();
    printf("%d\n", a.b);
    ফেরত 0;
}
