#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

ਕਿਸਮਪਰਿਭਾਸ਼ਾ ਬਣਤਰ {
    ਪੂਰਨ ਅੰਕੜੇ[4];
    ਦੁੱਗਣਾ d1;
    ਦੁੱਗਣਾ d2;
} ਗੰਢ_2;

ਕਿਸਮਪਰਿਭਾਸ਼ਾ ਬਣਤਰ {
    ਪੂਰਨ a, b, c;
} A;

ਗੰਢ_2 init(ਗੰਢ_2 self) {
    self.ਅੰਕੜੇ[0] = 0;
    self.ਅੰਕੜੇ[1] = 1;
    self.ਅੰਕੜੇ[2] = 2;
    self.ਅੰਕੜੇ[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    ਵਾਪਸ self;
}

ਖਾਲੀ dummy(ਗੰਢ_2 self) {
}

ਖਾਲੀ print_ਅੰਕੜੇ(ਗੰਢ_2 ਅੰਕੜੇ) {
    ਲਿਖੋ ("%d %d %d %d %g %g\n",
            ਅੰਕੜੇ.ਅੰਕੜੇ[0], ਅੰਕੜੇ.ਅੰਕੜੇ[1], ਅੰਕੜੇ.ਅੰਕੜੇ[2], ਅੰਕੜੇ.ਅੰਕੜੇ[3],
            ਅੰਕੜੇ.d1, ਅੰਕੜੇ.d2);
}

A test(ਖਾਲੀ)
{
    ਪੂਰਨ i;
    A arr[30];

    ਲਈ (i = 0; i < 30; i++)
        arr[i].b = i;
    ਵਾਪਸ arr[29];
}

ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ) {
    /* This code resulted in a bounds checking error */
    ਗੰਢ_2 ਅੰਕੜੇ;
    A a;
    dummy (ਅੰਕੜੇ);
    ਅੱਖਰ val;
    ਅੰਕੜੇ = init (ਅੰਕੜੇ);
    print_ਅੰਕੜੇ(ਅੰਕੜੇ);
    a = test();
    ਲਿਖੋ("%d\n", a.b);
    ਵਾਪਸ 0;
}
