#ضمن <stdio.h>

تعريفنوع بنية {
    صحيح داده[4];
    مزدوج d1;
    مزدوج d2;
} گره_2;

تعريفنوع بنية {
    صحيح a, b, c;
} A;

گره_2 init(گره_2 self) {
    self.داده[0] = 0;
    self.داده[1] = 1;
    self.داده[2] = 2;
    self.داده[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    أرجع self;
}

فراغ dummy(گره_2 self) {
}

فراغ print_داده(گره_2 داده) {
    چاپ_کن ("%d %d %d %d %g %g\n",
            داده.داده[0], داده.داده[1], داده.داده[2], داده.داده[3],
            داده.d1, داده.d2);
}

A test(فراغ)
{
    صحيح i;
    A arr[30];

    لكل (i = 0; i < 30; i++)
        arr[i].b = i;
    أرجع arr[29];
}

صحيح اصلی(فراغ) {
    /* This code resulted in a bounds checking error */
    گره_2 داده;
    A a;
    dummy (داده);
    حرف val;
    داده = init (داده);
    print_داده(داده);
    a = test();
    چاپ_کن("%d\n", a.b);
    أرجع 0;
}
