#అన్తర్భావ <stdio.h>

రకనిర్వచనం నిర్మాణం {
    పూర్ణాంకం దత్తాంశం[4];
    ద్విగుణ d1;
    ద్విగుణ d2;
} కణుపు_2;

రకనిర్వచనం నిర్మాణం {
    పూర్ణాంకం a, b, c;
} A;

కణుపు_2 init(కణుపు_2 self) {
    self.దత్తాంశం[0] = 0;
    self.దత్తాంశం[1] = 1;
    self.దత్తాంశం[2] = 2;
    self.దత్తాంశం[3] = 3;
    self.d1 = 1234;
    self.d2 = 2345;
    తిరిగి self;
}

శూన్య dummy(కణుపు_2 self) {
}

శూన్య print_దత్తాంశం(కణుపు_2 దత్తాంశం) {
    రాయి ("%d %d %d %d %g %g\n",
            దత్తాంశం.దత్తాంశం[0], దత్తాంశం.దత్తాంశం[1], దత్తాంశం.దత్తాంశం[2], దత్తాంశం.దత్తాంశం[3],
            దత్తాంశం.d1, దత్తాంశం.d2);
}

A test(శూన్య)
{
    పూర్ణాంకం i;
    A arr[30];

    కొరకు (i = 0; i < 30; i++)
        arr[i].b = i;
    తిరిగి arr[29];
}

పూర్ణాంకం ప్రధాన(శూన్య) {
    /* This code resulted in a bounds checking error */
    కణుపు_2 దత్తాంశం;
    A a;
    dummy (దత్తాంశం);
    అక్షరం val;
    దత్తాంశం = init (దత్తాంశం);
    print_దత్తాంశం(దత్తాంశం);
    a = test();
    రాయి("%d\n", a.b);
    తిరిగి 0;
}
