#include <stdio.h>

පූර්ණ_සංඛ්‍යා
main (void)
{
    පූර්ණ_සංඛ්‍යා n = 0;
    පූර්ණ_සංඛ්‍යා  first=1;
    පූර්ණ_සංඛ්‍යා *p[101];
    නම් (0) {
        lab:;
    }
    පූර්ණ_සංඛ්‍යා x[n % 100 + 1];
    නම් (first == 0) {
        නම් (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ආපසු(1);
        }
    }
    නැතහොත් {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    නම් (n < 100000)
        goto lab;
    printf ("OK\n");
    ආපසු 0;
}

