#include <stdio.h>

ཧྲིལ
གཙོ (void)
{
    ཧྲིལ n = 0;
    ཧྲིལ  first=1;
    ཧྲིལ *p[101];
    གལ་ཏེ (0) {
        lab:;
    }
    ཧྲིལ x[n % 100 + 1];
    གལ་ཏེ (first == 0) {
        གལ་ཏེ (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ཕྱིར(1);
        }
    }
    དེ་མིན {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    གལ་ཏེ (n < 100000)
        goto lab;
    printf ("OK\n");
    ཕྱིར 0;
}

