#ಅನ್ತರ್ಭಾವ <stdio.h>

ಪೂರ್ಣಾಙ್ಕ
main (ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಙ್ಕ n = 0;
    ಪೂರ್ಣಾಙ್ಕ  first=1;
    ಪೂರ್ಣಾಙ್ಕ *p[101];
    ಯದಿ (0) {
        lab:;
    }
    ಪೂರ್ಣಾಙ್ಕ x[n % 100 + 1];
    ಯದಿ (first == 0) {
        ಯದಿ (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ಪ್ರತ್ಯಾಗಮ(1);
        }
    }
    ಅನ್ಯಥಾ {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    ಯದಿ (n < 100000)
        ಗಚ್ಛ lab;
    printf ("OK\n");
    ಪ್ರತ್ಯಾಗಮ 0;
}

