#include <stdio.h>

целое
основной (void)
{
    целое n = 0;
    целое  first=1;
    целое *p[101];
    если (0) {
        lab:;
    }
    целое x[n % 100 + 1];
    если (first == 0) {
        если (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            вернуть(1);
        }
    }
    иначе {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    если (n < 100000)
        goto lab;
    printf ("OK\n");
    вернуть 0;
}

