#अन्तर्भाव <stdio.h>

पूर्णांक
main (शून्य)
{
    पूर्णांक n = 0;
    पूर्णांक  first=1;
    पूर्णांक *p[101];
    जर (0) {
        lab:;
    }
    पूर्णांक x[n % 100 + 1];
    जर (first == 0) {
        जर (&x[0] != p[n % 100 + 1]) {
            म_लिखो ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            परत(1);
        }
    }
    अन्यथा {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    जर (n < 100000)
        जा lab;
    म_लिखो ("OK\n");
    परत 0;
}

