#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

ਪੂਰਨ
ਮੁੱਖ (ਖਾਲੀ)
{
    ਪੂਰਨ n = 0;
    ਪੂਰਨ  ਪਹਿਲਾ=1;
    ਪੂਰਨ *p[101];
    ਜੇ (0) {
        lab:;
    }
    ਪੂਰਨ x[n % 100 + 1];
    ਜੇ (ਪਹਿਲਾ == 0) {
        ਜੇ (&x[0] != p[n % 100 + 1]) {
            ਲਿਖੋ ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ਵਾਪਸ(1);
        }
    }
    ਨਹੀਂਤਾਂ {
        p[n % 100 + 1] = &x[0];
        ਪਹਿਲਾ = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    ਜੇ (n < 100000)
        ਜਾਓ lab;
    ਲਿਖੋ ("OK\n");
    ਵਾਪਸ 0;
}

