#شامل <stdio.h>

صحیح
اصلی (تهی)
{
    صحیح n = 0;
    صحیح  first=1;
    صحیح *p[101];
    اگر (0) {
        lab:;
    }
    صحیح x[n % 100 + 1];
    اگر (first == 0) {
        اگر (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            بازگشت(1);
        }
    }
    وگرنه {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    اگر (n < 100000)
        برو lab;
    printf ("OK\n");
    بازگشت 0;
}

