#include <stdio.h>

ကိန်းပြည့်
main (void)
{
    ကိန်းပြည့် n = 0;
    ကိန်းပြည့်  first=1;
    ကိန်းပြည့် *p[101];
    အကယ်၍ (0) {
        lab:;
    }
    ကိန်းပြည့် x[n % 100 + 1];
    အကယ်၍ (first == 0) {
        အကယ်၍ (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ပြန်ပေး(1);
        }
    }
    မဟုတ်ပါက {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    အကယ်၍ (n < 100000)
        goto lab;
    printf ("OK\n");
    ပြန်ပေး 0;
}

