#অন্তর্ভাব <stdio.h>

পূর্ণাঙ্ক
main (শূন্য)
{
    পূর্ণাঙ্ক n = 0;
    পূর্ণাঙ্ক  first=1;
    পূর্ণাঙ্ক *p[101];
    যদি (0) {
        lab:;
    }
    পূর্ণাঙ্ক x[n % 100 + 1];
    যদি (first == 0) {
        যদি (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            প্রত্যাগম(1);
        }
    }
    অন্যথা {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    যদি (n < 100000)
        গচ্ছ lab;
    printf ("OK\n");
    প্রত্যাগম 0;
}

