#include <stdio.h>

ចំនួនគត់
main (void)
{
    ចំនួនគត់ n = 0;
    ចំនួនគត់  first=1;
    ចំនួនគត់ *p[101];
    ប្រសិនបើ (0) {
        lab:;
    }
    ចំនួនគត់ x[n % 100 + 1];
    ប្រសិនបើ (first == 0) {
        ប្រសិនបើ (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ត្រឡប់(1);
        }
    }
    បើមិនដូច្នេះ {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    ប្រសិនបើ (n < 100000)
        goto lab;
    printf ("OK\n");
    ត្រឡប់ 0;
}

