#include <stdio.h>

ціле
main (void)
{
    ціле n = 0;
    ціле  first=1;
    ціле *p[101];
    якщо (0) {
        lab:;
    }
    ціле x[n % 100 + 1];
    якщо (first == 0) {
        якщо (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            повернути(1);
        }
    }
    інакше {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    якщо (n < 100000)
        goto lab;
    printf ("OK\n");
    повернути 0;
}

