#અન્તર્ભાવ <stdio.h>

પૂર્ણાંક
મુખ્ય (શૂન્ય)
{
    પૂર્ણાંક n = 0;
    પૂર્ણાંક  first=1;
    પૂર્ણાંક *p[101];
    જો (0) {
        lab:;
    }
    પૂર્ણાંક x[n % 100 + 1];
    જો (first == 0) {
        જો (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            પાછા(1);
        }
    }
    નહીંતર {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    જો (n < 100000)
        જાઓ lab;
    printf ("OK\n");
    પાછા 0;
}

