#include <stdio.h>

จำนวนเต็ม
หลัก (void)
{
    จำนวนเต็ม n = 0;
    จำนวนเต็ม  first=1;
    จำนวนเต็ม *p[101];
    ถ้า (0) {
        lab:;
    }
    จำนวนเต็ม x[n % 100 + 1];
    ถ้า (first == 0) {
        ถ้า (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            คืน(1);
        }
    }
    มิฉะนั้น {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    ถ้า (n < 100000)
        goto lab;
    printf ("OK\n");
    คืน 0;
}

