#অন্তর্ভাব <stdio.h>

পূর্ণসংখ্যা
প্রধান (শূন্য)
{
    পূর্ণসংখ্যা n = 0;
    পূর্ণসংখ্যা  first=1;
    পূর্ণসংখ্যা *p[101];
    যদি (0) {
        lab:;
    }
    পূর্ণসংখ্যা x[n % 100 + 1];
    যদি (first == 0) {
        যদি (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ফেরত(1);
        }
    }
    অন্যথা {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    যদি (n < 100000)
        যাও lab;
    printf ("OK\n");
    ফেরত 0;
}

