#समावेश <stdio.h>

पूर्णांक
मुख्य (व्योम)
{
    पूर्णांक n = 0;
    पूर्णांक  first=1;
    पूर्णांक *p[101];
    अगर (0) {
        lab:;
    }
    पूर्णांक x[n % 100 + 1];
    अगर (first == 0) {
        अगर (&x[0] != p[n % 100 + 1]) {
            म_लिखो ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            वापस(1);
        }
    }
    अन्यथा {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    अगर (n < 100000)
        जाओ lab;
    म_लिखो ("OK\n");
    वापस 0;
}

