#include <stdio.h>

ຈຳນວນເຕັມ
main (void)
{
    ຈຳນວນເຕັມ n = 0;
    ຈຳນວນເຕັມ  first=1;
    ຈຳນວນເຕັມ *p[101];
    ຖ້າ (0) {
        lab:;
    }
    ຈຳນວນເຕັມ x[n % 100 + 1];
    ຖ້າ (first == 0) {
        ຖ້າ (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ສົ່ງຄືນ(1);
        }
    }
    ບໍ່ດັ່ງນັ້ນ {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    ຖ້າ (n < 100000)
        goto lab;
    printf ("OK\n");
    ສົ່ງຄືນ 0;
}

