#ଅନ୍ତର୍ଭାଵ <stdio.h>

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
ମୁଖ୍ୟ (ଶୂନ୍ୟ)
{
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା n = 0;
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା  first=1;
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା *p[101];
    ଯଦି (0) {
        lab:;
    }
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା x[n % 100 + 1];
    ଯଦି (first == 0) {
        ଯଦି (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ଫେରନ୍ତୁ(1);
        }
    }
    ଅନ୍ୟଥା {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    ଯଦି (n < 100000)
        ଯାଅ lab;
    printf ("OK\n");
    ଫେରନ୍ତୁ 0;
}

