#अन्तर्भाव <stdio.h>

पूर्णाङ्क
main (शून्य)
{
    पूर्णाङ्क n = 0;
    पूर्णाङ्क  first=1;
    पूर्णाङ्क *p[101];
    सचे (0) {
        lab:;
    }
    पूर्णाङ्क x[n % 100 + 1];
    सचे (first == 0) {
        सचे (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            पटिनिवत्त(1);
        }
    }
    अञ्ञथा {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    सचे (n < 100000)
        गच्छ lab;
    printf ("OK\n");
    पटिनिवत्त 0;
}

