#ಅನ್ತರ್ಭಾವ <stdio.h>

ಪೂರ್ಣಾಂಕ
ಮುಖ್ಯ (ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ n = 0;
    ಪೂರ್ಣಾಂಕ  ಮೊದಲ=1;
    ಪೂರ್ಣಾಂಕ *p[101];
    ಆದರೆ (0) {
        lab:;
    }
    ಪೂರ್ಣಾಂಕ x[n % 100 + 1];
    ಆದರೆ (ಮೊದಲ == 0) {
        ಆದರೆ (&x[0] != p[n % 100 + 1]) {
            ಬರೆ ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            ಹಿಂತಿರುಗಿ(1);
        }
    }
    ಇಲ್ಲದಿದ್ದರೆ {
        p[n % 100 + 1] = &x[0];
        ಮೊದಲ = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    ಆದರೆ (n < 100000)
        ಹೋಗು lab;
    ಬರೆ ("OK\n");
    ಹಿಂತಿರುಗಿ 0;
}

