#ضمن <stdio.h>

صحيح
main (فراغ)
{
    صحيح n = 0;
    صحيح  first=1;
    صحيح *p[101];
    إذا (0) {
        lab:;
    }
    صحيح x[n % 100 + 1];
    إذا (first == 0) {
        إذا (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            أرجع(1);
        }
    }
    وإلا {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    إذا (n < 100000)
        اذهب lab;
    printf ("OK\n");
    أرجع 0;
}

