#అన్తర్భావ <stdio.h>

పూర్ణాంకం
ప్రధాన (శూన్య)
{
    పూర్ణాంకం n = 0;
    పూర్ణాంకం  మొదటి=1;
    పూర్ణాంకం *p[101];
    ఒకవేళ (0) {
        lab:;
    }
    పూర్ణాంకం x[n % 100 + 1];
    ఒకవేళ (మొదటి == 0) {
        ఒకవేళ (&x[0] != p[n % 100 + 1]) {
            రాయి ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            తిరిగి(1);
        }
    }
    లేకపోతే {
        p[n % 100 + 1] = &x[0];
        మొదటి = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    ఒకవేళ (n < 100000)
        వెళ్ళు lab;
    రాయి ("OK\n");
    తిరిగి 0;
}

