#அந்தர்பாவ <stdio.h>

முழு
முதன்மை (வெறுமை)
{
    முழு n = 0;
    முழு  first=1;
    முழு *p[101];
    எனில் (0) {
        lab:;
    }
    முழு x[n % 100 + 1];
    எனில் (first == 0) {
        எனில் (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            திரும்பு(1);
        }
    }
    இல்லையெனில் {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    எனில் (n < 100000)
        செல் lab;
    printf ("OK\n");
    திரும்பு 0;
}

