#അന്തര്ഭാവ <stdio.h>

പൂർണ്ണസംഖ്യ
പ്രധാന (ശൂന്യം)
{
    പൂർണ്ണസംഖ്യ n = 0;
    പൂർണ്ണസംഖ്യ  first=1;
    പൂർണ്ണസംഖ്യ *p[101];
    എങ്കിൽ (0) {
        lab:;
    }
    പൂർണ്ണസംഖ്യ x[n % 100 + 1];
    എങ്കിൽ (first == 0) {
        എങ്കിൽ (&x[0] != p[n % 100 + 1]) {
            printf ("ERROR: %p %p\n", &x[0], p[n % 100 + 1]);
            തിരികെ(1);
        }
    }
    അല്ലെങ്കിൽ {
        p[n % 100 + 1] = &x[0];
        first = n < 100;
    }
    x[0] = 1;
    x[n % 100] = 2;
    n++;
    എങ്കിൽ (n < 100000)
        പോകുക lab;
    printf ("OK\n");
    തിരികെ 0;
}

