రకనిర్వచనం __SIZE_TYPE__ కొలత_t;
బాహ్య పూర్ణాంకం రాయి(స్థిరరాశి అక్షరం*, ...);
బాహ్య కొలత_t అక్షరశ్రేణి_పొడవు(స్థిరరాశి అక్షరం*);
అక్షరం str[] = "blabla";
పూర్ణాంకం g;
పూర్ణాంకం ప్రధాన()
{
  //char helpme[strlen(str) + 1];
  పూర్ణాంకం i = 0;
#ఒకవేళ 0
  ఒకవేళ (g) {
      అక్షరం buf[అక్షరశ్రేణి_పొడవు(str) + 10];
      buf[0] = 0;
  }
alabel:
  రాయి("default: i = %d\n", i);
#లేకపోతే
  కొరకు (i = 0; i < 5; i++) {
      ఎంపిక (i) {
      స్థితి 10:
          ఒకవేళ (g) {
              అక్షరం buf[అక్షరశ్రేణి_పొడవు(str) + 10];
              buf[0] = 0;
              వెళ్ళు do_cmd;
          }
          ఆపు;
      స్థితి 1:
          రాయి("reached 3\n");
    do_cmd:
          రాయి("after do_cmd");
          ఆపు;
      అప్రమేయ:
          g++;
          రాయి("default: i = %d\n", i);
          ఆపు;
      }
  }
#అయితే_ముగింపు
  తిరిగి 0;
}
