प्रकारनिर्देश __SIZE_TYPE__ माप_प्रकार;
बाह्य पूर्णाङ्क म_लिखो(अचर वर्ण*, ...);
बाह्य माप_प्रकार म_माप(अचर वर्ण*);
वर्ण str[] = "blabla";
पूर्णाङ्क g;
पूर्णाङ्क main()
{
  //char helpme[strlen(str) + 1];
  पूर्णाङ्क i = 0;
#यदि 0
  यदि (g) {
      वर्ण buf[म_माप(str) + 10];
      buf[0] = 0;
  }
alabel:
  म_लिखो("default: i = %d\n", i);
#अन्यथा
  लागि (i = 0; i < 5; i++) {
      विकल्प (i) {
      पक्ष 10:
          यदि (g) {
              वर्ण buf[म_माप(str) + 10];
              buf[0] = 0;
              गच्छ do_cmd;
          }
          रोक;
      पक्ष 1:
          म_लिखो("reached 3\n");
    do_cmd:
          म_लिखो("after do_cmd");
          रोक;
      स्वभाव:
          g++;
          म_लिखो("default: i = %d\n", i);
          रोक;
      }
  }
#endif
  फर्काऊ 0;
}
