تعريفنوع __SIZE_TYPE__ ناپ_t;
خارجي صحيح لکھو(ثابت حرف*, ...);
خارجي ناپ_t لڑی_لمبائی(ثابت حرف*);
حرف str[] = "blabla";
صحيح g;
صحيح مکھ()
{
  //char helpme[strlen(str) + 1];
  صحيح i = 0;
#إذا 0
  إذا (g) {
      حرف buf[لڑی_لمبائی(str) + 10];
      buf[0] = 0;
  }
alabel:
  لکھو("default: i = %d\n", i);
#وإلا
  لكل (i = 0; i < 5; i++) {
      بدل (i) {
      حالة 10:
          إذا (g) {
              حرف buf[لڑی_لمبائی(str) + 10];
              buf[0] = 0;
              اذهب do_cmd;
          }
          اكسر;
      حالة 1:
          لکھو("reached 3\n");
    do_cmd:
          لکھو("after do_cmd");
          اكسر;
      افتراضي:
          g++;
          لکھو("default: i = %d\n", i);
          اكسر;
      }
  }
#جے_انت
  أرجع 0;
}
