ਕਿਸਮਪਰਿਭਾਸ਼ਾ __SIZE_TYPE__ ਮਾਪ_t;
ਬਾਹਰੀ ਪੂਰਨ ਲਿਖੋ(ਅਚਲ ਅੱਖਰ*, ...);
ਬਾਹਰੀ ਮਾਪ_t ਲੜੀ_ਲੰਬਾਈ(ਅਚਲ ਅੱਖਰ*);
ਅੱਖਰ str[] = "blabla";
ਪੂਰਨ g;
ਪੂਰਨ ਮੁੱਖ()
{
  //char helpme[strlen(str) + 1];
  ਪੂਰਨ i = 0;
#ਜੇ 0
  ਜੇ (g) {
      ਅੱਖਰ buf[ਲੜੀ_ਲੰਬਾਈ(str) + 10];
      buf[0] = 0;
  }
alabel:
  ਲਿਖੋ("default: i = %d\n", i);
#ਨਹੀਂਤਾਂ
  ਲਈ (i = 0; i < 5; i++) {
      ਚੋਣ (i) {
      ਹਾਲਤ 10:
          ਜੇ (g) {
              ਅੱਖਰ buf[ਲੜੀ_ਲੰਬਾਈ(str) + 10];
              buf[0] = 0;
              ਜਾਓ do_cmd;
          }
          ਰੋਕੋ;
      ਹਾਲਤ 1:
          ਲਿਖੋ("reached 3\n");
    do_cmd:
          ਲਿਖੋ("after do_cmd");
          ਰੋਕੋ;
      ਮੂਲ:
          g++;
          ਲਿਖੋ("default: i = %d\n", i);
          ਰੋਕੋ;
      }
  }
#ਜੇ_ਅੰਤ
  ਵਾਪਸ 0;
}
