تعريفنوع __SIZE_TYPE__ اندازه_t;
خارجي صحيح چاپ_کړه(ثابت حرف*, ...);
خارجي اندازه_t مزي_اوږدوالی(ثابت حرف*);
حرف str[] = "blabla";
صحيح g;
صحيح اصلي()
{
  //char helpme[strlen(str) + 1];
  صحيح i = 0;
#إذا 0
  إذا (g) {
      حرف buf[مزي_اوږدوالی(str) + 10];
      buf[0] = 0;
  }
alabel:
  چاپ_کړه("default: i = %d\n", i);
#وإلا
  لكل (i = 0; i < 5; i++) {
      بدل (i) {
      حالة 10:
          إذا (g) {
              حرف buf[مزي_اوږدوالی(str) + 10];
              buf[0] = 0;
              اذهب do_cmd;
          }
          اكسر;
      حالة 1:
          چاپ_کړه("reached 3\n");
    do_cmd:
          چاپ_کړه("after do_cmd");
          اكسر;
      افتراضي:
          g++;
          چاپ_کړه("default: i = %d\n", i);
          اكسر;
      }
  }
#د_که_پای
  أرجع 0;
}
