ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ __SIZE_TYPE__ ಗಾತ್ರ_t;
ಬಾಹ್ಯ ಪೂರ್ಣಾಂಕ ಬರೆ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ*, ...);
ಬಾಹ್ಯ ಗಾತ್ರ_t ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ*);
ಅಕ್ಷರ str[] = "blabla";
ಪೂರ್ಣಾಂಕ g;
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
  //char helpme[strlen(str) + 1];
  ಪೂರ್ಣಾಂಕ i = 0;
#ಆದರೆ 0
  ಆದರೆ (g) {
      ಅಕ್ಷರ buf[ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(str) + 10];
      buf[0] = 0;
  }
alabel:
  ಬರೆ("default: i = %d\n", i);
#ಇಲ್ಲದಿದ್ದರೆ
  ಗಾಗಿ (i = 0; i < 5; i++) {
      ಆಯ್ಕೆ (i) {
      ಸ್ಥಿತಿ 10:
          ಆದರೆ (g) {
              ಅಕ್ಷರ buf[ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(str) + 10];
              buf[0] = 0;
              ಹೋಗು do_cmd;
          }
          ನಿಲ್ಲಿಸು;
      ಸ್ಥಿತಿ 1:
          ಬರೆ("reached 3\n");
    do_cmd:
          ಬರೆ("after do_cmd");
          ನಿಲ್ಲಿಸು;
      ಪೂರ್ವನಿಯೋಜಿತ:
          g++;
          ಬರೆ("default: i = %d\n", i);
          ನಿಲ್ಲಿಸು;
      }
  }
#ಆದರೆ_ಅಂತ್ಯ
  ಹಿಂತಿರುಗಿ 0;
}
