प्रकारव्याख्या __SIZE_TYPE__ माप_प्रकार;
बाह्य पूर्णांक म_लिखो(स्थिरांक अक्षर*, ...);
बाह्य माप_प्रकार म_माप(स्थिरांक अक्षर*);
अक्षर str[] = "blabla";
पूर्णांक g;
पूर्णांक main()
{
  //char helpme[strlen(str) + 1];
  पूर्णांक i = 0;
#जर 0
  जर (g) {
      अक्षर buf[म_माप(str) + 10];
      buf[0] = 0;
  }
alabel:
  म_लिखो("default: i = %d\n", i);
#अन्यथा
  साठी (i = 0; i < 5; i++) {
      निवड (i) {
      स्थिती 10:
          जर (g) {
              अक्षर buf[म_माप(str) + 10];
              buf[0] = 0;
              जा do_cmd;
          }
          थांबा;
      स्थिती 1:
          म_लिखो("reached 3\n");
    do_cmd:
          म_लिखो("after do_cmd");
          थांबा;
      पूर्वनिर्धारित:
          g++;
          म_लिखो("default: i = %d\n", i);
          थांबा;
      }
  }
#endif
  परत 0;
}
