تعريفنوع __SIZE_TYPE__ سائيز_t;
خارجي صحيح لکو(ثابت حرف*, ...);
خارجي سائيز_t لڙي_ڊيگهه(ثابت حرف*);
حرف str[] = "blabla";
صحيح g;
صحيح مکيه()
{
  //char helpme[strlen(str) + 1];
  صحيح i = 0;
#إذا 0
  إذا (g) {
      حرف buf[لڙي_ڊيگهه(str) + 10];
      buf[0] = 0;
  }
alabel:
  لکو("default: i = %d\n", i);
#وإلا
  لكل (i = 0; i < 5; i++) {
      بدل (i) {
      حالة 10:
          إذا (g) {
              حرف buf[لڙي_ڊيگهه(str) + 10];
              buf[0] = 0;
              اذهب do_cmd;
          }
          اكسر;
      حالة 1:
          لکو("reached 3\n");
    do_cmd:
          لکو("after do_cmd");
          اكسر;
      افتراضي:
          g++;
          لکو("default: i = %d\n", i);
          اكسر;
      }
  }
#جيڪڏهن_پورو
  أرجع 0;
}
