تعريفنوع __SIZE_TYPE__ اندازه_t;
خارجي صحيح چاپ_کن(ثابت حرف*, ...);
خارجي اندازه_t طول_رشته(ثابت حرف*);
حرف str[] = "blabla";
صحيح g;
صحيح اصلی()
{
  //char helpme[strlen(str) + 1];
  صحيح i = 0;
#إذا 0
  إذا (g) {
      حرف buf[طول_رشته(str) + 10];
      buf[0] = 0;
  }
alabel:
  چاپ_کن("default: i = %d\n", i);
#وإلا
  لكل (i = 0; i < 5; i++) {
      بدل (i) {
      حالة 10:
          إذا (g) {
              حرف buf[طول_رشته(str) + 10];
              buf[0] = 0;
              اذهب do_cmd;
          }
          اكسر;
      حالة 1:
          چاپ_کن("reached 3\n");
    do_cmd:
          چاپ_کن("after do_cmd");
          اكسر;
      افتراضي:
          g++;
          چاپ_کن("default: i = %d\n", i);
          اكسر;
      }
  }
#پایان_اگر
  أرجع 0;
}
