प्रकारनिर्देश __SIZE_TYPE__ आकार_t;
बाह्य पूर्णाङ्क प्रारूप_लिख(ध्रुव वर्ण*, ...);
बाह्य आकार_t वाक्यदैर्घ्यम्(ध्रुव वर्ण*);
वर्ण str[] = "blabla";
पूर्णाङ्क g;
पूर्णाङ्क मुख्यम्()
{
  //char helpme[strlen(str) + 1];
  पूर्णाङ्क i = 0;
#यदि 0
  यदि (g) {
      वर्ण buf[वाक्यदैर्घ्यम्(str) + 10];
      buf[0] = 0;
  }
alabel:
  प्रारूप_लिख("default: i = %d\n", i);
#अन्यथा
  प्रति (i = 0; i < 5; i++) {
      विकल्प (i) {
      पक्ष 10:
          यदि (g) {
              वर्ण buf[वाक्यदैर्घ्यम्(str) + 10];
              buf[0] = 0;
              गच्छ do_cmd;
          }
          भङ्ग;
      पक्ष 1:
          प्रारूप_लिख("reached 3\n");
    do_cmd:
          प्रारूप_लिख("after do_cmd");
          भङ्ग;
      स्वभाव:
          g++;
          प्रारूप_लिख("default: i = %d\n", i);
          भङ्ग;
      }
  }
#यदि_अन्तः
  प्रत्यागम 0;
}
