قسمتعریف __SIZE_TYPE__ سائز_t;
خارجی صحیح لکھو(ثابت حرف*, ...);
خارجی سائز_t لڑی_لمبائی(ثابت حرف*);
حرف str[] = "blabla";
صحیح g;
صحیح مین()
{
  //char helpme[strlen(str) + 1];
  صحیح i = 0;
#اگر 0
  اگر (g) {
      حرف buf[لڑی_لمبائی(str) + 10];
      buf[0] = 0;
  }
alabel:
  لکھو("default: i = %d\n", i);
#ورنہ
  برائے (i = 0; i < 5; i++) {
      انتخاب (i) {
      حالت 10:
          اگر (g) {
              حرف buf[لڑی_لمبائی(str) + 10];
              buf[0] = 0;
              جاؤ do_cmd;
          }
          توڑو;
      حالت 1:
          لکھو("reached 3\n");
    do_cmd:
          لکھو("after do_cmd");
          توڑو;
      طےشدہ:
          g++;
          لکھو("default: i = %d\n", i);
          توڑو;
      }
  }
#اگر_ختم
  واپس 0;
}
