प्रकार __SIZE_TYPE__ माप_प्रकार;
बाह्य पूर्णांक म_लिखो(स्थिर अक्षर*, ...);
बाह्य माप_प्रकार म_माप(स्थिर अक्षर*);
अक्षर str[] = "blabla";
पूर्णांक g;
पूर्णांक मुख्य()
{
  //char helpme[strlen(str) + 1];
  पूर्णांक i = 0;
#अगर 0
  अगर (g) {
      अक्षर buf[म_माप(str) + 10];
      buf[0] = 0;
  }
alabel:
  म_लिखो("default: i = %d\n", i);
#अन्यथा
  क्रम (i = 0; i < 5; i++) {
      चयन (i) {
      हाल 10:
          अगर (g) {
              अक्षर buf[म_माप(str) + 10];
              buf[0] = 0;
              जाओ do_cmd;
          }
          अवरोध;
      हाल 1:
          म_लिखो("reached 3\n");
    do_cmd:
          म_लिखो("after do_cmd");
          अवरोध;
      शेष:
          g++;
          म_लिखो("default: i = %d\n", i);
          अवरोध;
      }
  }
#पूर्ण_अगर
  वापस 0;
}
