ਪੂਰਨ ਲਿਖੋ(ਅਚਲ ਅੱਖਰ*, ...);

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ myassert(x) \
    ਲਿਖੋ("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

ਗਿਣਤੀ{ ਵਿੱਚ = 0};

ਪੂਰਨ main_1(){
    {
        myassert(!ਵਿੱਚ);
        ਜੇ(ਆਕਾਰ(ਗਿਣਤੀ{ਵਿੱਚ=1})) myassert(ਵਿੱਚ);
        myassert(!ਵਿੱਚ); //OOPS
    }
    {
        myassert(!ਵਿੱਚ);
        ਚੋਣ(ਆਕਾਰ(ਗਿਣਤੀ{ਵਿੱਚ=1})) { ਮੂਲ: myassert(ਵਿੱਚ); }
        myassert(!ਵਿੱਚ); //OOPS
    }
    {
        myassert(!ਵਿੱਚ);
        ਜਦੋਂ(ਆਕਾਰ(ਗਿਣਤੀ{ਵਿੱਚ=1})) { myassert(ਵਿੱਚ); ਰੋਕੋ; }
        myassert(!ਵਿੱਚ); //OOPS
    }
    {
        myassert(!ਵਿੱਚ);
        ਕਰੋ{ myassert(!ਵਿੱਚ);}ਜਦੋਂ(0*ਆਕਾਰ(ਗਿਣਤੀ{ਵਿੱਚ=1}));
        myassert(!ਵਿੱਚ); //OOPS
    }

    {
        myassert(!ਵਿੱਚ);
        ਲਈ(ਆਕਾਰ(ਗਿਣਤੀ{ਵਿੱਚ=1});;){ myassert(ਵਿੱਚ); ਰੋਕੋ; }
        myassert(!ਵਿੱਚ); //OK
    }
    {
        myassert(!ਵਿੱਚ);
        ਲਈ(;;ਆਕਾਰ(ਗਿਣਤੀ{ਵਿੱਚ=1})){ myassert(ਵਿੱਚ); ਰੋਕੋ; }
        myassert(!ਵਿੱਚ); //OK
    }
    {
        myassert(!ਵਿੱਚ);
        ਲਈ(;ਆਕਾਰ(ਗਿਣਤੀ{ਵਿੱਚ=1});){ myassert(ਵਿੱਚ); ਰੋਕੋ; }
        myassert(!ਵਿੱਚ); //OK
    }
    ਵਾਪਸ 0;
}

/* --------------------------------------------- */
ਪੂਰਨ main_2()
{
  ਅੱਖਰ c = 'a';
  ਖਾਲੀ func1(ਅੱਖਰ c); /* param 'c' must not shadow local 'c' */
  func1(c);
  ਵਾਪਸ 0;
}

ਖਾਲੀ func1(ਅੱਖਰ c)
{
    myassert(c == 'a');
}

ਬਣਤਰ st { ਪੂਰਨ a; };

/* --------------------------------------------- */
ਪੂਰਨ main_3()
{
  ਬਣਤਰ st func(ਖਾਲੀ);
  ਬਣਤਰ st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  ਵਾਪਸ 0;
}

ਬਣਤਰ st func(ਖਾਲੀ)
{
  ਬਣਤਰ st st = { 10 };
  ਵਾਪਸ st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
ਸਥਿਰ ਖਾਲੀ f4(ਅੱਖਰ *(*md)(ਅੱਖਰ *md))
{
   (*md)("test");
}
ਸਥਿਰ ਅੱਖਰ *a4(ਅੱਖਰ *a)
{
    ਪੂਰਨ strcmp();
    myassert(!strcmp(a, "test"));
    ਵਾਪਸ a;
}

ਪੂਰਨ main_4()
{
    f4(a4);
    ਵਾਪਸ 0;
}

/* --------------------------------------------- */
ਪੂਰਨ a5[3], b5[];
ਪੂਰਨ f5(ਖਾਲੀ);
ਪੂਰਨ main_5()
{
    ਬਾਹਰੀ ਪੂਰਨ a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    ਵਾਪਸ 0;
}
ਪੂਰਨ f5(ਖਾਲੀ)
{
    ਵਾਪਸ a5[2]+b5[2];
}
ਪੂਰਨ b5[3];

/* --------------------------------------------- */
ਸਥਿਰ ਪੂਰਨ f6(ਪੂਰਨ);
ਪੂਰਨ i6 = 11;

ਪੂਰਨ main_6()
{
    {
        ਪੂਰਨ i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            ਪੂਰਨ f6(ਪੂਰਨ);
            ਬਾਹਰੀ ਪੂਰਨ i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    ਵਾਪਸ 0;
}

ਪੂਰਨ f6(ਪੂਰਨ x)
{
    ਵਾਪਸ x;
}

/* --------------------------------------------- */

#ਜੇ defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#ਨਹੀਂਤਾਂ
# define _ "_"
#ਜੇ_ਅੰਤ

ਬਣਤਰ xx7 { ਪੂਰਨ a, b; };

ਖਾਲੀ f7()
{
    ਬਣਤਰ xx7 { ਪੂਰਨ c; } x;
    {
        ਬਾਹਰੀ ਬਣਤਰ xx7 { ਪੂਰਨ a, b; } x __asm__(_"z7");
        x.a = 12;
        ਬਣਤਰ xx7 y = { 0,0 };
    }
    ਬਣਤਰ xx7 y = { 90 };
    x.c = 78;
    ਲਿਖੋ("xx7 (1) : %d %d\n", x.c, y.c);
}

ਪੂਰਨ main_7()
{
    f7();
    ਬਾਹਰੀ ਬਣਤਰ xx7 y __asm__(_"z7");
    ਲਿਖੋ("xx7 (2) : %d %d\n", y.a, y.b);
    ਵਾਪਸ 0;
}


ਬਣਤਰ xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
ਪੂਰਨ ਮੁੱਖ()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    ਵਾਪਸ 0;
}
