ಪೂರ್ಣಾಙ್ಕ printf(ಧ್ರುವ ವರ್ಣ*, ...);

#define myassert(x) \
    printf("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

ಗಣನಾ{ in = 0};

ಪೂರ್ಣಾಙ್ಕ main_1(){
    {
        myassert(!in);
        ಯದಿ(ಪರಿಮಾಣ(ಗಣನಾ{in=1})) myassert(in);
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        ವಿಕಲ್ಪ(ಪರಿಮಾಣ(ಗಣನಾ{in=1})) { ಸ್ವಭಾವ: myassert(in); }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        ಯಾವತ್(ಪರಿಮಾಣ(ಗಣನಾ{in=1})) { myassert(in); ಭಙ್ಗ; }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        ಕುರು{ myassert(!in);}ಯಾವತ್(0*ಪರಿಮಾಣ(ಗಣನಾ{in=1}));
        myassert(!in); //OOPS
    }

    {
        myassert(!in);
        ಪ್ರತಿ(ಪರಿಮಾಣ(ಗಣನಾ{in=1});;){ myassert(in); ಭಙ್ಗ; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        ಪ್ರತಿ(;;ಪರಿಮಾಣ(ಗಣನಾ{in=1})){ myassert(in); ಭಙ್ಗ; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        ಪ್ರತಿ(;ಪರಿಮಾಣ(ಗಣನಾ{in=1});){ myassert(in); ಭಙ್ಗ; }
        myassert(!in); //OK
    }
    ಪ್ರತ್ಯಾಗಮ 0;
}

/* --------------------------------------------- */
ಪೂರ್ಣಾಙ್ಕ main_2()
{
  ವರ್ಣ c = 'a';
  ಶೂನ್ಯ func1(ವರ್ಣ c); /* param 'c' must not shadow local 'c' */
  func1(c);
  ಪ್ರತ್ಯಾಗಮ 0;
}

ಶೂನ್ಯ func1(ವರ್ಣ c)
{
    myassert(c == 'a');
}

ಸಂರಚನಾ st { ಪೂರ್ಣಾಙ್ಕ a; };

/* --------------------------------------------- */
ಪೂರ್ಣಾಙ್ಕ main_3()
{
  ಸಂರಚನಾ st func(ಶೂನ್ಯ);
  ಸಂರಚನಾ st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  ಪ್ರತ್ಯಾಗಮ 0;
}

ಸಂರಚನಾ st func(ಶೂನ್ಯ)
{
  ಸಂರಚನಾ st st = { 10 };
  ಪ್ರತ್ಯಾಗಮ st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
ಸ್ಥಿರ ಶೂನ್ಯ f4(ವರ್ಣ *(*md)(ವರ್ಣ *md))
{
   (*md)("test");
}
ಸ್ಥಿರ ವರ್ಣ *a4(ವರ್ಣ *a)
{
    ಪೂರ್ಣಾಙ್ಕ strcmp();
    myassert(!strcmp(a, "test"));
    ಪ್ರತ್ಯಾಗಮ a;
}

ಪೂರ್ಣಾಙ್ಕ main_4()
{
    f4(a4);
    ಪ್ರತ್ಯಾಗಮ 0;
}

/* --------------------------------------------- */
ಪೂರ್ಣಾಙ್ಕ a5[3], b5[];
ಪೂರ್ಣಾಙ್ಕ f5(ಶೂನ್ಯ);
ಪೂರ್ಣಾಙ್ಕ main_5()
{
    ಬಾಹ್ಯ ಪೂರ್ಣಾಙ್ಕ a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    ಪ್ರತ್ಯಾಗಮ 0;
}
ಪೂರ್ಣಾಙ್ಕ f5(ಶೂನ್ಯ)
{
    ಪ್ರತ್ಯಾಗಮ a5[2]+b5[2];
}
ಪೂರ್ಣಾಙ್ಕ b5[3];

/* --------------------------------------------- */
ಸ್ಥಿರ ಪೂರ್ಣಾಙ್ಕ f6(ಪೂರ್ಣಾಙ್ಕ);
ಪೂರ್ಣಾಙ್ಕ i6 = 11;

ಪೂರ್ಣಾಙ್ಕ main_6()
{
    {
        ಪೂರ್ಣಾಙ್ಕ i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            ಪೂರ್ಣಾಙ್ಕ f6(ಪೂರ್ಣಾಙ್ಕ);
            ಬಾಹ್ಯ ಪೂರ್ಣಾಙ್ಕ i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    ಪ್ರತ್ಯಾಗಮ 0;
}

ಪೂರ್ಣಾಙ್ಕ f6(ಪೂರ್ಣಾಙ್ಕ x)
{
    ಪ್ರತ್ಯಾಗಮ x;
}

/* --------------------------------------------- */

#ಯದಿ defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#ಅನ್ಯಥಾ
# define _ "_"
#endif

ಸಂರಚನಾ xx7 { ಪೂರ್ಣಾಙ್ಕ a, b; };

ಶೂನ್ಯ f7()
{
    ಸಂರಚನಾ xx7 { ಪೂರ್ಣಾಙ್ಕ c; } x;
    {
        ಬಾಹ್ಯ ಸಂರಚನಾ xx7 { ಪೂರ್ಣಾಙ್ಕ a, b; } x __asm__(_"z7");
        x.a = 12;
        ಸಂರಚನಾ xx7 y = { 0,0 };
    }
    ಸಂರಚನಾ xx7 y = { 90 };
    x.c = 78;
    printf("xx7 (1) : %d %d\n", x.c, y.c);
}

ಪೂರ್ಣಾಙ್ಕ main_7()
{
    f7();
    ಬಾಹ್ಯ ಸಂರಚನಾ xx7 y __asm__(_"z7");
    printf("xx7 (2) : %d %d\n", y.a, y.b);
    ಪ್ರತ್ಯಾಗಮ 0;
}


ಸಂರಚನಾ xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
ಪೂರ್ಣಾಙ್ಕ main()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    ಪ್ರತ್ಯಾಗಮ 0;
}
