ಪೂರ್ಣಾಂಕ ಬರೆ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ*, ...);

#ವ್ಯಾಖ್ಯಾನಿಸು myassert(x) \
    ಬರೆ("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

ಎಣಿಕೆ{ ಒಳ = 0};

ಪೂರ್ಣಾಂಕ main_1(){
    {
        myassert(!ಒಳ);
        ಆದರೆ(ಗಾತ್ರ(ಎಣಿಕೆ{ಒಳ=1})) myassert(ಒಳ);
        myassert(!ಒಳ); //OOPS
    }
    {
        myassert(!ಒಳ);
        ಆಯ್ಕೆ(ಗಾತ್ರ(ಎಣಿಕೆ{ಒಳ=1})) { ಪೂರ್ವನಿಯೋಜಿತ: myassert(ಒಳ); }
        myassert(!ಒಳ); //OOPS
    }
    {
        myassert(!ಒಳ);
        ಆಗ(ಗಾತ್ರ(ಎಣಿಕೆ{ಒಳ=1})) { myassert(ಒಳ); ನಿಲ್ಲಿಸು; }
        myassert(!ಒಳ); //OOPS
    }
    {
        myassert(!ಒಳ);
        ಮಾಡು{ myassert(!ಒಳ);}ಆಗ(0*ಗಾತ್ರ(ಎಣಿಕೆ{ಒಳ=1}));
        myassert(!ಒಳ); //OOPS
    }

    {
        myassert(!ಒಳ);
        ಗಾಗಿ(ಗಾತ್ರ(ಎಣಿಕೆ{ಒಳ=1});;){ myassert(ಒಳ); ನಿಲ್ಲಿಸು; }
        myassert(!ಒಳ); //OK
    }
    {
        myassert(!ಒಳ);
        ಗಾಗಿ(;;ಗಾತ್ರ(ಎಣಿಕೆ{ಒಳ=1})){ myassert(ಒಳ); ನಿಲ್ಲಿಸು; }
        myassert(!ಒಳ); //OK
    }
    {
        myassert(!ಒಳ);
        ಗಾಗಿ(;ಗಾತ್ರ(ಎಣಿಕೆ{ಒಳ=1});){ myassert(ಒಳ); ನಿಲ್ಲಿಸು; }
        myassert(!ಒಳ); //OK
    }
    ಹಿಂತಿರುಗಿ 0;
}

/* --------------------------------------------- */
ಪೂರ್ಣಾಂಕ main_2()
{
  ಅಕ್ಷರ c = 'a';
  ಶೂನ್ಯ func1(ಅಕ್ಷರ c); /* param 'c' must not shadow local 'c' */
  func1(c);
  ಹಿಂತಿರುಗಿ 0;
}

ಶೂನ್ಯ func1(ಅಕ್ಷರ c)
{
    myassert(c == 'a');
}

ರಚನೆ st { ಪೂರ್ಣಾಂಕ a; };

/* --------------------------------------------- */
ಪೂರ್ಣಾಂಕ main_3()
{
  ರಚನೆ st func(ಶೂನ್ಯ);
  ರಚನೆ st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  ಹಿಂತಿರುಗಿ 0;
}

ರಚನೆ st func(ಶೂನ್ಯ)
{
  ರಚನೆ st st = { 10 };
  ಹಿಂತಿರುಗಿ st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
ಸ್ಥಿರ ಶೂನ್ಯ f4(ಅಕ್ಷರ *(*md)(ಅಕ್ಷರ *md))
{
   (*md)("test");
}
ಸ್ಥಿರ ಅಕ್ಷರ *a4(ಅಕ್ಷರ *a)
{
    ಪೂರ್ಣಾಂಕ strcmp();
    myassert(!strcmp(a, "test"));
    ಹಿಂತಿರುಗಿ a;
}

ಪೂರ್ಣಾಂಕ main_4()
{
    f4(a4);
    ಹಿಂತಿರುಗಿ 0;
}

/* --------------------------------------------- */
ಪೂರ್ಣಾಂಕ a5[3], b5[];
ಪೂರ್ಣಾಂಕ f5(ಶೂನ್ಯ);
ಪೂರ್ಣಾಂಕ main_5()
{
    ಬಾಹ್ಯ ಪೂರ್ಣಾಂಕ a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    ಹಿಂತಿರುಗಿ 0;
}
ಪೂರ್ಣಾಂಕ f5(ಶೂನ್ಯ)
{
    ಹಿಂತಿರುಗಿ a5[2]+b5[2];
}
ಪೂರ್ಣಾಂಕ b5[3];

/* --------------------------------------------- */
ಸ್ಥಿರ ಪೂರ್ಣಾಂಕ f6(ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ i6 = 11;

ಪೂರ್ಣಾಂಕ main_6()
{
    {
        ಪೂರ್ಣಾಂಕ i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            ಪೂರ್ಣಾಂಕ f6(ಪೂರ್ಣಾಂಕ);
            ಬಾಹ್ಯ ಪೂರ್ಣಾಂಕ i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    ಹಿಂತಿರುಗಿ 0;
}

ಪೂರ್ಣಾಂಕ f6(ಪೂರ್ಣಾಂಕ x)
{
    ಹಿಂತಿರುಗಿ x;
}

/* --------------------------------------------- */

#ಆದರೆ defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#ಇಲ್ಲದಿದ್ದರೆ
# define _ "_"
#ಆದರೆ_ಅಂತ್ಯ

ರಚನೆ xx7 { ಪೂರ್ಣಾಂಕ a, b; };

ಶೂನ್ಯ f7()
{
    ರಚನೆ xx7 { ಪೂರ್ಣಾಂಕ c; } x;
    {
        ಬಾಹ್ಯ ರಚನೆ xx7 { ಪೂರ್ಣಾಂಕ a, b; } x __asm__(_"z7");
        x.a = 12;
        ರಚನೆ xx7 y = { 0,0 };
    }
    ರಚನೆ xx7 y = { 90 };
    x.c = 78;
    ಬರೆ("xx7 (1) : %d %d\n", x.c, y.c);
}

ಪೂರ್ಣಾಂಕ main_7()
{
    f7();
    ಬಾಹ್ಯ ರಚನೆ xx7 y __asm__(_"z7");
    ಬರೆ("xx7 (2) : %d %d\n", y.a, y.b);
    ಹಿಂತಿರುಗಿ 0;
}


ರಚನೆ xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    ಹಿಂತಿರುಗಿ 0;
}
