முழு printf(மாறிலி எழுத்து*, ...);

#define myassert(x) \
    printf("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

எண்ணிக்கை{ in = 0};

முழு main_1(){
    {
        myassert(!in);
        எனில்(அளவு(எண்ணிக்கை{in=1})) myassert(in);
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        தேர்வு(அளவு(எண்ணிக்கை{in=1})) { இயல்பு: myassert(in); }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        போது(அளவு(எண்ணிக்கை{in=1})) { myassert(in); நிறுத்து; }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        செய்{ myassert(!in);}போது(0*அளவு(எண்ணிக்கை{in=1}));
        myassert(!in); //OOPS
    }

    {
        myassert(!in);
        க்கு(அளவு(எண்ணிக்கை{in=1});;){ myassert(in); நிறுத்து; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        க்கு(;;அளவு(எண்ணிக்கை{in=1})){ myassert(in); நிறுத்து; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        க்கு(;அளவு(எண்ணிக்கை{in=1});){ myassert(in); நிறுத்து; }
        myassert(!in); //OK
    }
    திரும்பு 0;
}

/* --------------------------------------------- */
முழு main_2()
{
  எழுத்து c = 'a';
  வெறுமை func1(எழுத்து c); /* param 'c' must not shadow local 'c' */
  func1(c);
  திரும்பு 0;
}

வெறுமை func1(எழுத்து c)
{
    myassert(c == 'a');
}

கட்டமைப்பு st { முழு a; };

/* --------------------------------------------- */
முழு main_3()
{
  கட்டமைப்பு st func(வெறுமை);
  கட்டமைப்பு st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  திரும்பு 0;
}

கட்டமைப்பு st func(வெறுமை)
{
  கட்டமைப்பு st st = { 10 };
  திரும்பு st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
நிலையான வெறுமை f4(எழுத்து *(*md)(எழுத்து *md))
{
   (*md)("test");
}
நிலையான எழுத்து *a4(எழுத்து *a)
{
    முழு strcmp();
    myassert(!strcmp(a, "test"));
    திரும்பு a;
}

முழு main_4()
{
    f4(a4);
    திரும்பு 0;
}

/* --------------------------------------------- */
முழு a5[3], b5[];
முழு f5(வெறுமை);
முழு main_5()
{
    வெளி முழு a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    திரும்பு 0;
}
முழு f5(வெறுமை)
{
    திரும்பு a5[2]+b5[2];
}
முழு b5[3];

/* --------------------------------------------- */
நிலையான முழு f6(முழு);
முழு i6 = 11;

முழு main_6()
{
    {
        முழு i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            முழு f6(முழு);
            வெளி முழு i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    திரும்பு 0;
}

முழு f6(முழு x)
{
    திரும்பு x;
}

/* --------------------------------------------- */

#எனில் defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#இல்லையெனில்
# define _ "_"
#endif

கட்டமைப்பு xx7 { முழு a, b; };

வெறுமை f7()
{
    கட்டமைப்பு xx7 { முழு c; } x;
    {
        வெளி கட்டமைப்பு xx7 { முழு a, b; } x __asm__(_"z7");
        x.a = 12;
        கட்டமைப்பு xx7 y = { 0,0 };
    }
    கட்டமைப்பு xx7 y = { 90 };
    x.c = 78;
    printf("xx7 (1) : %d %d\n", x.c, y.c);
}

முழு main_7()
{
    f7();
    வெளி கட்டமைப்பு xx7 y __asm__(_"z7");
    printf("xx7 (2) : %d %d\n", y.a, y.b);
    திரும்பு 0;
}


கட்டமைப்பு xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
முழு முதன்மை()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    திரும்பு 0;
}
