പൂർണ്ണസംഖ്യ printf(സ്ഥിരം അക്ഷരം*, ...);

#define myassert(x) \
    printf("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

എണ്ണൽ{ in = 0};

പൂർണ്ണസംഖ്യ main_1(){
    {
        myassert(!in);
        എങ്കിൽ(വലുപ്പം(എണ്ണൽ{in=1})) myassert(in);
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        തിരഞ്ഞെടുപ്പ്(വലുപ്പം(എണ്ണൽ{in=1})) { സ്ഥിരസ്ഥിതി: myassert(in); }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        ആകുമ്പോൾ(വലുപ്പം(എണ്ണൽ{in=1})) { myassert(in); നിർത്തുക; }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        ചെയ്യുക{ myassert(!in);}ആകുമ്പോൾ(0*വലുപ്പം(എണ്ണൽ{in=1}));
        myassert(!in); //OOPS
    }

    {
        myassert(!in);
        വേണ്ടി(വലുപ്പം(എണ്ണൽ{in=1});;){ myassert(in); നിർത്തുക; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        വേണ്ടി(;;വലുപ്പം(എണ്ണൽ{in=1})){ myassert(in); നിർത്തുക; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        വേണ്ടി(;വലുപ്പം(എണ്ണൽ{in=1});){ myassert(in); നിർത്തുക; }
        myassert(!in); //OK
    }
    തിരികെ 0;
}

/* --------------------------------------------- */
പൂർണ്ണസംഖ്യ main_2()
{
  അക്ഷരം c = 'a';
  ശൂന്യം func1(അക്ഷരം c); /* param 'c' must not shadow local 'c' */
  func1(c);
  തിരികെ 0;
}

ശൂന്യം func1(അക്ഷരം c)
{
    myassert(c == 'a');
}

ഘടന st { പൂർണ്ണസംഖ്യ a; };

/* --------------------------------------------- */
പൂർണ്ണസംഖ്യ main_3()
{
  ഘടന st func(ശൂന്യം);
  ഘടന st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  തിരികെ 0;
}

ഘടന st func(ശൂന്യം)
{
  ഘടന st st = { 10 };
  തിരികെ st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
സ്ഥിതം ശൂന്യം f4(അക്ഷരം *(*md)(അക്ഷരം *md))
{
   (*md)("test");
}
സ്ഥിതം അക്ഷരം *a4(അക്ഷരം *a)
{
    പൂർണ്ണസംഖ്യ strcmp();
    myassert(!strcmp(a, "test"));
    തിരികെ a;
}

പൂർണ്ണസംഖ്യ main_4()
{
    f4(a4);
    തിരികെ 0;
}

/* --------------------------------------------- */
പൂർണ്ണസംഖ്യ a5[3], b5[];
പൂർണ്ണസംഖ്യ f5(ശൂന്യം);
പൂർണ്ണസംഖ്യ main_5()
{
    ബാഹ്യ പൂർണ്ണസംഖ്യ a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    തിരികെ 0;
}
പൂർണ്ണസംഖ്യ f5(ശൂന്യം)
{
    തിരികെ a5[2]+b5[2];
}
പൂർണ്ണസംഖ്യ b5[3];

/* --------------------------------------------- */
സ്ഥിതം പൂർണ്ണസംഖ്യ f6(പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ i6 = 11;

പൂർണ്ണസംഖ്യ main_6()
{
    {
        പൂർണ്ണസംഖ്യ i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            പൂർണ്ണസംഖ്യ f6(പൂർണ്ണസംഖ്യ);
            ബാഹ്യ പൂർണ്ണസംഖ്യ i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    തിരികെ 0;
}

പൂർണ്ണസംഖ്യ f6(പൂർണ്ണസംഖ്യ x)
{
    തിരികെ x;
}

/* --------------------------------------------- */

#എങ്കിൽ defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#അല്ലെങ്കിൽ
# define _ "_"
#endif

ഘടന xx7 { പൂർണ്ണസംഖ്യ a, b; };

ശൂന്യം f7()
{
    ഘടന xx7 { പൂർണ്ണസംഖ്യ c; } x;
    {
        ബാഹ്യ ഘടന xx7 { പൂർണ്ണസംഖ്യ a, b; } x __asm__(_"z7");
        x.a = 12;
        ഘടന xx7 y = { 0,0 };
    }
    ഘടന xx7 y = { 90 };
    x.c = 78;
    printf("xx7 (1) : %d %d\n", x.c, y.c);
}

പൂർണ്ണസംഖ്യ main_7()
{
    f7();
    ബാഹ്യ ഘടന xx7 y __asm__(_"z7");
    printf("xx7 (2) : %d %d\n", y.a, y.b);
    തിരികെ 0;
}


ഘടന xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
പൂർണ്ണസംഖ്യ പ്രധാന()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    തിരികെ 0;
}
