صحیح لکھو(ثابت حرف*, ...);

#تعریف_کرو myassert(x) \
    لکھو("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

شمار{ اندر = 0};

صحیح main_1(){
    {
        myassert(!اندر);
        اگر(حجم(شمار{اندر=1})) myassert(اندر);
        myassert(!اندر); //OOPS
    }
    {
        myassert(!اندر);
        انتخاب(حجم(شمار{اندر=1})) { طےشدہ: myassert(اندر); }
        myassert(!اندر); //OOPS
    }
    {
        myassert(!اندر);
        جب(حجم(شمار{اندر=1})) { myassert(اندر); توڑو; }
        myassert(!اندر); //OOPS
    }
    {
        myassert(!اندر);
        کرو{ myassert(!اندر);}جب(0*حجم(شمار{اندر=1}));
        myassert(!اندر); //OOPS
    }

    {
        myassert(!اندر);
        برائے(حجم(شمار{اندر=1});;){ myassert(اندر); توڑو; }
        myassert(!اندر); //OK
    }
    {
        myassert(!اندر);
        برائے(;;حجم(شمار{اندر=1})){ myassert(اندر); توڑو; }
        myassert(!اندر); //OK
    }
    {
        myassert(!اندر);
        برائے(;حجم(شمار{اندر=1});){ myassert(اندر); توڑو; }
        myassert(!اندر); //OK
    }
    واپس 0;
}

/* --------------------------------------------- */
صحیح main_2()
{
  حرف c = 'a';
  خالی func1(حرف c); /* param 'c' must not shadow local 'c' */
  func1(c);
  واپس 0;
}

خالی func1(حرف c)
{
    myassert(c == 'a');
}

ساخت st { صحیح a; };

/* --------------------------------------------- */
صحیح main_3()
{
  ساخت st func(خالی);
  ساخت st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  واپس 0;
}

ساخت st func(خالی)
{
  ساخت st st = { 10 };
  واپس st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
ساکن خالی f4(حرف *(*md)(حرف *md))
{
   (*md)("test");
}
ساکن حرف *a4(حرف *a)
{
    صحیح strcmp();
    myassert(!strcmp(a, "test"));
    واپس a;
}

صحیح main_4()
{
    f4(a4);
    واپس 0;
}

/* --------------------------------------------- */
صحیح a5[3], b5[];
صحیح f5(خالی);
صحیح main_5()
{
    خارجی صحیح a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    واپس 0;
}
صحیح f5(خالی)
{
    واپس a5[2]+b5[2];
}
صحیح b5[3];

/* --------------------------------------------- */
ساکن صحیح f6(صحیح);
صحیح i6 = 11;

صحیح main_6()
{
    {
        صحیح i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            صحیح f6(صحیح);
            خارجی صحیح i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    واپس 0;
}

صحیح f6(صحیح x)
{
    واپس x;
}

/* --------------------------------------------- */

#اگر defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#ورنہ
# define _ "_"
#اگر_ختم

ساخت xx7 { صحیح a, b; };

خالی f7()
{
    ساخت xx7 { صحیح c; } x;
    {
        خارجی ساخت xx7 { صحیح a, b; } x __asm__(_"z7");
        x.a = 12;
        ساخت xx7 y = { 0,0 };
    }
    ساخت xx7 y = { 90 };
    x.c = 78;
    لکھو("xx7 (1) : %d %d\n", x.c, y.c);
}

صحیح main_7()
{
    f7();
    خارجی ساخت xx7 y __asm__(_"z7");
    لکھو("xx7 (2) : %d %d\n", y.a, y.b);
    واپس 0;
}


ساخت xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
صحیح مین()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    واپس 0;
}
