ପୂର୍ଣ୍ଣସଂଖ୍ୟା printf(ଅଚଳ ଅକ୍ଷର*, ...);

#define myassert(x) \
    printf("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

ଗଣନା{ in = 0};

ପୂର୍ଣ୍ଣସଂଖ୍ୟା main_1(){
    {
        myassert(!in);
        ଯଦି(ଆକାର(ଗଣନା{in=1})) myassert(in);
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        ବାଛ(ଆକାର(ଗଣନା{in=1})) { ପୂର୍ବନିର୍ଦ୍ଧାରିତ: myassert(in); }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        ଯେତେବେଳେ(ଆକାର(ଗଣନା{in=1})) { myassert(in); ଭାଙ୍ଗ; }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        କର{ myassert(!in);}ଯେତେବେଳେ(0*ଆକାର(ଗଣନା{in=1}));
        myassert(!in); //OOPS
    }

    {
        myassert(!in);
        ପାଇଁ(ଆକାର(ଗଣନା{in=1});;){ myassert(in); ଭାଙ୍ଗ; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        ପାଇଁ(;;ଆକାର(ଗଣନା{in=1})){ myassert(in); ଭାଙ୍ଗ; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        ପାଇଁ(;ଆକାର(ଗଣନା{in=1});){ myassert(in); ଭାଙ୍ଗ; }
        myassert(!in); //OK
    }
    ଫେରନ୍ତୁ 0;
}

/* --------------------------------------------- */
ପୂର୍ଣ୍ଣସଂଖ୍ୟା main_2()
{
  ଅକ୍ଷର c = 'a';
  ଶୂନ୍ୟ func1(ଅକ୍ଷର c); /* param 'c' must not shadow local 'c' */
  func1(c);
  ଫେରନ୍ତୁ 0;
}

ଶୂନ୍ୟ func1(ଅକ୍ଷର c)
{
    myassert(c == 'a');
}

ସଂରଚନା st { ପୂର୍ଣ୍ଣସଂଖ୍ୟା a; };

/* --------------------------------------------- */
ପୂର୍ଣ୍ଣସଂଖ୍ୟା main_3()
{
  ସଂରଚନା st func(ଶୂନ୍ୟ);
  ସଂରଚନା st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  ଫେରନ୍ତୁ 0;
}

ସଂରଚନା st func(ଶୂନ୍ୟ)
{
  ସଂରଚନା st st = { 10 };
  ଫେରନ୍ତୁ st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
ସ୍ଥିର ଶୂନ୍ୟ f4(ଅକ୍ଷର *(*md)(ଅକ୍ଷର *md))
{
   (*md)("test");
}
ସ୍ଥିର ଅକ୍ଷର *a4(ଅକ୍ଷର *a)
{
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା strcmp();
    myassert(!strcmp(a, "test"));
    ଫେରନ୍ତୁ a;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା main_4()
{
    f4(a4);
    ଫେରନ୍ତୁ 0;
}

/* --------------------------------------------- */
ପୂର୍ଣ୍ଣସଂଖ୍ୟା a5[3], b5[];
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f5(ଶୂନ୍ୟ);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା main_5()
{
    ବାହ୍ୟ ପୂର୍ଣ୍ଣସଂଖ୍ୟା a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    ଫେରନ୍ତୁ 0;
}
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f5(ଶୂନ୍ୟ)
{
    ଫେରନ୍ତୁ a5[2]+b5[2];
}
ପୂର୍ଣ୍ଣସଂଖ୍ୟା b5[3];

/* --------------------------------------------- */
ସ୍ଥିର ପୂର୍ଣ୍ଣସଂଖ୍ୟା f6(ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା i6 = 11;

ପୂର୍ଣ୍ଣସଂଖ୍ୟା main_6()
{
    {
        ପୂର୍ଣ୍ଣସଂଖ୍ୟା i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            ପୂର୍ଣ୍ଣସଂଖ୍ୟା f6(ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
            ବାହ୍ୟ ପୂର୍ଣ୍ଣସଂଖ୍ୟା i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    ଫେରନ୍ତୁ 0;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା f6(ପୂର୍ଣ୍ଣସଂଖ୍ୟା x)
{
    ଫେରନ୍ତୁ x;
}

/* --------------------------------------------- */

#ଯଦି defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#ଅନ୍ୟଥା
# define _ "_"
#endif

ସଂରଚନା xx7 { ପୂର୍ଣ୍ଣସଂଖ୍ୟା a, b; };

ଶୂନ୍ୟ f7()
{
    ସଂରଚନା xx7 { ପୂର୍ଣ୍ଣସଂଖ୍ୟା c; } x;
    {
        ବାହ୍ୟ ସଂରଚନା xx7 { ପୂର୍ଣ୍ଣସଂଖ୍ୟା a, b; } x __asm__(_"z7");
        x.a = 12;
        ସଂରଚନା xx7 y = { 0,0 };
    }
    ସଂରଚନା xx7 y = { 90 };
    x.c = 78;
    printf("xx7 (1) : %d %d\n", x.c, y.c);
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା main_7()
{
    f7();
    ବାହ୍ୟ ସଂରଚନା xx7 y __asm__(_"z7");
    printf("xx7 (2) : %d %d\n", y.a, y.b);
    ଫେରନ୍ତୁ 0;
}


ସଂରଚନା xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
ପୂର୍ଣ୍ଣସଂଖ୍ୟା ମୁଖ୍ୟ()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    ଫେରନ୍ତୁ 0;
}
