పూర్ణాంకం రాయి(స్థిరరాశి అక్షరం*, ...);

#నిర్వచించు myassert(x) \
    రాయి("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

గణన{ లోపల = 0};

పూర్ణాంకం main_1(){
    {
        myassert(!లోపల);
        ఒకవేళ(పరిమాణం(గణన{లోపల=1})) myassert(లోపల);
        myassert(!లోపల); //OOPS
    }
    {
        myassert(!లోపల);
        ఎంపిక(పరిమాణం(గణన{లోపల=1})) { అప్రమేయ: myassert(లోపల); }
        myassert(!లోపల); //OOPS
    }
    {
        myassert(!లోపల);
        అయితే(పరిమాణం(గణన{లోపల=1})) { myassert(లోపల); ఆపు; }
        myassert(!లోపల); //OOPS
    }
    {
        myassert(!లోపల);
        చేయి{ myassert(!లోపల);}అయితే(0*పరిమాణం(గణన{లోపల=1}));
        myassert(!లోపల); //OOPS
    }

    {
        myassert(!లోపల);
        కొరకు(పరిమాణం(గణన{లోపల=1});;){ myassert(లోపల); ఆపు; }
        myassert(!లోపల); //OK
    }
    {
        myassert(!లోపల);
        కొరకు(;;పరిమాణం(గణన{లోపల=1})){ myassert(లోపల); ఆపు; }
        myassert(!లోపల); //OK
    }
    {
        myassert(!లోపల);
        కొరకు(;పరిమాణం(గణన{లోపల=1});){ myassert(లోపల); ఆపు; }
        myassert(!లోపల); //OK
    }
    తిరిగి 0;
}

/* --------------------------------------------- */
పూర్ణాంకం main_2()
{
  అక్షరం c = 'a';
  శూన్య func1(అక్షరం c); /* param 'c' must not shadow local 'c' */
  func1(c);
  తిరిగి 0;
}

శూన్య func1(అక్షరం c)
{
    myassert(c == 'a');
}

నిర్మాణం st { పూర్ణాంకం a; };

/* --------------------------------------------- */
పూర్ణాంకం main_3()
{
  నిర్మాణం st func(శూన్య);
  నిర్మాణం st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  తిరిగి 0;
}

నిర్మాణం st func(శూన్య)
{
  నిర్మాణం st st = { 10 };
  తిరిగి st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
స్థిర శూన్య f4(అక్షరం *(*md)(అక్షరం *md))
{
   (*md)("test");
}
స్థిర అక్షరం *a4(అక్షరం *a)
{
    పూర్ణాంకం strcmp();
    myassert(!strcmp(a, "test"));
    తిరిగి a;
}

పూర్ణాంకం main_4()
{
    f4(a4);
    తిరిగి 0;
}

/* --------------------------------------------- */
పూర్ణాంకం a5[3], b5[];
పూర్ణాంకం f5(శూన్య);
పూర్ణాంకం main_5()
{
    బాహ్య పూర్ణాంకం a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    తిరిగి 0;
}
పూర్ణాంకం f5(శూన్య)
{
    తిరిగి a5[2]+b5[2];
}
పూర్ణాంకం b5[3];

/* --------------------------------------------- */
స్థిర పూర్ణాంకం f6(పూర్ణాంకం);
పూర్ణాంకం i6 = 11;

పూర్ణాంకం main_6()
{
    {
        పూర్ణాంకం i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            పూర్ణాంకం f6(పూర్ణాంకం);
            బాహ్య పూర్ణాంకం i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    తిరిగి 0;
}

పూర్ణాంకం f6(పూర్ణాంకం x)
{
    తిరిగి x;
}

/* --------------------------------------------- */

#ఒకవేళ defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#లేకపోతే
# define _ "_"
#అయితే_ముగింపు

నిర్మాణం xx7 { పూర్ణాంకం a, b; };

శూన్య f7()
{
    నిర్మాణం xx7 { పూర్ణాంకం c; } x;
    {
        బాహ్య నిర్మాణం xx7 { పూర్ణాంకం a, b; } x __asm__(_"z7");
        x.a = 12;
        నిర్మాణం xx7 y = { 0,0 };
    }
    నిర్మాణం xx7 y = { 90 };
    x.c = 78;
    రాయి("xx7 (1) : %d %d\n", x.c, y.c);
}

పూర్ణాంకం main_7()
{
    f7();
    బాహ్య నిర్మాణం xx7 y __asm__(_"z7");
    రాయి("xx7 (2) : %d %d\n", y.a, y.b);
    తిరిగి 0;
}


నిర్మాణం xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
పూర్ణాంకం ప్రధాన()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    తిరిగి 0;
}
