पूर्णांक म_लिखो(स्थिर अक्षर*, ...);

#घोषणा myassert(x) \
    म_लिखो("%s:%d: %s : \"%s\"\n", __खाता__,__LINE__,(x)?"ok":"error",#x)

क्रमागत{ in = 0};

पूर्णांक main_1(){
    {
        myassert(!in);
        अगर(माप(क्रमागत{in=1})) myassert(in);
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        चयन(माप(क्रमागत{in=1})) { शेष: myassert(in); }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        जबतक(माप(क्रमागत{in=1})) { myassert(in); अवरोध; }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        करो{ myassert(!in);}जबतक(0*माप(क्रमागत{in=1}));
        myassert(!in); //OOPS
    }

    {
        myassert(!in);
        क्रम(माप(क्रमागत{in=1});;){ myassert(in); अवरोध; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        क्रम(;;माप(क्रमागत{in=1})){ myassert(in); अवरोध; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        क्रम(;माप(क्रमागत{in=1});){ myassert(in); अवरोध; }
        myassert(!in); //OK
    }
    वापस 0;
}

/* --------------------------------------------- */
पूर्णांक main_2()
{
  अक्षर c = 'a';
  व्योम func1(अक्षर c); /* param 'c' must not shadow local 'c' */
  func1(c);
  वापस 0;
}

व्योम func1(अक्षर c)
{
    myassert(c == 'a');
}

काष्ठा st { पूर्णांक a; };

/* --------------------------------------------- */
पूर्णांक main_3()
{
  काष्ठा st func(व्योम);
  काष्ठा st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  वापस 0;
}

काष्ठा st func(व्योम)
{
  काष्ठा st st = { 10 };
  वापस st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
अटल व्योम f4(अक्षर *(*md)(अक्षर *md))
{
   (*md)("test");
}
अटल अक्षर *a4(अक्षर *a)
{
    पूर्णांक म_भेद();
    myassert(!म_भेद(a, "test"));
    वापस a;
}

पूर्णांक main_4()
{
    f4(a4);
    वापस 0;
}

/* --------------------------------------------- */
पूर्णांक a5[3], b5[];
पूर्णांक f5(व्योम);
पूर्णांक main_5()
{
    बाह्य पूर्णांक a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    वापस 0;
}
पूर्णांक f5(व्योम)
{
    वापस a5[2]+b5[2];
}
पूर्णांक b5[3];

/* --------------------------------------------- */
अटल पूर्णांक f6(पूर्णांक);
पूर्णांक i6 = 11;

पूर्णांक main_6()
{
    {
        पूर्णांक i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            पूर्णांक f6(पूर्णांक);
            बाह्य पूर्णांक i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    वापस 0;
}

पूर्णांक f6(पूर्णांक x)
{
    वापस x;
}

/* --------------------------------------------- */

#अगर defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#अन्यथा
# define _ "_"
#पूर्ण_अगर

काष्ठा xx7 { पूर्णांक a, b; };

व्योम f7()
{
    काष्ठा xx7 { पूर्णांक c; } x;
    {
        बाह्य काष्ठा xx7 { पूर्णांक a, b; } x __asm__(_"z7");
        x.a = 12;
        काष्ठा xx7 y = { 0,0 };
    }
    काष्ठा xx7 y = { 90 };
    x.c = 78;
    म_लिखो("xx7 (1) : %d %d\n", x.c, y.c);
}

पूर्णांक main_7()
{
    f7();
    बाह्य काष्ठा xx7 y __asm__(_"z7");
    म_लिखो("xx7 (2) : %d %d\n", y.a, y.b);
    वापस 0;
}


काष्ठा xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
पूर्णांक मुख्य()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    वापस 0;
}
