পূর্ণসংখ্যা printf(ধ্রুবক অক্ষর*, ...);

#define myassert(x) \
    printf("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

গণনা{ in = 0};

পূর্ণসংখ্যা main_1(){
    {
        myassert(!in);
        যদি(আকার(গণনা{in=1})) myassert(in);
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        নির্বাচন(আকার(গণনা{in=1})) { পূর্বনির্ধারিত: myassert(in); }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        যখন(আকার(গণনা{in=1})) { myassert(in); বিরতি; }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        করো{ myassert(!in);}যখন(0*আকার(গণনা{in=1}));
        myassert(!in); //OOPS
    }

    {
        myassert(!in);
        জন্য(আকার(গণনা{in=1});;){ myassert(in); বিরতি; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        জন্য(;;আকার(গণনা{in=1})){ myassert(in); বিরতি; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        জন্য(;আকার(গণনা{in=1});){ myassert(in); বিরতি; }
        myassert(!in); //OK
    }
    ফেরত 0;
}

/* --------------------------------------------- */
পূর্ণসংখ্যা main_2()
{
  অক্ষর c = 'a';
  শূন্য func1(অক্ষর c); /* param 'c' must not shadow local 'c' */
  func1(c);
  ফেরত 0;
}

শূন্য func1(অক্ষর c)
{
    myassert(c == 'a');
}

কাঠামো st { পূর্ণসংখ্যা a; };

/* --------------------------------------------- */
পূর্ণসংখ্যা main_3()
{
  কাঠামো st func(শূন্য);
  কাঠামো st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  ফেরত 0;
}

কাঠামো st func(শূন্য)
{
  কাঠামো st st = { 10 };
  ফেরত st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
স্থির শূন্য f4(অক্ষর *(*md)(অক্ষর *md))
{
   (*md)("test");
}
স্থির অক্ষর *a4(অক্ষর *a)
{
    পূর্ণসংখ্যা strcmp();
    myassert(!strcmp(a, "test"));
    ফেরত a;
}

পূর্ণসংখ্যা main_4()
{
    f4(a4);
    ফেরত 0;
}

/* --------------------------------------------- */
পূর্ণসংখ্যা a5[3], b5[];
পূর্ণসংখ্যা f5(শূন্য);
পূর্ণসংখ্যা main_5()
{
    বাহ্যিক পূর্ণসংখ্যা a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    ফেরত 0;
}
পূর্ণসংখ্যা f5(শূন্য)
{
    ফেরত a5[2]+b5[2];
}
পূর্ণসংখ্যা b5[3];

/* --------------------------------------------- */
স্থির পূর্ণসংখ্যা f6(পূর্ণসংখ্যা);
পূর্ণসংখ্যা i6 = 11;

পূর্ণসংখ্যা main_6()
{
    {
        পূর্ণসংখ্যা i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            পূর্ণসংখ্যা f6(পূর্ণসংখ্যা);
            বাহ্যিক পূর্ণসংখ্যা i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    ফেরত 0;
}

পূর্ণসংখ্যা f6(পূর্ণসংখ্যা x)
{
    ফেরত x;
}

/* --------------------------------------------- */

#যদি defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#অন্যথা
# define _ "_"
#endif

কাঠামো xx7 { পূর্ণসংখ্যা a, b; };

শূন্য f7()
{
    কাঠামো xx7 { পূর্ণসংখ্যা c; } x;
    {
        বাহ্যিক কাঠামো xx7 { পূর্ণসংখ্যা a, b; } x __asm__(_"z7");
        x.a = 12;
        কাঠামো xx7 y = { 0,0 };
    }
    কাঠামো xx7 y = { 90 };
    x.c = 78;
    printf("xx7 (1) : %d %d\n", x.c, y.c);
}

পূর্ণসংখ্যা main_7()
{
    f7();
    বাহ্যিক কাঠামো xx7 y __asm__(_"z7");
    printf("xx7 (2) : %d %d\n", y.a, y.b);
    ফেরত 0;
}


কাঠামো xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
পূর্ণসংখ্যা প্রধান()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    ফেরত 0;
}
