पूर्णाङ्क प्रारूप_लिख(ध्रुव वर्ण*, ...);

#परिभाषय myassert(x) \
    प्रारूप_लिख("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

गणना{ अन्तर् = 0};

पूर्णाङ्क main_1(){
    {
        myassert(!अन्तर्);
        यदि(परिमाण(गणना{अन्तर्=1})) myassert(अन्तर्);
        myassert(!अन्तर्); //OOPS
    }
    {
        myassert(!अन्तर्);
        विकल्प(परिमाण(गणना{अन्तर्=1})) { स्वभाव: myassert(अन्तर्); }
        myassert(!अन्तर्); //OOPS
    }
    {
        myassert(!अन्तर्);
        यावत्(परिमाण(गणना{अन्तर्=1})) { myassert(अन्तर्); भङ्ग; }
        myassert(!अन्तर्); //OOPS
    }
    {
        myassert(!अन्तर्);
        कुरु{ myassert(!अन्तर्);}यावत्(0*परिमाण(गणना{अन्तर्=1}));
        myassert(!अन्तर्); //OOPS
    }

    {
        myassert(!अन्तर्);
        प्रति(परिमाण(गणना{अन्तर्=1});;){ myassert(अन्तर्); भङ्ग; }
        myassert(!अन्तर्); //OK
    }
    {
        myassert(!अन्तर्);
        प्रति(;;परिमाण(गणना{अन्तर्=1})){ myassert(अन्तर्); भङ्ग; }
        myassert(!अन्तर्); //OK
    }
    {
        myassert(!अन्तर्);
        प्रति(;परिमाण(गणना{अन्तर्=1});){ myassert(अन्तर्); भङ्ग; }
        myassert(!अन्तर्); //OK
    }
    प्रत्यागम 0;
}

/* --------------------------------------------- */
पूर्णाङ्क main_2()
{
  वर्ण c = 'a';
  शून्य func1(वर्ण c); /* param 'c' must not shadow local 'c' */
  func1(c);
  प्रत्यागम 0;
}

शून्य func1(वर्ण c)
{
    myassert(c == 'a');
}

संरचना st { पूर्णाङ्क a; };

/* --------------------------------------------- */
पूर्णाङ्क main_3()
{
  संरचना st func(शून्य);
  संरचना st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  प्रत्यागम 0;
}

संरचना st func(शून्य)
{
  संरचना st st = { 10 };
  प्रत्यागम st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
स्थिर शून्य f4(वर्ण *(*md)(वर्ण *md))
{
   (*md)("test");
}
स्थिर वर्ण *a4(वर्ण *a)
{
    पूर्णाङ्क वाक्यं_तुलय();
    myassert(!वाक्यं_तुलय(a, "test"));
    प्रत्यागम a;
}

पूर्णाङ्क main_4()
{
    f4(a4);
    प्रत्यागम 0;
}

/* --------------------------------------------- */
पूर्णाङ्क a5[3], b5[];
पूर्णाङ्क f5(शून्य);
पूर्णाङ्क main_5()
{
    बाह्य पूर्णाङ्क a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    प्रत्यागम 0;
}
पूर्णाङ्क f5(शून्य)
{
    प्रत्यागम a5[2]+b5[2];
}
पूर्णाङ्क b5[3];

/* --------------------------------------------- */
स्थिर पूर्णाङ्क f6(पूर्णाङ्क);
पूर्णाङ्क i6 = 11;

पूर्णाङ्क main_6()
{
    {
        पूर्णाङ्क i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            पूर्णाङ्क f6(पूर्णाङ्क);
            बाह्य पूर्णाङ्क i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    प्रत्यागम 0;
}

पूर्णाङ्क f6(पूर्णाङ्क x)
{
    प्रत्यागम x;
}

/* --------------------------------------------- */

#यदि defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#अन्यथा
# define _ "_"
#यदि_अन्तः

संरचना xx7 { पूर्णाङ्क a, b; };

शून्य f7()
{
    संरचना xx7 { पूर्णाङ्क c; } x;
    {
        बाह्य संरचना xx7 { पूर्णाङ्क a, b; } x __asm__(_"z7");
        x.a = 12;
        संरचना xx7 y = { 0,0 };
    }
    संरचना xx7 y = { 90 };
    x.c = 78;
    प्रारूप_लिख("xx7 (1) : %d %d\n", x.c, y.c);
}

पूर्णाङ्क main_7()
{
    f7();
    बाह्य संरचना xx7 y __asm__(_"z7");
    प्रारूप_लिख("xx7 (2) : %d %d\n", y.a, y.b);
    प्रत्यागम 0;
}


संरचना xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
पूर्णाङ्क मुख्यम्()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    प्रत्यागम 0;
}
