पूर्णांक म_लिखो(स्थिरांक अक्षर*, ...);

#define myassert(x) \
    म_लिखो("%s:%d: %s : \"%s\"\n", __FILE__,__LINE__,(x)?"ok":"error",#x)

गणना{ in = 0};

पूर्णांक main_1(){
    {
        myassert(!in);
        जर(आकार(गणना{in=1})) myassert(in);
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        निवड(आकार(गणना{in=1})) { पूर्वनिर्धारित: myassert(in); }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        पर्यंत(आकार(गणना{in=1})) { myassert(in); थांबा; }
        myassert(!in); //OOPS
    }
    {
        myassert(!in);
        करा{ myassert(!in);}पर्यंत(0*आकार(गणना{in=1}));
        myassert(!in); //OOPS
    }

    {
        myassert(!in);
        साठी(आकार(गणना{in=1});;){ myassert(in); थांबा; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        साठी(;;आकार(गणना{in=1})){ myassert(in); थांबा; }
        myassert(!in); //OK
    }
    {
        myassert(!in);
        साठी(;आकार(गणना{in=1});){ myassert(in); थांबा; }
        myassert(!in); //OK
    }
    परत 0;
}

/* --------------------------------------------- */
पूर्णांक main_2()
{
  अक्षर c = 'a';
  शून्य func1(अक्षर c); /* param 'c' must not shadow local 'c' */
  func1(c);
  परत 0;
}

शून्य func1(अक्षर c)
{
    myassert(c == 'a');
}

संरचना st { पूर्णांक a; };

/* --------------------------------------------- */
पूर्णांक main_3()
{
  संरचना st func(शून्य);
  संरचना st st = func(); /* not an 'incompatible redefinition' */
  myassert(st.a == 10);
  परत 0;
}

संरचना st func(शून्य)
{
  संरचना st st = { 10 };
  परत st;
}

/* --------------------------------------------- */
/* func* 'md' must not be shadowed by param 'md' */
स्थिर शून्य f4(अक्षर *(*md)(अक्षर *md))
{
   (*md)("test");
}
स्थिर अक्षर *a4(अक्षर *a)
{
    पूर्णांक म_भेद();
    myassert(!म_भेद(a, "test"));
    परत a;
}

पूर्णांक main_4()
{
    f4(a4);
    परत 0;
}

/* --------------------------------------------- */
पूर्णांक a5[3], b5[];
पूर्णांक f5(शून्य);
पूर्णांक main_5()
{
    बाह्य पूर्णांक a5[3], b5[3];
    a5[2]=10, b5[2]=4;
    myassert(f5() == 10 + 4);
    परत 0;
}
पूर्णांक f5(शून्य)
{
    परत a5[2]+b5[2];
}
पूर्णांक b5[3];

/* --------------------------------------------- */
स्थिर पूर्णांक f6(पूर्णांक);
पूर्णांक i6 = 11;

पूर्णांक main_6()
{
    {
        पूर्णांक i6 = 33, f6 = 44;
        myassert(i6 == 33 && f6 == 44);
        {
            पूर्णांक f6(पूर्णांक);
            बाह्य पूर्णांक i6;
            myassert(i6 == 11 && f6(22) == 22);
        }
        myassert(i6 == 33 && f6 == 44);
    }
    myassert(i6 == 11 && f6(22) == 22);
    परत 0;
}

पूर्णांक f6(पूर्णांक x)
{
    परत x;
}

/* --------------------------------------------- */

#जर defined __TINYC__ \
    ? !defined __leading_underscore \
    : !(defined __APPLE__ || defined _WIN32)
# define _
#अन्यथा
# define _ "_"
#endif

संरचना xx7 { पूर्णांक a, b; };

शून्य f7()
{
    संरचना xx7 { पूर्णांक c; } x;
    {
        बाह्य संरचना xx7 { पूर्णांक a, b; } x __asm__(_"z7");
        x.a = 12;
        संरचना xx7 y = { 0,0 };
    }
    संरचना xx7 y = { 90 };
    x.c = 78;
    म_लिखो("xx7 (1) : %d %d\n", x.c, y.c);
}

पूर्णांक main_7()
{
    f7();
    बाह्य संरचना xx7 y __asm__(_"z7");
    म_लिखो("xx7 (2) : %d %d\n", y.a, y.b);
    परत 0;
}


संरचना xx7 z7 = { 0, 34 };

/* --------------------------------------------- */
पूर्णांक main()
{
    main_1();
    main_2();
    main_3();
    main_4();
    main_5();
    main_6();
    main_7();
    परत 0;
}
