#অন্তর্ভাব<stdio.h>

কাঠামো large1 {
    পূর্ণসংখ্যা a[768];
};

কাঠামো large2 {
    পূর্ণসংখ্যা a[1920];
};

শূন্য pass_large_struct1(কাঠামো large1 in)
{
    printf("%d %d\n", in.a[200], in.a[767]);
    ফেরত;
}

শূন্য pass_large_struct2(কাঠামো large2 in)
{
    printf("%d %d %d\n", in.a[200], in.a[1023], in.a[1919]);
    ফেরত;
}

শূন্য pass_many_args(পূর্ণসংখ্যা a, পূর্ণসংখ্যা b, পূর্ণসংখ্যা c, পূর্ণসংখ্যা d, পূর্ণসংখ্যা e, পূর্ণসংখ্যা f, পূর্ণসংখ্যা g, পূর্ণসংখ্যা h, পূর্ণসংখ্যা i,
                    পূর্ণসংখ্যা j, পূর্ণসংখ্যা k, পূর্ণসংখ্যা l, পূর্ণসংখ্যা m)
{
    printf("%d %d %d %d %d %d %d %d %d %d %d %d %d\n", a, b, c, d, e, f, g, h, i,
           j, k, l, m);
    ফেরত;
}

কাঠামো large1 l1 = { .a = { [200] = 1, [767] = 2 } };
কাঠামো large2 l2 = { .a = { [200] = 3, [1023] = 4, [1919] = 5} };

পূর্ণসংখ্যা প্রধান(শূন্য)
{
    pass_large_struct1(l1);
    pass_large_struct2(l2);
    pass_many_args(13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1);

    ফেরত 0;
}
