#ਅਨ੍ਤਰ੍ਭਾਵ<stdio.h>

ਬਣਤਰ large1 {
    ਪੂਰਨ a[768];
};

ਬਣਤਰ large2 {
    ਪੂਰਨ a[1920];
};

ਖਾਲੀ pass_large_struct1(ਬਣਤਰ large1 ਵਿੱਚ)
{
    ਲਿਖੋ("%d %d\n", ਵਿੱਚ.a[200], ਵਿੱਚ.a[767]);
    ਵਾਪਸ;
}

ਖਾਲੀ pass_large_struct2(ਬਣਤਰ large2 ਵਿੱਚ)
{
    ਲਿਖੋ("%d %d %d\n", ਵਿੱਚ.a[200], ਵਿੱਚ.a[1023], ਵਿੱਚ.a[1919]);
    ਵਾਪਸ;
}

ਖਾਲੀ pass_many_ਦਲੀਲਾਂ(ਪੂਰਨ a, ਪੂਰਨ b, ਪੂਰਨ c, ਪੂਰਨ d, ਪੂਰਨ e, ਪੂਰਨ f, ਪੂਰਨ g, ਪੂਰਨ h, ਪੂਰਨ i,
                    ਪੂਰਨ j, ਪੂਰਨ k, ਪੂਰਨ l, ਪੂਰਨ m)
{
    ਲਿਖੋ("%d %d %d %d %d %d %d %d %d %d %d %d %d\n", a, b, c, d, e, f, g, h, i,
           j, k, l, m);
    ਵਾਪਸ;
}

ਬਣਤਰ large1 l1 = { .a = { [200] = 1, [767] = 2 } };
ਬਣਤਰ large2 l2 = { .a = { [200] = 3, [1023] = 4, [1919] = 5} };

ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ)
{
    pass_large_struct1(l1);
    pass_large_struct2(l2);
    pass_many_ਦਲੀਲਾਂ(13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1);

    ਵਾਪਸ 0;
}
