#അന്തര്ഭാവ<stdio.h>

ഘടന large1 {
    പൂർണ്ണസംഖ്യ a[768];
};

ഘടന large2 {
    പൂർണ്ണസംഖ്യ a[1920];
};

ശൂന്യം pass_large_struct1(ഘടന large1 in)
{
    printf("%d %d\n", in.a[200], in.a[767]);
    തിരികെ;
}

ശൂന്യം pass_large_struct2(ഘടന large2 in)
{
    printf("%d %d %d\n", in.a[200], in.a[1023], in.a[1919]);
    തിരികെ;
}

ശൂന്യം pass_many_args(പൂർണ്ണസംഖ്യ a, പൂർണ്ണസംഖ്യ b, പൂർണ്ണസംഖ്യ c, പൂർണ്ണസംഖ്യ d, പൂർണ്ണസംഖ്യ e, പൂർണ്ണസംഖ്യ f, പൂർണ്ണസംഖ്യ g, പൂർണ്ണസംഖ്യ h, പൂർണ്ണസംഖ്യ i,
                    പൂർണ്ണസംഖ്യ j, പൂർണ്ണസംഖ്യ k, പൂർണ്ണസംഖ്യ l, പൂർണ്ണസംഖ്യ m)
{
    printf("%d %d %d %d %d %d %d %d %d %d %d %d %d\n", a, b, c, d, e, f, g, h, i,
           j, k, l, m);
    തിരികെ;
}

ഘടന large1 l1 = { .a = { [200] = 1, [767] = 2 } };
ഘടന large2 l2 = { .a = { [200] = 3, [1023] = 4, [1919] = 5} };

പൂർണ്ണസംഖ്യ പ്രധാന(ശൂന്യം)
{
    pass_large_struct1(l1);
    pass_large_struct2(l2);
    pass_many_args(13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1);

    തിരികെ 0;
}
