#అన్తర్భావ<stdio.h>

నిర్మాణం large1 {
    పూర్ణాంకం a[768];
};

నిర్మాణం large2 {
    పూర్ణాంకం a[1920];
};

శూన్య pass_large_struct1(నిర్మాణం large1 లోపల)
{
    రాయి("%d %d\n", లోపల.a[200], లోపల.a[767]);
    తిరిగి;
}

శూన్య pass_large_struct2(నిర్మాణం large2 లోపల)
{
    రాయి("%d %d %d\n", లోపల.a[200], లోపల.a[1023], లోపల.a[1919]);
    తిరిగి;
}

శూన్య pass_many_వాదనలు(పూర్ణాంకం a, పూర్ణాంకం b, పూర్ణాంకం c, పూర్ణాంకం d, పూర్ణాంకం e, పూర్ణాంకం f, పూర్ణాంకం g, పూర్ణాంకం h, పూర్ణాంకం i,
                    పూర్ణాంకం j, పూర్ణాంకం k, పూర్ణాంకం l, పూర్ణాంకం m)
{
    రాయి("%d %d %d %d %d %d %d %d %d %d %d %d %d\n", a, b, c, d, e, f, g, h, i,
           j, k, l, m);
    తిరిగి;
}

నిర్మాణం large1 l1 = { .a = { [200] = 1, [767] = 2 } };
నిర్మాణం large2 l2 = { .a = { [200] = 3, [1023] = 4, [1919] = 5} };

పూర్ణాంకం ప్రధాన(శూన్య)
{
    pass_large_struct1(l1);
    pass_large_struct2(l2);
    pass_many_వాదనలు(13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1);

    తిరిగి 0;
}
