#समावेश<stdio.h>

काष्ठा large1 {
    पूर्णांक a[768];
};

काष्ठा large2 {
    पूर्णांक a[1920];
};

व्योम pass_large_struct1(काष्ठा large1 in)
{
    म_लिखो("%d %d\n", in.a[200], in.a[767]);
    वापस;
}

व्योम pass_large_struct2(काष्ठा large2 in)
{
    म_लिखो("%d %d %d\n", in.a[200], in.a[1023], in.a[1919]);
    वापस;
}

व्योम pass_many_args(पूर्णांक a, पूर्णांक b, पूर्णांक c, पूर्णांक d, पूर्णांक e, पूर्णांक f, पूर्णांक g, पूर्णांक h, पूर्णांक i,
                    पूर्णांक j, पूर्णांक k, पूर्णांक l, पूर्णांक m)
{
    म_लिखो("%d %d %d %d %d %d %d %d %d %d %d %d %d\n", a, b, c, d, e, f, g, h, i,
           j, k, l, m);
    वापस;
}

काष्ठा large1 l1 = { .a = { [200] = 1, [767] = 2 } };
काष्ठा large2 l2 = { .a = { [200] = 3, [1023] = 4, [1919] = 5} };

पूर्णांक मुख्य(व्योम)
{
    pass_large_struct1(l1);
    pass_large_struct2(l2);
    pass_many_args(13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1);

    वापस 0;
}
