#شامل<stdio.h>

ساخت large1 {
    صحیح a[768];
};

ساخت large2 {
    صحیح a[1920];
};

خالی pass_large_struct1(ساخت large1 اندر)
{
    لکھو("%d %d\n", اندر.a[200], اندر.a[767]);
    واپس;
}

خالی pass_large_struct2(ساخت large2 اندر)
{
    لکھو("%d %d %d\n", اندر.a[200], اندر.a[1023], اندر.a[1919]);
    واپس;
}

خالی pass_many_دلائل(صحیح a, صحیح b, صحیح c, صحیح d, صحیح e, صحیح f, صحیح g, صحیح h, صحیح i,
                    صحیح j, صحیح k, صحیح l, صحیح m)
{
    لکھو("%d %d %d %d %d %d %d %d %d %d %d %d %d\n", a, b, c, d, e, f, g, h, i,
           j, k, l, m);
    واپس;
}

ساخت large1 l1 = { .a = { [200] = 1, [767] = 2 } };
ساخت large2 l2 = { .a = { [200] = 3, [1023] = 4, [1919] = 5} };

صحیح مین(خالی)
{
    pass_large_struct1(l1);
    pass_large_struct2(l2);
    pass_many_دلائل(13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1);

    واپس 0;
}
