#ಅನ್ತರ್ಭಾವ<stdio.h>

ರಚನೆ large1 {
    ಪೂರ್ಣಾಂಕ a[768];
};

ರಚನೆ large2 {
    ಪೂರ್ಣಾಂಕ a[1920];
};

ಶೂನ್ಯ pass_large_struct1(ರಚನೆ large1 ಒಳ)
{
    ಬರೆ("%d %d\n", ಒಳ.a[200], ಒಳ.a[767]);
    ಹಿಂತಿರುಗಿ;
}

ಶೂನ್ಯ pass_large_struct2(ರಚನೆ large2 ಒಳ)
{
    ಬರೆ("%d %d %d\n", ಒಳ.a[200], ಒಳ.a[1023], ಒಳ.a[1919]);
    ಹಿಂತಿರುಗಿ;
}

ಶೂನ್ಯ pass_many_ವಾದಗಳು(ಪೂರ್ಣಾಂಕ a, ಪೂರ್ಣಾಂಕ b, ಪೂರ್ಣಾಂಕ c, ಪೂರ್ಣಾಂಕ d, ಪೂರ್ಣಾಂಕ e, ಪೂರ್ಣಾಂಕ f, ಪೂರ್ಣಾಂಕ g, ಪೂರ್ಣಾಂಕ h, ಪೂರ್ಣಾಂಕ i,
                    ಪೂರ್ಣಾಂಕ j, ಪೂರ್ಣಾಂಕ k, ಪೂರ್ಣಾಂಕ l, ಪೂರ್ಣಾಂಕ m)
{
    ಬರೆ("%d %d %d %d %d %d %d %d %d %d %d %d %d\n", a, b, c, d, e, f, g, h, i,
           j, k, l, m);
    ಹಿಂತಿರುಗಿ;
}

ರಚನೆ large1 l1 = { .a = { [200] = 1, [767] = 2 } };
ರಚನೆ large2 l2 = { .a = { [200] = 3, [1023] = 4, [1919] = 5} };

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ)
{
    pass_large_struct1(l1);
    pass_large_struct2(l2);
    pass_many_ವಾದಗಳು(13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1);

    ಹಿಂತಿರುಗಿ 0;
}
