#ضمن<stdio.h>

بنية large1 {
    صحيح a[768];
};

بنية large2 {
    صحيح a[1920];
};

فراغ pass_large_struct1(بنية large1 درون)
{
    چاپ_کن("%d %d\n", درون.a[200], درون.a[767]);
    أرجع;
}

فراغ pass_large_struct2(بنية large2 درون)
{
    چاپ_کن("%d %d %d\n", درون.a[200], درون.a[1023], درون.a[1919]);
    أرجع;
}

فراغ pass_many_آرگومانها(صحيح a, صحيح b, صحيح c, صحيح d, صحيح e, صحيح f, صحيح g, صحيح h, صحيح i,
                    صحيح j, صحيح k, صحيح l, صحيح m)
{
    چاپ_کن("%d %d %d %d %d %d %d %d %d %d %d %d %d\n", a, b, c, d, e, f, g, h, i,
           j, k, l, m);
    أرجع;
}

بنية large1 l1 = { .a = { [200] = 1, [767] = 2 } };
بنية large2 l2 = { .a = { [200] = 3, [1023] = 4, [1919] = 5} };

صحيح اصلی(فراغ)
{
    pass_large_struct1(l1);
    pass_large_struct2(l2);
    pass_many_آرگومانها(13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1);

    أرجع 0;
}
