#अन्तर्भाव<stdio.h>

संरचना s1 {
    अचिह्नित वर्ण a:4, b:4;
} g1 = { 0x05, 0x0a };

संरचना s2 {
    अचिह्नित वर्ण a, b;
} g2 = { 0x12, 0x34 };

संरचना s4 {
    अचिह्नित ह्रस्व a, b;
} g4 = { 0x1245, 0x5678 };

संरचना s8 {
    अचिह्नित a, b;
} g8 = { 0x12345678, 0x9abcdef0 };

/* returned in 2 registers on riscv64 */
संरचना s16 {
    अचिह्नित दीर्घ दीर्घ a, b;
} g16 = { 0x123456789abcdef0ULL, 0xfedcba9876543210ULL };

/* Homogeneous float aggregate on ARM hard-float */
संरचना s_f4 {
    द्विगुण a, b, c, d;
} g_f4 = { 1,2,3,4 };

#परिभाषय def(S) \
संरचना s##S f##S(पूर्णाङ्क x) \
{ \
    संरचना s##S l##S = g##S, *p##S = &l##S; \
    यदि (x == 0) \
        प्रत्यागम g##S; \
    अन्यथा यदि (x == 1) \
        प्रत्यागम l##S; \
    अन्यथा \
        प्रत्यागम *p##S; \
}

def(1)
def(2)
def(4)
def(8)
def(16)
def(_f4)

#परिभाषय chk(S,x) \
    संरचना s##S l##S = f##S(x); \
    प्रारूप_लिख("%02llx %02llx\n", \
        (अचिह्नित दीर्घ दीर्घ)l##S.a, \
        (अचिह्नित दीर्घ दीर्घ)l##S.b \
        );

पूर्णाङ्क मुख्यम्()
{
    प्रति (पूर्णाङ्क x = 0;;) {
        chk(1,x);
        chk(2,x);
        chk(4,x);
        chk(8,x);
        chk(16,x);
        संरचना s_f4 l_f4 = f_f4(x);
        प्रारूप_लिख("%.1f %.1f %.1f %.1f\n", l_f4.a, l_f4.b, l_f4.c, l_f4.d);
        यदि (++x > 2)
            भङ्ग;
        प्रारूप_लिख("\n");
    }
    प्रत्यागम 0;
}
