#అన్తర్భావ<stdio.h>

నిర్మాణం s1 {
    గుర్తులేని అక్షరం a:4, b:4;
} g1 = { 0x05, 0x0a };

నిర్మాణం s2 {
    గుర్తులేని అక్షరం a, b;
} g2 = { 0x12, 0x34 };

నిర్మాణం s4 {
    గుర్తులేని పొట్టి a, b;
} g4 = { 0x1245, 0x5678 };

నిర్మాణం s8 {
    గుర్తులేని a, b;
} g8 = { 0x12345678, 0x9abcdef0 };

/* returned in 2 registers on riscv64 */
నిర్మాణం s16 {
    గుర్తులేని దీర్ఘ దీర్ఘ a, b;
} g16 = { 0x123456789abcdef0ULL, 0xfedcba9876543210ULL };

/* Homogeneous float aggregate on ARM hard-float */
నిర్మాణం s_f4 {
    ద్విగుణ a, b, c, d;
} g_f4 = { 1,2,3,4 };

#నిర్వచించు def(S) \
నిర్మాణం s##S f##S(పూర్ణాంకం x) \
{ \
    నిర్మాణం s##S l##S = g##S, *p##S = &l##S; \
    ఒకవేళ (x == 0) \
        తిరిగి g##S; \
    లేకపోతే ఒకవేళ (x == 1) \
        తిరిగి l##S; \
    లేకపోతే \
        తిరిగి *p##S; \
}

def(1)
def(2)
def(4)
def(8)
def(16)
def(_f4)

#నిర్వచించు chk(S,x) \
    నిర్మాణం s##S l##S = f##S(x); \
    రాయి("%02llx %02llx\n", \
        (గుర్తులేని దీర్ఘ దీర్ఘ)l##S.a, \
        (గుర్తులేని దీర్ఘ దీర్ఘ)l##S.b \
        );

పూర్ణాంకం ప్రధాన()
{
    కొరకు (పూర్ణాంకం x = 0;;) {
        chk(1,x);
        chk(2,x);
        chk(4,x);
        chk(8,x);
        chk(16,x);
        నిర్మాణం s_f4 l_f4 = f_f4(x);
        రాయి("%.1f %.1f %.1f %.1f\n", l_f4.a, l_f4.b, l_f4.c, l_f4.d);
        ఒకవేళ (++x > 2)
            ఆపు;
        రాయి("\n");
    }
    తిరిగి 0;
}
