#ಅನ್ತರ್ಭಾವ<stdio.h>

ರಚನೆ s1 {
    ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ a:4, b:4;
} g1 = { 0x05, 0x0a };

ರಚನೆ s2 {
    ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ a, b;
} g2 = { 0x12, 0x34 };

ರಚನೆ s4 {
    ಚಿಹ್ನೆರಹಿತ ಗಿಡ್ಡ a, b;
} g4 = { 0x1245, 0x5678 };

ರಚನೆ s8 {
    ಚಿಹ್ನೆರಹಿತ a, b;
} g8 = { 0x12345678, 0x9abcdef0 };

/* returned in 2 registers on riscv64 */
ರಚನೆ s16 {
    ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ a, b;
} g16 = { 0x123456789abcdef0ULL, 0xfedcba9876543210ULL };

/* Homogeneous float aggregate on ARM hard-float */
ರಚನೆ s_f4 {
    ದ್ವಿಗುಣ a, b, c, d;
} g_f4 = { 1,2,3,4 };

#ವ್ಯಾಖ್ಯಾನಿಸು def(S) \
ರಚನೆ s##S f##S(ಪೂರ್ಣಾಂಕ x) \
{ \
    ರಚನೆ s##S l##S = g##S, *p##S = &l##S; \
    ಆದರೆ (x == 0) \
        ಹಿಂತಿರುಗಿ g##S; \
    ಇಲ್ಲದಿದ್ದರೆ ಆದರೆ (x == 1) \
        ಹಿಂತಿರುಗಿ l##S; \
    ಇಲ್ಲದಿದ್ದರೆ \
        ಹಿಂತಿರುಗಿ *p##S; \
}

def(1)
def(2)
def(4)
def(8)
def(16)
def(_f4)

#ವ್ಯಾಖ್ಯಾನಿಸು chk(S,x) \
    ರಚನೆ s##S l##S = f##S(x); \
    ಬರೆ("%02llx %02llx\n", \
        (ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ)l##S.a, \
        (ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ)l##S.b \
        );

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ x = 0;;) {
        chk(1,x);
        chk(2,x);
        chk(4,x);
        chk(8,x);
        chk(16,x);
        ರಚನೆ s_f4 l_f4 = f_f4(x);
        ಬರೆ("%.1f %.1f %.1f %.1f\n", l_f4.a, l_f4.b, l_f4.c, l_f4.d);
        ಆದರೆ (++x > 2)
            ನಿಲ್ಲಿಸು;
        ಬರೆ("\n");
    }
    ಹಿಂತಿರುಗಿ 0;
}
