#شامل<stdio.h>

ساخت s1 {
    غیرعلامتی حرف a:4, b:4;
} g1 = { 0x05, 0x0a };

ساخت s2 {
    غیرعلامتی حرف a, b;
} g2 = { 0x12, 0x34 };

ساخت s4 {
    غیرعلامتی مختصر a, b;
} g4 = { 0x1245, 0x5678 };

ساخت s8 {
    غیرعلامتی a, b;
} g8 = { 0x12345678, 0x9abcdef0 };

/* returned in 2 registers on riscv64 */
ساخت s16 {
    غیرعلامتی طویل طویل a, b;
} g16 = { 0x123456789abcdef0ULL, 0xfedcba9876543210ULL };

/* Homogeneous float aggregate on ARM hard-float */
ساخت s_f4 {
    دوہرا a, b, c, d;
} g_f4 = { 1,2,3,4 };

#تعریف_کرو def(S) \
ساخت s##S f##S(صحیح x) \
{ \
    ساخت s##S l##S = g##S, *p##S = &l##S; \
    اگر (x == 0) \
        واپس g##S; \
    ورنہ اگر (x == 1) \
        واپس l##S; \
    ورنہ \
        واپس *p##S; \
}

def(1)
def(2)
def(4)
def(8)
def(16)
def(_f4)

#تعریف_کرو chk(S,x) \
    ساخت s##S l##S = f##S(x); \
    لکھو("%02llx %02llx\n", \
        (غیرعلامتی طویل طویل)l##S.a, \
        (غیرعلامتی طویل طویل)l##S.b \
        );

صحیح مین()
{
    برائے (صحیح x = 0;;) {
        chk(1,x);
        chk(2,x);
        chk(4,x);
        chk(8,x);
        chk(16,x);
        ساخت s_f4 l_f4 = f_f4(x);
        لکھو("%.1f %.1f %.1f %.1f\n", l_f4.a, l_f4.b, l_f4.c, l_f4.d);
        اگر (++x > 2)
            توڑو;
        لکھو("\n");
    }
    واپس 0;
}
