#ਅਨ੍ਤਰ੍ਭਾਵ<stdio.h>

ਬਣਤਰ s1 {
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ a:4, b:4;
} g1 = { 0x05, 0x0a };

ਬਣਤਰ s2 {
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ a, b;
} g2 = { 0x12, 0x34 };

ਬਣਤਰ s4 {
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਛੋਟਾ a, b;
} g4 = { 0x1245, 0x5678 };

ਬਣਤਰ s8 {
    ਬਿਨਾਨਿਸ਼ਾਨੀ a, b;
} g8 = { 0x12345678, 0x9abcdef0 };

/* returned in 2 registers on riscv64 */
ਬਣਤਰ s16 {
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ ਲੰਮਾ a, b;
} g16 = { 0x123456789abcdef0ULL, 0xfedcba9876543210ULL };

/* Homogeneous float aggregate on ARM hard-float */
ਬਣਤਰ s_f4 {
    ਦੁੱਗਣਾ a, b, c, d;
} g_f4 = { 1,2,3,4 };

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ def(S) \
ਬਣਤਰ s##S f##S(ਪੂਰਨ x) \
{ \
    ਬਣਤਰ s##S l##S = g##S, *p##S = &l##S; \
    ਜੇ (x == 0) \
        ਵਾਪਸ g##S; \
    ਨਹੀਂਤਾਂ ਜੇ (x == 1) \
        ਵਾਪਸ l##S; \
    ਨਹੀਂਤਾਂ \
        ਵਾਪਸ *p##S; \
}

def(1)
def(2)
def(4)
def(8)
def(16)
def(_f4)

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ chk(S,x) \
    ਬਣਤਰ s##S l##S = f##S(x); \
    ਲਿਖੋ("%02llx %02llx\n", \
        (ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ ਲੰਮਾ)l##S.a, \
        (ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ ਲੰਮਾ)l##S.b \
        );

ਪੂਰਨ ਮੁੱਖ()
{
    ਲਈ (ਪੂਰਨ x = 0;;) {
        chk(1,x);
        chk(2,x);
        chk(4,x);
        chk(8,x);
        chk(16,x);
        ਬਣਤਰ s_f4 l_f4 = f_f4(x);
        ਲਿਖੋ("%.1f %.1f %.1f %.1f\n", l_f4.a, l_f4.b, l_f4.c, l_f4.d);
        ਜੇ (++x > 2)
            ਰੋਕੋ;
        ਲਿਖੋ("\n");
    }
    ਵਾਪਸ 0;
}
