#अन्तर्भाव <stdio.h>
#अन्तर्भाव <float.h>

संघ ieee_double_extract
{
    संरचना {
        अचिन्हित पूर्णांक manl:32;
        अचिन्हित पूर्णांक manh:20;
        अचिन्हित पूर्णांक exp:11;
        अचिन्हित पूर्णांक sig:1;
    } s;
    द्विगुण d;
};

द्विगुण scale(द्विगुण d)
{
    संघ ieee_double_extract x;

    x.d = d;
    x.d *= 1000;
    परत x.d;
}

शून्य mul(द्विगुण *p)
{
    *p *= 2.0;
}

पूर्णांक
main(शून्य)
{
    द्विगुण d = 4.0;
    म_लिखो("%g\n", scale(42));
    mul(&d);
    म_लिखो("%g\n", d);
    परत 0;
}
