#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <float.h>

ಒಕ್ಕೂಟ ieee_double_ಹೊರತೆಗೆ
{
    ರಚನೆ {
        ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ manl:32;
        ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ manh:20;
        ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ ಘಾತಾಂಕ:11;
        ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ sig:1;
    } s;
    ದ್ವಿಗುಣ d;
};

ದ್ವಿಗುಣ scale(ದ್ವಿಗುಣ d)
{
    ಒಕ್ಕೂಟ ieee_double_ಹೊರತೆಗೆ x;

    x.d = d;
    x.d *= 1000;
    ಹಿಂತಿರುಗಿ x.d;
}

ಶೂನ್ಯ mul(ದ್ವಿಗುಣ *p)
{
    *p *= 2.0;
}

ಪೂರ್ಣಾಂಕ
ಮುಖ್ಯ(ಶೂನ್ಯ)
{
    ದ್ವಿಗುಣ d = 4.0;
    ಬರೆ("%g\n", scale(42));
    mul(&d);
    ಬರೆ("%g\n", d);
    ಹಿಂತಿರುಗಿ 0;
}
