#समावेश <stdio.h>
#समावेश <float.h>

जोड़ ieee_double_extract
{
    काष्ठा {
        अचिन्हित पूर्णांक manl:32;
        अचिन्हित पूर्णांक manh:20;
        अचिन्हित पूर्णांक exp:11;
        अचिन्हित पूर्णांक sig:1;
    } s;
    द्विगुन d;
};

द्विगुन scale(द्विगुन d)
{
    जोड़ ieee_double_extract x;

    x.d = d;
    x.d *= 1000;
    वापस x.d;
}

व्योम mul(द्विगुन *p)
{
    *p *= 2.0;
}

पूर्णांक
मुख्य(व्योम)
{
    द्विगुन d = 4.0;
    म_लिखो("%g\n", scale(42));
    mul(&d);
    म_लिखो("%g\n", d);
    वापस 0;
}
