#అన్తర్భావ <stdio.h>
#అన్తర్భావ <float.h>

సంఘం ieee_double_వెలికితీయి
{
    నిర్మాణం {
        గుర్తులేని పూర్ణాంకం manl:32;
        గుర్తులేని పూర్ణాంకం manh:20;
        గుర్తులేని పూర్ణాంకం ఘాతాంకం:11;
        గుర్తులేని పూర్ణాంకం sig:1;
    } s;
    ద్విగుణ d;
};

ద్విగుణ scale(ద్విగుణ d)
{
    సంఘం ieee_double_వెలికితీయి x;

    x.d = d;
    x.d *= 1000;
    తిరిగి x.d;
}

శూన్య mul(ద్విగుణ *p)
{
    *p *= 2.0;
}

పూర్ణాంకం
ప్రధాన(శూన్య)
{
    ద్విగుణ d = 4.0;
    రాయి("%g\n", scale(42));
    mul(&d);
    రాయి("%g\n", d);
    తిరిగి 0;
}
