पूर्णाङ्क प्रारूप_लिख(ध्रुव वर्ण *s, ...);

भिन्न fx(x)
भिन्न x;
{
    प्रत्यागम 2.0 * x;
}

शून्य func(भिन्न a);

शून्य func3(संरचना p { पूर्णाङ्क a; पूर्णाङ्क b; } *q) {
}

शून्य func4(q)
 संरचना p { पूर्णाङ्क a; पूर्णाङ्क b; पूर्णाङ्क c; } *q;
{
}

संरचना p { पूर्णाङ्क a; पूर्णाङ्क b; पूर्णाङ्क c; पूर्णाङ्क d; };

पूर्णाङ्क
मुख्यम्(शून्य)
{
    भिन्न fy();

    प्रारूप_लिख("%g %g\n", fx(2.0), fy(10.0));
    प्रारूप_लिख("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

भिन्न fy(x)
भिन्न x;
{
    प्रत्यागम 3.0 * x;
}

शून्य func(a)
भिन्न a;
{
    प्रारूप_लिख("%g\n", a);
}
