পূর্ণসংখ্যা printf(ধ্রুবক অক্ষর *s, ...);

দশমিক fx(x)
দশমিক x;
{
    ফেরত 2.0 * x;
}

শূন্য func(দশমিক a);

শূন্য func3(কাঠামো p { পূর্ণসংখ্যা a; পূর্ণসংখ্যা b; } *q) {
}

শূন্য func4(q)
 কাঠামো p { পূর্ণসংখ্যা a; পূর্ণসংখ্যা b; পূর্ণসংখ্যা c; } *q;
{
}

কাঠামো p { পূর্ণসংখ্যা a; পূর্ণসংখ্যা b; পূর্ণসংখ্যা c; পূর্ণসংখ্যা d; };

পূর্ণসংখ্যা
প্রধান(শূন্য)
{
    দশমিক fy();

    printf("%g %g\n", fx(2.0), fy(10.0));
    printf("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

দশমিক fy(x)
দশমিক x;
{
    ফেরত 3.0 * x;
}

শূন্য func(a)
দশমিক a;
{
    printf("%g\n", a);
}
