ପୂର୍ଣ୍ଣସଂଖ୍ୟା printf(ଅଚଳ ଅକ୍ଷର *s, ...);

ଦଶମିକ fx(x)
ଦଶମିକ x;
{
    ଫେରନ୍ତୁ 2.0 * x;
}

ଶୂନ୍ୟ func(ଦଶମିକ a);

ଶୂନ୍ୟ func3(ସଂରଚନା p { ପୂର୍ଣ୍ଣସଂଖ୍ୟା a; ପୂର୍ଣ୍ଣସଂଖ୍ୟା b; } *q) {
}

ଶୂନ୍ୟ func4(q)
 ସଂରଚନା p { ପୂର୍ଣ୍ଣସଂଖ୍ୟା a; ପୂର୍ଣ୍ଣସଂଖ୍ୟା b; ପୂର୍ଣ୍ଣସଂଖ୍ୟା c; } *q;
{
}

ସଂରଚନା p { ପୂର୍ଣ୍ଣସଂଖ୍ୟା a; ପୂର୍ଣ୍ଣସଂଖ୍ୟା b; ପୂର୍ଣ୍ଣସଂଖ୍ୟା c; ପୂର୍ଣ୍ଣସଂଖ୍ୟା d; };

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
ମୁଖ୍ୟ(ଶୂନ୍ୟ)
{
    ଦଶମିକ fy();

    printf("%g %g\n", fx(2.0), fy(10.0));
    printf("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

ଦଶମିକ fy(x)
ଦଶମିକ x;
{
    ଫେରନ୍ତୁ 3.0 * x;
}

ଶୂନ୍ୟ func(a)
ଦଶମିକ a;
{
    printf("%g\n", a);
}
