పూర్ణాంకం రాయి(స్థిరరాశి అక్షరం *s, ...);

దశాంశం fx(x)
దశాంశం x;
{
    తిరిగి 2.0 * x;
}

శూన్య func(దశాంశం a);

శూన్య func3(నిర్మాణం p { పూర్ణాంకం a; పూర్ణాంకం b; } *q) {
}

శూన్య func4(q)
 నిర్మాణం p { పూర్ణాంకం a; పూర్ణాంకం b; పూర్ణాంకం c; } *q;
{
}

నిర్మాణం p { పూర్ణాంకం a; పూర్ణాంకం b; పూర్ణాంకం c; పూర్ణాంకం d; };

పూర్ణాంకం
ప్రధాన(శూన్య)
{
    దశాంశం fy();

    రాయి("%g %g\n", fx(2.0), fy(10.0));
    రాయి("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

దశాంశం fy(x)
దశాంశం x;
{
    తిరిగి 3.0 * x;
}

శూన్య func(a)
దశాంశం a;
{
    రాయి("%g\n", a);
}
