પૂર્ણાંક printf(અચલ અક્ષર *s, ...);

દશાંશ fx(x)
દશાંશ x;
{
    પાછા 2.0 * x;
}

શૂન્ય func(દશાંશ a);

શૂન્ય func3(સંરચના p { પૂર્ણાંક a; પૂર્ણાંક b; } *q) {
}

શૂન્ય func4(q)
 સંરચના p { પૂર્ણાંક a; પૂર્ણાંક b; પૂર્ણાંક c; } *q;
{
}

સંરચના p { પૂર્ણાંક a; પૂર્ણાંક b; પૂર્ણાંક c; પૂર્ણાંક d; };

પૂર્ણાંક
મુખ્ય(શૂન્ય)
{
    દશાંશ fy();

    printf("%g %g\n", fx(2.0), fy(10.0));
    printf("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

દશાંશ fy(x)
દશાંશ x;
{
    પાછા 3.0 * x;
}

શૂન્ય func(a)
દશાંશ a;
{
    printf("%g\n", a);
}
