ಪೂರ್ಣಾಂಕ ಬರೆ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ...);

ದಶಮಾಂಶ fx(x)
ದಶಮಾಂಶ x;
{
    ಹಿಂತಿರುಗಿ 2.0 * x;
}

ಶೂನ್ಯ func(ದಶಮಾಂಶ a);

ಶೂನ್ಯ func3(ರಚನೆ p { ಪೂರ್ಣಾಂಕ a; ಪೂರ್ಣಾಂಕ b; } *q) {
}

ಶೂನ್ಯ func4(q)
 ರಚನೆ p { ಪೂರ್ಣಾಂಕ a; ಪೂರ್ಣಾಂಕ b; ಪೂರ್ಣಾಂಕ c; } *q;
{
}

ರಚನೆ p { ಪೂರ್ಣಾಂಕ a; ಪೂರ್ಣಾಂಕ b; ಪೂರ್ಣಾಂಕ c; ಪೂರ್ಣಾಂಕ d; };

ಪೂರ್ಣಾಂಕ
ಮುಖ್ಯ(ಶೂನ್ಯ)
{
    ದಶಮಾಂಶ fy();

    ಬರೆ("%g %g\n", fx(2.0), fy(10.0));
    ಬರೆ("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

ದಶಮಾಂಶ fy(x)
ದಶಮಾಂಶ x;
{
    ಹಿಂತಿರುಗಿ 3.0 * x;
}

ಶೂನ್ಯ func(a)
ದಶಮಾಂಶ a;
{
    ಬರೆ("%g\n", a);
}
