पूर्णांक म_लिखो(स्थिर अक्षर *s, ...);

भग्न fx(x)
भग्न x;
{
    वापस 2.0 * x;
}

व्योम func(भग्न a);

व्योम func3(काष्ठा p { पूर्णांक a; पूर्णांक b; } *q) {
}

व्योम func4(q)
 काष्ठा p { पूर्णांक a; पूर्णांक b; पूर्णांक c; } *q;
{
}

काष्ठा p { पूर्णांक a; पूर्णांक b; पूर्णांक c; पूर्णांक d; };

पूर्णांक
मुख्य(व्योम)
{
    भग्न fy();

    म_लिखो("%g %g\n", fx(2.0), fy(10.0));
    म_लिखो("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

भग्न fy(x)
भग्न x;
{
    वापस 3.0 * x;
}

व्योम func(a)
भग्न a;
{
    म_लिखो("%g\n", a);
}
