পূর্ণাঙ্ক printf(ধ্রুব বর্ণ *s, ...);

ভিন্ন fx(x)
ভিন্ন x;
{
    প্রত্যাগম 2.0 * x;
}

শূন্য func(ভিন্ন a);

শূন্য func3(সংরচনা p { পূর্ণাঙ্ক a; পূর্ণাঙ্ক b; } *q) {
}

শূন্য func4(q)
 সংরচনা p { পূর্ণাঙ্ক a; পূর্ণাঙ্ক b; পূর্ণাঙ্ক c; } *q;
{
}

সংরচনা p { পূর্ণাঙ্ক a; পূর্ণাঙ্ক b; পূর্ণাঙ্ক c; পূর্ণাঙ্ক d; };

পূর্ণাঙ্ক
main(শূন্য)
{
    ভিন্ন fy();

    printf("%g %g\n", fx(2.0), fy(10.0));
    printf("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

ভিন্ন fy(x)
ভিন্ন x;
{
    প্রত্যাগম 3.0 * x;
}

শূন্য func(a)
ভিন্ন a;
{
    printf("%g\n", a);
}
