முழு printf(மாறிலி எழுத்து *s, ...);

தசம fx(x)
தசம x;
{
    திரும்பு 2.0 * x;
}

வெறுமை func(தசம a);

வெறுமை func3(கட்டமைப்பு p { முழு a; முழு b; } *q) {
}

வெறுமை func4(q)
 கட்டமைப்பு p { முழு a; முழு b; முழு c; } *q;
{
}

கட்டமைப்பு p { முழு a; முழு b; முழு c; முழு d; };

முழு
முதன்மை(வெறுமை)
{
    தசம fy();

    printf("%g %g\n", fx(2.0), fy(10.0));
    printf("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

தசம fy(x)
தசம x;
{
    திரும்பு 3.0 * x;
}

வெறுமை func(a)
தசம a;
{
    printf("%g\n", a);
}
