പൂർണ്ണസംഖ്യ printf(സ്ഥിരം അക്ഷരം *s, ...);

ദശാംശം fx(x)
ദശാംശം x;
{
    തിരികെ 2.0 * x;
}

ശൂന്യം func(ദശാംശം a);

ശൂന്യം func3(ഘടന p { പൂർണ്ണസംഖ്യ a; പൂർണ്ണസംഖ്യ b; } *q) {
}

ശൂന്യം func4(q)
 ഘടന p { പൂർണ്ണസംഖ്യ a; പൂർണ്ണസംഖ്യ b; പൂർണ്ണസംഖ്യ c; } *q;
{
}

ഘടന p { പൂർണ്ണസംഖ്യ a; പൂർണ്ണസംഖ്യ b; പൂർണ്ണസംഖ്യ c; പൂർണ്ണസംഖ്യ d; };

പൂർണ്ണസംഖ്യ
പ്രധാന(ശൂന്യം)
{
    ദശാംശം fy();

    printf("%g %g\n", fx(2.0), fy(10.0));
    printf("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

ദശാംശം fy(x)
ദശാംശം x;
{
    തിരികെ 3.0 * x;
}

ശൂന്യം func(a)
ദശാംശം a;
{
    printf("%g\n", a);
}
