ಪೂರ್ಣಾಙ್ಕ printf(ಧ್ರುವ ವರ್ಣ *s, ...);

ಭಿನ್ನ fx(x)
ಭಿನ್ನ x;
{
    ಪ್ರತ್ಯಾಗಮ 2.0 * x;
}

ಶೂನ್ಯ func(ಭಿನ್ನ a);

ಶೂನ್ಯ func3(ಸಂರಚನಾ p { ಪೂರ್ಣಾಙ್ಕ a; ಪೂರ್ಣಾಙ್ಕ b; } *q) {
}

ಶೂನ್ಯ func4(q)
 ಸಂರಚನಾ p { ಪೂರ್ಣಾಙ್ಕ a; ಪೂರ್ಣಾಙ್ಕ b; ಪೂರ್ಣಾಙ್ಕ c; } *q;
{
}

ಸಂರಚನಾ p { ಪೂರ್ಣಾಙ್ಕ a; ಪೂರ್ಣಾಙ್ಕ b; ಪೂರ್ಣಾಙ್ಕ c; ಪೂರ್ಣಾಙ್ಕ d; };

ಪೂರ್ಣಾಙ್ಕ
main(ಶೂನ್ಯ)
{
    ಭಿನ್ನ fy();

    printf("%g %g\n", fx(2.0), fy(10.0));
    printf("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

ಭಿನ್ನ fy(x)
ಭಿನ್ನ x;
{
    ಪ್ರತ್ಯಾಗಮ 3.0 * x;
}

ಶೂನ್ಯ func(a)
ಭಿನ್ನ a;
{
    printf("%g\n", a);
}
