पूर्णांक म_लिखो(स्थिरांक अक्षर *s, ...);

दशांश fx(x)
दशांश x;
{
    परत 2.0 * x;
}

शून्य func(दशांश a);

शून्य func3(संरचना p { पूर्णांक a; पूर्णांक b; } *q) {
}

शून्य func4(q)
 संरचना p { पूर्णांक a; पूर्णांक b; पूर्णांक c; } *q;
{
}

संरचना p { पूर्णांक a; पूर्णांक b; पूर्णांक c; पूर्णांक d; };

पूर्णांक
main(शून्य)
{
    दशांश fy();

    म_लिखो("%g %g\n", fx(2.0), fy(10.0));
    म_लिखो("%g %g\n", fx(2.0f), fy(10.0f));
    func(1);
}

दशांश fy(x)
दशांश x;
{
    परत 3.0 * x;
}

शून्य func(a)
दशांश a;
{
    म_लिखो("%g\n", a);
}
