ਪੂਰਨ ਲਿਖੋ(ਅਚਲ ਅੱਖਰ *, ...);

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ ਪ੍ਰਤਿਜ੍ਞਾ(x) ((x) \
    ? (ਲਿਖੋ(" 1 (%s)\n",#x),1) \
    : (ਲਿਖੋ("%s:%d: error: (%s)\n",__FILE__,__LINE__,#x),0))

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ O 100
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ SO 200

/* ------------------------------------------------------ */
#ਜੇ TEST-O == 1
ਬਾਹਰੀ ਅੱਖਰ etext[], _etext[];
ਬਾਹਰੀ ਅੱਖਰ edata[], _edata[];
ਬਾਹਰੀ ਅੱਖਰ ਸਿਰਾ[], ਸਿਰਾ_3[];
ਪੂਰਨ check_linker_symbols(ਖਾਲੀ)
{
    ਪੂਰਨ errors = 0;
    errors += !ਪ੍ਰਤਿਜ੍ਞਾ(etext == _etext);
    errors += !ਪ੍ਰਤਿਜ੍ਞਾ(edata == _edata);
    errors += !ਪ੍ਰਤਿਜ੍ਞਾ(ਸਿਰਾ == ਸਿਰਾ_3);
    ਵਾਪਸ errors;
}

#ਜਾਂਜੇ TEST-MAIN == 1
ਪੂਰਨ check_linker_symbols(ਖਾਲੀ);
ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ)
{
    ਲਿਖੋ("linker symbols test\n");
    ਪ੍ਰਤਿਜ੍ਞਾ(check_linker_symbols() == 0);
}

/* ------------------------------------------------------ */
#ਜਾਂਜੇ TEST-SO == 2
ਬਾਹਰੀ ਅੱਖਰ etext[], edata[], ਸਿਰਾ[];
ਖਾਲੀ get_dso_ਸਿਰਾ(ਅੱਖਰ **p)
{
    p[0] = etext;
    p[1] = edata;
    p[2] = ਸਿਰਾ;
}

#ਜਾਂਜੇ TEST-MAIN == 2
ਬਾਹਰੀ ਅੱਖਰ _etext[], _edata[], ਸਿਰਾ_3[];
ਬਾਹਰੀ ਖਾਲੀ get_dso_ਸਿਰਾ(ਅੱਖਰ **);
ਸਥਿਰ ਪੂਰਨ fill_ਅੰਕੜੇ = 123;
ਸਥਿਰ ਪੂਰਨ fill_bss;

ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ)
{
    ਅੱਖਰ *p[3];
    ਲਿਖੋ("DSO linker symbols test\n");
    get_dso_ਸਿਰਾ(p);
    ਪ੍ਰਤਿਜ੍ਞਾ(p[0] == _etext) || ਲਿਖੋ("-- %p %p\n", p[0], _etext);
    ਪ੍ਰਤਿਜ੍ਞਾ(p[1] == _edata) || ਲਿਖੋ("-- %p %p\n", p[1], _edata);
    ਪ੍ਰਤਿਜ੍ਞਾ(p[2] == ਸਿਰਾ_3)   || ਲਿਖੋ("-- %p %p\n", p[2], ਸਿਰਾ_3);
}

/* ------------------------------------------------------ */
#ਜਾਂਜੇ TEST-MAIN == 3

ਪੂਰਨ etext(ਖਾਲੀ) { ਵਾਪਸ 1; }
ਪੂਰਨ edata(ਖਾਲੀ) { ਵਾਪਸ 2; }
ਪੂਰਨ ਸਿਰਾ(ਖਾਲੀ) { ਵਾਪਸ 3; }
ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ)
{
    ਲਿਖੋ("user definition test\n");
    ਪ੍ਰਤਿਜ੍ਞਾ(etext() + edata() + ਸਿਰਾ() == 6);
}

/* ------------------------------------------------------ */
#ਜਾਂਜੇ TEST-SO == 4
ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ copy_reloc_ਅੰਕੜੇ[257];

#ਜਾਂਜੇ TEST-MAIN == 4
ਬਾਹਰੀ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ copy_reloc_ਅੰਕੜੇ[257];
ਬਾਹਰੀ ਅੱਖਰ ਸਿਰਾ[], ਸਿਰਾ_3[];

ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ)
{
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ ਅੰਕੜੇ_ਸਿਰਾ;
    ਲਿਖੋ("end copy relocation test\n");
    copy_reloc_ਅੰਕੜੇ[256] = 42;
    ਅੰਕੜੇ_ਸਿਰਾ = (ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ)(copy_reloc_ਅੰਕੜੇ + ਆਕਾਰ copy_reloc_ਅੰਕੜੇ);
    ਪ੍ਰਤਿਜ੍ਞਾ(ਸਿਰਾ == ਸਿਰਾ_3);
    ਪ੍ਰਤਿਜ੍ਞਾ((ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ)ਸਿਰਾ >= ਅੰਕੜੇ_ਸਿਰਾ);
    ਪ੍ਰਤਿਜ੍ਞਾ(copy_reloc_ਅੰਕੜੇ[256] == 42);
}

/* ------------------------------------------------------ */
#ਜਾਂਜੇ TEST-O == 5
ਖਾਲੀ __attribute__((section(".text.linker_test"), noinline, ਵਰਤਿਆ))
linker_test_ਪਾਠ(ਖਾਲੀ)
{
}
__attribute__((section(".bss.linker_test"), ਵਰਤਿਆ))
ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ linker_test_bss[257];

__attribute__((section(".data.linker_test"), ਵਰਤਿਆ))
ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ linker_test_ਅੰਕੜੇ[23] = { 1 };

#ਜਾਂਜੇ TEST-MAIN == 5
ਬਾਹਰੀ ਖਾਲੀ linker_test_ਪਾਠ(ਖਾਲੀ);
ਬਾਹਰੀ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ linker_test_ਅੰਕੜੇ[23];
ਬਾਹਰੀ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ linker_test_bss[257];
ਬਾਹਰੀ ਅੱਖਰ etext[], _etext[];
ਬਾਹਰੀ ਅੱਖਰ edata[], _edata[];
ਬਾਹਰੀ ਅੱਖਰ ਸਿਰਾ[], ਸਿਰਾ_3[];

ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ)
{
    ਅੱਖਰ* ਪਾਠ_addr = (ਖਾਲੀ*)linker_test_ਪਾਠ;
    ਅੱਖਰ* ਅੰਕੜੇ_ਸਿਰਾ = linker_test_ਅੰਕੜੇ + ਆਕਾਰ linker_test_ਅੰਕੜੇ;
    ਅੱਖਰ* bss_ਸਿਰਾ = linker_test_bss + ਆਕਾਰ linker_test_bss;

    ਲਿਖੋ("linker boundary test\n");
    linker_test_ਅੰਕੜੇ[22] = 42;
    linker_test_bss[256] = 42;
    ਪ੍ਰਤਿਜ੍ਞਾ(linker_test_bss > linker_test_ਅੰਕੜੇ);
    ਪ੍ਰਤਿਜ੍ਞਾ(etext == _etext);
    ਪ੍ਰਤਿਜ੍ਞਾ(edata == _edata);
    ਪ੍ਰਤਿਜ੍ਞਾ(ਸਿਰਾ == ਸਿਰਾ_3);
    ਪ੍ਰਤਿਜ੍ਞਾ(etext >= ਪਾਠ_addr);
    ਪ੍ਰਤਿਜ੍ਞਾ(edata >= ਅੰਕੜੇ_ਸਿਰਾ);
    ਪ੍ਰਤਿਜ੍ਞਾ(ਸਿਰਾ >= bss_ਸਿਰਾ);
    ਪ੍ਰਤਿਜ੍ਞਾ(linker_test_ਅੰਕੜੇ[22] == 42);
    ਪ੍ਰਤਿਜ੍ਞਾ(linker_test_bss[256] == 42);
}

/* ------------------------------------------------------ */
#ਜਾਂਜੇ TEST-SO == 6
ਪੂਰਨ ਸਿਰਾ;
ਪੂਰਨ eight = 8;
ਪੂਰਨ nine;
ਪੂਰਨ dso_ਜੋੜੋ() { ਵਾਪਸ ਸਿਰਾ + eight + nine; }

#ਜਾਂਜੇ TEST-MAIN == 6
ਪੂਰਨ ਸਿਰਾ = 7;
ਪੂਰਨ eight;
ਪੂਰਨ nine = 9;
ਪੂਰਨ dso_ਜੋੜੋ();
ਪੂਰਨ ਮੁੱਖ()
{
    ਪੂਰਨ ਜੋੜ;
    ਲਿਖੋ("DSO initialized data test\n");
    ਜੋੜ = dso_ਜੋੜੋ();
    ਪ੍ਰਤਿਜ੍ਞਾ(ਸਿਰਾ == 7);
    ਪ੍ਰਤਿਜ੍ਞਾ(eight == 8);
    ਪ੍ਰਤਿਜ੍ਞਾ(nine == 9);
    ਪ੍ਰਤਿਜ੍ਞਾ(ਜੋੜ == 24) || ਲਿਖੋ("-- %d + %d + %d = %d\n", ਸਿਰਾ, eight, nine, ਜੋੜ);
}

/* ------------------------------------------------------ */
#ਜੇ_ਅੰਤ
