صحيح لکو(ثابت حرف *, ...);

#وصف_ڪريو أكد(x) ((x) \
    ? (لکو(" 1 (%s)\n",#x),1) \
    : (لکو("%s:%d: error: (%s)\n",__FILE__,__LINE__,#x),0))

#وصف_ڪريو O 100
#وصف_ڪريو SO 200

/* ------------------------------------------------------ */
#إذا TEST-O == 1
خارجي حرف etext[], _etext[];
خارجي حرف edata[], _edata[];
خارجي حرف پڇاڙي[], پڇاڙي_3[];
صحيح check_linker_symbols(فراغ)
{
    صحيح errors = 0;
    errors += !أكد(etext == _etext);
    errors += !أكد(edata == _edata);
    errors += !أكد(پڇاڙي == پڇاڙي_3);
    أرجع errors;
}

#وإلاإذا TEST-MAIN == 1
صحيح check_linker_symbols(فراغ);
صحيح مکيه(فراغ)
{
    لکو("linker symbols test\n");
    أكد(check_linker_symbols() == 0);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 2
خارجي حرف etext[], edata[], پڇاڙي[];
فراغ get_dso_پڇاڙي(حرف **p)
{
    p[0] = etext;
    p[1] = edata;
    p[2] = پڇاڙي;
}

#وإلاإذا TEST-MAIN == 2
خارجي حرف _etext[], _edata[], پڇاڙي_3[];
خارجي فراغ get_dso_پڇاڙي(حرف **);
ساكن صحيح fill_معلومات = 123;
ساكن صحيح fill_bss;

صحيح مکيه(فراغ)
{
    حرف *p[3];
    لکو("DSO linker symbols test\n");
    get_dso_پڇاڙي(p);
    أكد(p[0] == _etext) || لکو("-- %p %p\n", p[0], _etext);
    أكد(p[1] == _edata) || لکو("-- %p %p\n", p[1], _edata);
    أكد(p[2] == پڇاڙي_3)   || لکو("-- %p %p\n", p[2], پڇاڙي_3);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-MAIN == 3

صحيح etext(فراغ) { أرجع 1; }
صحيح edata(فراغ) { أرجع 2; }
صحيح پڇاڙي(فراغ) { أرجع 3; }
صحيح مکيه(فراغ)
{
    لکو("user definition test\n");
    أكد(etext() + edata() + پڇاڙي() == 6);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 4
بنانشان حرف copy_reloc_معلومات[257];

#وإلاإذا TEST-MAIN == 4
خارجي بنانشان حرف copy_reloc_معلومات[257];
خارجي حرف پڇاڙي[], پڇاڙي_3[];

صحيح مکيه(فراغ)
{
    بنانشان ڊگهو معلومات_پڇاڙي;
    لکو("end copy relocation test\n");
    copy_reloc_معلومات[256] = 42;
    معلومات_پڇاڙي = (بنانشان ڊگهو)(copy_reloc_معلومات + حجم copy_reloc_معلومات);
    أكد(پڇاڙي == پڇاڙي_3);
    أكد((بنانشان ڊگهو)پڇاڙي >= معلومات_پڇاڙي);
    أكد(copy_reloc_معلومات[256] == 42);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-O == 5
فراغ __attribute__((section(".text.linker_test"), noinline, استعمال_ٿيل))
linker_test_متن(فراغ)
{
}
__attribute__((section(".bss.linker_test"), استعمال_ٿيل))
بنانشان حرف linker_test_bss[257];

__attribute__((section(".data.linker_test"), استعمال_ٿيل))
بنانشان حرف linker_test_معلومات[23] = { 1 };

#وإلاإذا TEST-MAIN == 5
خارجي فراغ linker_test_متن(فراغ);
خارجي بنانشان حرف linker_test_معلومات[23];
خارجي بنانشان حرف linker_test_bss[257];
خارجي حرف etext[], _etext[];
خارجي حرف edata[], _edata[];
خارجي حرف پڇاڙي[], پڇاڙي_3[];

صحيح مکيه(فراغ)
{
    حرف* متن_addr = (فراغ*)linker_test_متن;
    حرف* معلومات_پڇاڙي = linker_test_معلومات + حجم linker_test_معلومات;
    حرف* bss_پڇاڙي = linker_test_bss + حجم linker_test_bss;

    لکو("linker boundary test\n");
    linker_test_معلومات[22] = 42;
    linker_test_bss[256] = 42;
    أكد(linker_test_bss > linker_test_معلومات);
    أكد(etext == _etext);
    أكد(edata == _edata);
    أكد(پڇاڙي == پڇاڙي_3);
    أكد(etext >= متن_addr);
    أكد(edata >= معلومات_پڇاڙي);
    أكد(پڇاڙي >= bss_پڇاڙي);
    أكد(linker_test_معلومات[22] == 42);
    أكد(linker_test_bss[256] == 42);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 6
صحيح پڇاڙي;
صحيح eight = 8;
صحيح nine;
صحيح dso_جوڙيو() { أرجع پڇاڙي + eight + nine; }

#وإلاإذا TEST-MAIN == 6
صحيح پڇاڙي = 7;
صحيح eight;
صحيح nine = 9;
صحيح dso_جوڙيو();
صحيح مکيه()
{
    صحيح جوڙ;
    لکو("DSO initialized data test\n");
    جوڙ = dso_جوڙيو();
    أكد(پڇاڙي == 7);
    أكد(eight == 8);
    أكد(nine == 9);
    أكد(جوڙ == 24) || لکو("-- %d + %d + %d = %d\n", پڇاڙي, eight, nine, جوڙ);
}

/* ------------------------------------------------------ */
#جيڪڏهن_پورو
