पूर्णाङ्क प्रारूप_लिख(ध्रुव वर्ण *, ...);

#परिभाषय प्रतिज्ञा(x) ((x) \
    ? (प्रारूप_लिख(" 1 (%s)\n",#x),1) \
    : (प्रारूप_लिख("%s:%d: error: (%s)\n",__FILE__,__LINE__,#x),0))

#परिभाषय O 100
#परिभाषय SO 200

/* ------------------------------------------------------ */
#यदि TEST-O == 1
बाह्य वर्ण etext[], _etext[];
बाह्य वर्ण edata[], _edata[];
बाह्य वर्ण अन्तः[], अन्तः_3[];
पूर्णाङ्क check_linker_symbols(शून्य)
{
    पूर्णाङ्क errors = 0;
    errors += !प्रतिज्ञा(etext == _etext);
    errors += !प्रतिज्ञा(edata == _edata);
    errors += !प्रतिज्ञा(अन्तः == अन्तः_3);
    प्रत्यागम errors;
}

#नोचेद्यदि TEST-MAIN == 1
पूर्णाङ्क check_linker_symbols(शून्य);
पूर्णाङ्क मुख्यम्(शून्य)
{
    प्रारूप_लिख("linker symbols test\n");
    प्रतिज्ञा(check_linker_symbols() == 0);
}

/* ------------------------------------------------------ */
#नोचेद्यदि TEST-SO == 2
बाह्य वर्ण etext[], edata[], अन्तः[];
शून्य get_dso_अन्तः(वर्ण **p)
{
    p[0] = etext;
    p[1] = edata;
    p[2] = अन्तः;
}

#नोचेद्यदि TEST-MAIN == 2
बाह्य वर्ण _etext[], _edata[], अन्तः_3[];
बाह्य शून्य get_dso_अन्तः(वर्ण **);
स्थिर पूर्णाङ्क fill_दत्त = 123;
स्थिर पूर्णाङ्क fill_bss;

पूर्णाङ्क मुख्यम्(शून्य)
{
    वर्ण *p[3];
    प्रारूप_लिख("DSO linker symbols test\n");
    get_dso_अन्तः(p);
    प्रतिज्ञा(p[0] == _etext) || प्रारूप_लिख("-- %p %p\n", p[0], _etext);
    प्रतिज्ञा(p[1] == _edata) || प्रारूप_लिख("-- %p %p\n", p[1], _edata);
    प्रतिज्ञा(p[2] == अन्तः_3)   || प्रारूप_लिख("-- %p %p\n", p[2], अन्तः_3);
}

/* ------------------------------------------------------ */
#नोचेद्यदि TEST-MAIN == 3

पूर्णाङ्क etext(शून्य) { प्रत्यागम 1; }
पूर्णाङ्क edata(शून्य) { प्रत्यागम 2; }
पूर्णाङ्क अन्तः(शून्य) { प्रत्यागम 3; }
पूर्णाङ्क मुख्यम्(शून्य)
{
    प्रारूप_लिख("user definition test\n");
    प्रतिज्ञा(etext() + edata() + अन्तः() == 6);
}

/* ------------------------------------------------------ */
#नोचेद्यदि TEST-SO == 4
अचिह्नित वर्ण copy_reloc_दत्त[257];

#नोचेद्यदि TEST-MAIN == 4
बाह्य अचिह्नित वर्ण copy_reloc_दत्त[257];
बाह्य वर्ण अन्तः[], अन्तः_3[];

पूर्णाङ्क मुख्यम्(शून्य)
{
    अचिह्नित दीर्घ दत्त_अन्तः;
    प्रारूप_लिख("end copy relocation test\n");
    copy_reloc_दत्त[256] = 42;
    दत्त_अन्तः = (अचिह्नित दीर्घ)(copy_reloc_दत्त + परिमाण copy_reloc_दत्त);
    प्रतिज्ञा(अन्तः == अन्तः_3);
    प्रतिज्ञा((अचिह्नित दीर्घ)अन्तः >= दत्त_अन्तः);
    प्रतिज्ञा(copy_reloc_दत्त[256] == 42);
}

/* ------------------------------------------------------ */
#नोचेद्यदि TEST-O == 5
शून्य __attribute__((section(".text.linker_test"), noinline, प्रयुक्तम्))
linker_test_text(शून्य)
{
}
__attribute__((section(".bss.linker_test"), प्रयुक्तम्))
अचिह्नित वर्ण linker_test_bss[257];

__attribute__((section(".data.linker_test"), प्रयुक्तम्))
अचिह्नित वर्ण linker_test_दत्त[23] = { 1 };

#नोचेद्यदि TEST-MAIN == 5
बाह्य शून्य linker_test_text(शून्य);
बाह्य अचिह्नित वर्ण linker_test_दत्त[23];
बाह्य अचिह्नित वर्ण linker_test_bss[257];
बाह्य वर्ण etext[], _etext[];
बाह्य वर्ण edata[], _edata[];
बाह्य वर्ण अन्तः[], अन्तः_3[];

पूर्णाङ्क मुख्यम्(शून्य)
{
    वर्ण* text_addr = (शून्य*)linker_test_text;
    वर्ण* दत्त_अन्तः = linker_test_दत्त + परिमाण linker_test_दत्त;
    वर्ण* bss_अन्तः = linker_test_bss + परिमाण linker_test_bss;

    प्रारूप_लिख("linker boundary test\n");
    linker_test_दत्त[22] = 42;
    linker_test_bss[256] = 42;
    प्रतिज्ञा(linker_test_bss > linker_test_दत्त);
    प्रतिज्ञा(etext == _etext);
    प्रतिज्ञा(edata == _edata);
    प्रतिज्ञा(अन्तः == अन्तः_3);
    प्रतिज्ञा(etext >= text_addr);
    प्रतिज्ञा(edata >= दत्त_अन्तः);
    प्रतिज्ञा(अन्तः >= bss_अन्तः);
    प्रतिज्ञा(linker_test_दत्त[22] == 42);
    प्रतिज्ञा(linker_test_bss[256] == 42);
}

/* ------------------------------------------------------ */
#नोचेद्यदि TEST-SO == 6
पूर्णाङ्क अन्तः;
पूर्णाङ्क eight = 8;
पूर्णाङ्क nine;
पूर्णाङ्क dso_सङ्कलय() { प्रत्यागम अन्तः + eight + nine; }

#नोचेद्यदि TEST-MAIN == 6
पूर्णाङ्क अन्तः = 7;
पूर्णाङ्क eight;
पूर्णाङ्क nine = 9;
पूर्णाङ्क dso_सङ्कलय();
पूर्णाङ्क मुख्यम्()
{
    पूर्णाङ्क योग;
    प्रारूप_लिख("DSO initialized data test\n");
    योग = dso_सङ्कलय();
    प्रतिज्ञा(अन्तः == 7);
    प्रतिज्ञा(eight == 8);
    प्रतिज्ञा(nine == 9);
    प्रतिज्ञा(योग == 24) || प्रारूप_लिख("-- %d + %d + %d = %d\n", अन्तः, eight, nine, योग);
}

/* ------------------------------------------------------ */
#यदि_अन्तः
