صحیح لکھو(ثابت حرف *, ...);

#تعریف_کرو أكد(x) ((x) \
    ? (لکھو(" 1 (%s)\n",#x),1) \
    : (لکھو("%s:%d: error: (%s)\n",__FILE__,__LINE__,#x),0))

#تعریف_کرو O 100
#تعریف_کرو SO 200

/* ------------------------------------------------------ */
#اگر TEST-O == 1
خارجی حرف etext[], _etext[];
خارجی حرف edata[], _edata[];
خارجی حرف انتہا[], انتہا_3[];
صحیح check_linker_symbols(خالی)
{
    صحیح errors = 0;
    errors += !أكد(etext == _etext);
    errors += !أكد(edata == _edata);
    errors += !أكد(انتہا == انتہا_3);
    واپس errors;
}

#وگرنہ_اگر TEST-MAIN == 1
صحیح check_linker_symbols(خالی);
صحیح مین(خالی)
{
    لکھو("linker symbols test\n");
    أكد(check_linker_symbols() == 0);
}

/* ------------------------------------------------------ */
#وگرنہ_اگر TEST-SO == 2
خارجی حرف etext[], edata[], انتہا[];
خالی get_dso_انتہا(حرف **p)
{
    p[0] = etext;
    p[1] = edata;
    p[2] = انتہا;
}

#وگرنہ_اگر TEST-MAIN == 2
خارجی حرف _etext[], _edata[], انتہا_3[];
خارجی خالی get_dso_انتہا(حرف **);
ساکن صحیح fill_ڈیٹا = 123;
ساکن صحیح fill_bss;

صحیح مین(خالی)
{
    حرف *p[3];
    لکھو("DSO linker symbols test\n");
    get_dso_انتہا(p);
    أكد(p[0] == _etext) || لکھو("-- %p %p\n", p[0], _etext);
    أكد(p[1] == _edata) || لکھو("-- %p %p\n", p[1], _edata);
    أكد(p[2] == انتہا_3)   || لکھو("-- %p %p\n", p[2], انتہا_3);
}

/* ------------------------------------------------------ */
#وگرنہ_اگر TEST-MAIN == 3

صحیح etext(خالی) { واپس 1; }
صحیح edata(خالی) { واپس 2; }
صحیح انتہا(خالی) { واپس 3; }
صحیح مین(خالی)
{
    لکھو("user definition test\n");
    أكد(etext() + edata() + انتہا() == 6);
}

/* ------------------------------------------------------ */
#وگرنہ_اگر TEST-SO == 4
غیرعلامتی حرف copy_reloc_ڈیٹا[257];

#وگرنہ_اگر TEST-MAIN == 4
خارجی غیرعلامتی حرف copy_reloc_ڈیٹا[257];
خارجی حرف انتہا[], انتہا_3[];

صحیح مین(خالی)
{
    غیرعلامتی طویل ڈیٹا_انتہا;
    لکھو("end copy relocation test\n");
    copy_reloc_ڈیٹا[256] = 42;
    ڈیٹا_انتہا = (غیرعلامتی طویل)(copy_reloc_ڈیٹا + حجم copy_reloc_ڈیٹا);
    أكد(انتہا == انتہا_3);
    أكد((غیرعلامتی طویل)انتہا >= ڈیٹا_انتہا);
    أكد(copy_reloc_ڈیٹا[256] == 42);
}

/* ------------------------------------------------------ */
#وگرنہ_اگر TEST-O == 5
خالی __attribute__((section(".text.linker_test"), noinline, مستعمل))
linker_test_متن(خالی)
{
}
__attribute__((section(".bss.linker_test"), مستعمل))
غیرعلامتی حرف linker_test_bss[257];

__attribute__((section(".data.linker_test"), مستعمل))
غیرعلامتی حرف linker_test_ڈیٹا[23] = { 1 };

#وگرنہ_اگر TEST-MAIN == 5
خارجی خالی linker_test_متن(خالی);
خارجی غیرعلامتی حرف linker_test_ڈیٹا[23];
خارجی غیرعلامتی حرف linker_test_bss[257];
خارجی حرف etext[], _etext[];
خارجی حرف edata[], _edata[];
خارجی حرف انتہا[], انتہا_3[];

صحیح مین(خالی)
{
    حرف* متن_addr = (خالی*)linker_test_متن;
    حرف* ڈیٹا_انتہا = linker_test_ڈیٹا + حجم linker_test_ڈیٹا;
    حرف* bss_انتہا = linker_test_bss + حجم linker_test_bss;

    لکھو("linker boundary test\n");
    linker_test_ڈیٹا[22] = 42;
    linker_test_bss[256] = 42;
    أكد(linker_test_bss > linker_test_ڈیٹا);
    أكد(etext == _etext);
    أكد(edata == _edata);
    أكد(انتہا == انتہا_3);
    أكد(etext >= متن_addr);
    أكد(edata >= ڈیٹا_انتہا);
    أكد(انتہا >= bss_انتہا);
    أكد(linker_test_ڈیٹا[22] == 42);
    أكد(linker_test_bss[256] == 42);
}

/* ------------------------------------------------------ */
#وگرنہ_اگر TEST-SO == 6
صحیح انتہا;
صحیح eight = 8;
صحیح nine;
صحیح dso_جوڑو() { واپس انتہا + eight + nine; }

#وگرنہ_اگر TEST-MAIN == 6
صحیح انتہا = 7;
صحیح eight;
صحیح nine = 9;
صحیح dso_جوڑو();
صحیح مین()
{
    صحیح مجموع;
    لکھو("DSO initialized data test\n");
    مجموع = dso_جوڑو();
    أكد(انتہا == 7);
    أكد(eight == 8);
    أكد(nine == 9);
    أكد(مجموع == 24) || لکھو("-- %d + %d + %d = %d\n", انتہا, eight, nine, مجموع);
}

/* ------------------------------------------------------ */
#اگر_ختم
