صحيح چاپ_کړه(ثابت حرف *, ...);

#تعریف_کړه أكد(x) ((x) \
    ? (چاپ_کړه(" 1 (%s)\n",#x),1) \
    : (چاپ_کړه("%s:%d: error: (%s)\n",__FILE__,__LINE__,#x),0))

#تعریف_کړه O 100
#تعریف_کړه SO 200

/* ------------------------------------------------------ */
#إذا TEST-O == 1
خارجي حرف etext[], _etext[];
خارجي حرف edata[], _edata[];
خارجي حرف پای_ټکی[], پای_ټکی_3[];
صحيح check_linker_symbols(فراغ)
{
    صحيح errors = 0;
    errors += !أكد(etext == _etext);
    errors += !أكد(edata == _edata);
    errors += !أكد(پای_ټکی == پای_ټکی_3);
    أرجع errors;
}

#وإلاإذا TEST-MAIN == 1
صحيح check_linker_symbols(فراغ);
صحيح اصلي(فراغ)
{
    چاپ_کړه("linker symbols test\n");
    أكد(check_linker_symbols() == 0);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 2
خارجي حرف etext[], edata[], پای_ټکی[];
فراغ get_dso_پای_ټکی(حرف **p)
{
    p[0] = etext;
    p[1] = edata;
    p[2] = پای_ټکی;
}

#وإلاإذا TEST-MAIN == 2
خارجي حرف _etext[], _edata[], پای_ټکی_3[];
خارجي فراغ get_dso_پای_ټکی(حرف **);
ساكن صحيح fill_معلومات = 123;
ساكن صحيح fill_bss;

صحيح اصلي(فراغ)
{
    حرف *p[3];
    چاپ_کړه("DSO linker symbols test\n");
    get_dso_پای_ټکی(p);
    أكد(p[0] == _etext) || چاپ_کړه("-- %p %p\n", p[0], _etext);
    أكد(p[1] == _edata) || چاپ_کړه("-- %p %p\n", p[1], _edata);
    أكد(p[2] == پای_ټکی_3)   || چاپ_کړه("-- %p %p\n", p[2], پای_ټکی_3);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-MAIN == 3

صحيح etext(فراغ) { أرجع 1; }
صحيح edata(فراغ) { أرجع 2; }
صحيح پای_ټکی(فراغ) { أرجع 3; }
صحيح اصلي(فراغ)
{
    چاپ_کړه("user definition test\n");
    أكد(etext() + edata() + پای_ټکی() == 6);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 4
بینښه حرف copy_reloc_معلومات[257];

#وإلاإذا TEST-MAIN == 4
خارجي بینښه حرف copy_reloc_معلومات[257];
خارجي حرف پای_ټکی[], پای_ټکی_3[];

صحيح اصلي(فراغ)
{
    بینښه اوږد معلومات_پای_ټکی;
    چاپ_کړه("end copy relocation test\n");
    copy_reloc_معلومات[256] = 42;
    معلومات_پای_ټکی = (بینښه اوږد)(copy_reloc_معلومات + حجم copy_reloc_معلومات);
    أكد(پای_ټکی == پای_ټکی_3);
    أكد((بینښه اوږد)پای_ټکی >= معلومات_پای_ټکی);
    أكد(copy_reloc_معلومات[256] == 42);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-O == 5
فراغ __attribute__((section(".text.linker_test"), noinline, کارول_شوی))
linker_test_متن(فراغ)
{
}
__attribute__((section(".bss.linker_test"), کارول_شوی))
بینښه حرف linker_test_bss[257];

__attribute__((section(".data.linker_test"), کارول_شوی))
بینښه حرف linker_test_معلومات[23] = { 1 };

#وإلاإذا TEST-MAIN == 5
خارجي فراغ linker_test_متن(فراغ);
خارجي بینښه حرف linker_test_معلومات[23];
خارجي بینښه حرف linker_test_bss[257];
خارجي حرف etext[], _etext[];
خارجي حرف edata[], _edata[];
خارجي حرف پای_ټکی[], پای_ټکی_3[];

صحيح اصلي(فراغ)
{
    حرف* متن_addr = (فراغ*)linker_test_متن;
    حرف* معلومات_پای_ټکی = linker_test_معلومات + حجم linker_test_معلومات;
    حرف* bss_پای_ټکی = linker_test_bss + حجم linker_test_bss;

    چاپ_کړه("linker boundary test\n");
    linker_test_معلومات[22] = 42;
    linker_test_bss[256] = 42;
    أكد(linker_test_bss > linker_test_معلومات);
    أكد(etext == _etext);
    أكد(edata == _edata);
    أكد(پای_ټکی == پای_ټکی_3);
    أكد(etext >= متن_addr);
    أكد(edata >= معلومات_پای_ټکی);
    أكد(پای_ټکی >= bss_پای_ټکی);
    أكد(linker_test_معلومات[22] == 42);
    أكد(linker_test_bss[256] == 42);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 6
صحيح پای_ټکی;
صحيح eight = 8;
صحيح nine;
صحيح dso_جمع_کړه() { أرجع پای_ټکی + eight + nine; }

#وإلاإذا TEST-MAIN == 6
صحيح پای_ټکی = 7;
صحيح eight;
صحيح nine = 9;
صحيح dso_جمع_کړه();
صحيح اصلي()
{
    صحيح مجموعه;
    چاپ_کړه("DSO initialized data test\n");
    مجموعه = dso_جمع_کړه();
    أكد(پای_ټکی == 7);
    أكد(eight == 8);
    أكد(nine == 9);
    أكد(مجموعه == 24) || چاپ_کړه("-- %d + %d + %d = %d\n", پای_ټکی, eight, nine, مجموعه);
}

/* ------------------------------------------------------ */
#د_که_پای
