صحيح چاپ_کن(ثابت حرف *, ...);

#تعریف_کن أكد(x) ((x) \
    ? (چاپ_کن(" 1 (%s)\n",#x),1) \
    : (چاپ_کن("%s:%d: error: (%s)\n",__FILE__,__LINE__,#x),0))

#تعریف_کن O 100
#تعریف_کن SO 200

/* ------------------------------------------------------ */
#إذا TEST-O == 1
خارجي حرف etext[], _etext[];
خارجي حرف edata[], _edata[];
خارجي حرف انتها[], انتها_3[];
صحيح check_linker_symbols(فراغ)
{
    صحيح errors = 0;
    errors += !أكد(etext == _etext);
    errors += !أكد(edata == _edata);
    errors += !أكد(انتها == انتها_3);
    أرجع errors;
}

#وإلاإذا TEST-MAIN == 1
صحيح check_linker_symbols(فراغ);
صحيح اصلی(فراغ)
{
    چاپ_کن("linker symbols test\n");
    أكد(check_linker_symbols() == 0);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 2
خارجي حرف etext[], edata[], انتها[];
فراغ get_dso_انتها(حرف **p)
{
    p[0] = etext;
    p[1] = edata;
    p[2] = انتها;
}

#وإلاإذا TEST-MAIN == 2
خارجي حرف _etext[], _edata[], انتها_3[];
خارجي فراغ get_dso_انتها(حرف **);
ساكن صحيح fill_داده = 123;
ساكن صحيح fill_bss;

صحيح اصلی(فراغ)
{
    حرف *p[3];
    چاپ_کن("DSO linker symbols test\n");
    get_dso_انتها(p);
    أكد(p[0] == _etext) || چاپ_کن("-- %p %p\n", p[0], _etext);
    أكد(p[1] == _edata) || چاپ_کن("-- %p %p\n", p[1], _edata);
    أكد(p[2] == انتها_3)   || چاپ_کن("-- %p %p\n", p[2], انتها_3);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-MAIN == 3

صحيح etext(فراغ) { أرجع 1; }
صحيح edata(فراغ) { أرجع 2; }
صحيح انتها(فراغ) { أرجع 3; }
صحيح اصلی(فراغ)
{
    چاپ_کن("user definition test\n");
    أكد(etext() + edata() + انتها() == 6);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 4
بیعلامت حرف copy_reloc_داده[257];

#وإلاإذا TEST-MAIN == 4
خارجي بیعلامت حرف copy_reloc_داده[257];
خارجي حرف انتها[], انتها_3[];

صحيح اصلی(فراغ)
{
    بیعلامت دراز داده_انتها;
    چاپ_کن("end copy relocation test\n");
    copy_reloc_داده[256] = 42;
    داده_انتها = (بیعلامت دراز)(copy_reloc_داده + حجم copy_reloc_داده);
    أكد(انتها == انتها_3);
    أكد((بیعلامت دراز)انتها >= داده_انتها);
    أكد(copy_reloc_داده[256] == 42);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-O == 5
فراغ __attribute__((section(".text.linker_test"), noinline, استفاده_شده))
linker_test_متن(فراغ)
{
}
__attribute__((section(".bss.linker_test"), استفاده_شده))
بیعلامت حرف linker_test_bss[257];

__attribute__((section(".data.linker_test"), استفاده_شده))
بیعلامت حرف linker_test_داده[23] = { 1 };

#وإلاإذا TEST-MAIN == 5
خارجي فراغ linker_test_متن(فراغ);
خارجي بیعلامت حرف linker_test_داده[23];
خارجي بیعلامت حرف linker_test_bss[257];
خارجي حرف etext[], _etext[];
خارجي حرف edata[], _edata[];
خارجي حرف انتها[], انتها_3[];

صحيح اصلی(فراغ)
{
    حرف* متن_addr = (فراغ*)linker_test_متن;
    حرف* داده_انتها = linker_test_داده + حجم linker_test_داده;
    حرف* bss_انتها = linker_test_bss + حجم linker_test_bss;

    چاپ_کن("linker boundary test\n");
    linker_test_داده[22] = 42;
    linker_test_bss[256] = 42;
    أكد(linker_test_bss > linker_test_داده);
    أكد(etext == _etext);
    أكد(edata == _edata);
    أكد(انتها == انتها_3);
    أكد(etext >= متن_addr);
    أكد(edata >= داده_انتها);
    أكد(انتها >= bss_انتها);
    أكد(linker_test_داده[22] == 42);
    أكد(linker_test_bss[256] == 42);
}

/* ------------------------------------------------------ */
#وإلاإذا TEST-SO == 6
صحيح انتها;
صحيح eight = 8;
صحيح nine;
صحيح dso_جمع_کن() { أرجع انتها + eight + nine; }

#وإلاإذا TEST-MAIN == 6
صحيح انتها = 7;
صحيح eight;
صحيح nine = 9;
صحيح dso_جمع_کن();
صحيح اصلی()
{
    صحيح جمع;
    چاپ_کن("DSO initialized data test\n");
    جمع = dso_جمع_کن();
    أكد(انتها == 7);
    أكد(eight == 8);
    أكد(nine == 9);
    أكد(جمع == 24) || چاپ_کن("-- %d + %d + %d = %d\n", انتها, eight, nine, جمع);
}

/* ------------------------------------------------------ */
#پایان_اگر
