ಪೂರ್ಣಾಂಕ ಬರೆ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ...);

#ವ್ಯಾಖ್ಯಾನಿಸು ಪ್ರತಿಜ್ಞಾ(x) ((x) \
    ? (ಬರೆ(" 1 (%s)\n",#x),1) \
    : (ಬರೆ("%s:%d: error: (%s)\n",__FILE__,__LINE__,#x),0))

#ವ್ಯಾಖ್ಯಾನಿಸು O 100
#ವ್ಯಾಖ್ಯಾನಿಸು SO 200

/* ------------------------------------------------------ */
#ಆದರೆ TEST-O == 1
ಬಾಹ್ಯ ಅಕ್ಷರ etext[], _etext[];
ಬಾಹ್ಯ ಅಕ್ಷರ edata[], _edata[];
ಬಾಹ್ಯ ಅಕ್ಷರ ಕೊನೆ[], ಕೊನೆ_3[];
ಪೂರ್ಣಾಂಕ check_linker_symbols(ಶೂನ್ಯ)
{
    ಪೂರ್ಣಾಂಕ errors = 0;
    errors += !ಪ್ರತಿಜ್ಞಾ(etext == _etext);
    errors += !ಪ್ರತಿಜ್ಞಾ(edata == _edata);
    errors += !ಪ್ರತಿಜ್ಞಾ(ಕೊನೆ == ಕೊನೆ_3);
    ಹಿಂತಿರುಗಿ errors;
}

#ಅಥವಾಆದರೆ TEST-MAIN == 1
ಪೂರ್ಣಾಂಕ check_linker_symbols(ಶೂನ್ಯ);
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ)
{
    ಬರೆ("linker symbols test\n");
    ಪ್ರತಿಜ್ಞಾ(check_linker_symbols() == 0);
}

/* ------------------------------------------------------ */
#ಅಥವಾಆದರೆ TEST-SO == 2
ಬಾಹ್ಯ ಅಕ್ಷರ etext[], edata[], ಕೊನೆ[];
ಶೂನ್ಯ get_dso_ಕೊನೆ(ಅಕ್ಷರ **p)
{
    p[0] = etext;
    p[1] = edata;
    p[2] = ಕೊನೆ;
}

#ಅಥವಾಆದರೆ TEST-MAIN == 2
ಬಾಹ್ಯ ಅಕ್ಷರ _etext[], _edata[], ಕೊನೆ_3[];
ಬಾಹ್ಯ ಶೂನ್ಯ get_dso_ಕೊನೆ(ಅಕ್ಷರ **);
ಸ್ಥಿರ ಪೂರ್ಣಾಂಕ fill_ದತ್ತಾಂಶ = 123;
ಸ್ಥಿರ ಪೂರ್ಣಾಂಕ fill_bss;

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ)
{
    ಅಕ್ಷರ *p[3];
    ಬರೆ("DSO linker symbols test\n");
    get_dso_ಕೊನೆ(p);
    ಪ್ರತಿಜ್ಞಾ(p[0] == _etext) || ಬರೆ("-- %p %p\n", p[0], _etext);
    ಪ್ರತಿಜ್ಞಾ(p[1] == _edata) || ಬರೆ("-- %p %p\n", p[1], _edata);
    ಪ್ರತಿಜ್ಞಾ(p[2] == ಕೊನೆ_3)   || ಬರೆ("-- %p %p\n", p[2], ಕೊನೆ_3);
}

/* ------------------------------------------------------ */
#ಅಥವಾಆದರೆ TEST-MAIN == 3

ಪೂರ್ಣಾಂಕ etext(ಶೂನ್ಯ) { ಹಿಂತಿರುಗಿ 1; }
ಪೂರ್ಣಾಂಕ edata(ಶೂನ್ಯ) { ಹಿಂತಿರುಗಿ 2; }
ಪೂರ್ಣಾಂಕ ಕೊನೆ(ಶೂನ್ಯ) { ಹಿಂತಿರುಗಿ 3; }
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ)
{
    ಬರೆ("user definition test\n");
    ಪ್ರತಿಜ್ಞಾ(etext() + edata() + ಕೊನೆ() == 6);
}

/* ------------------------------------------------------ */
#ಅಥವಾಆದರೆ TEST-SO == 4
ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ copy_reloc_ದತ್ತಾಂಶ[257];

#ಅಥವಾಆದರೆ TEST-MAIN == 4
ಬಾಹ್ಯ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ copy_reloc_ದತ್ತಾಂಶ[257];
ಬಾಹ್ಯ ಅಕ್ಷರ ಕೊನೆ[], ಕೊನೆ_3[];

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ)
{
    ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದತ್ತಾಂಶ_ಕೊನೆ;
    ಬರೆ("end copy relocation test\n");
    copy_reloc_ದತ್ತಾಂಶ[256] = 42;
    ದತ್ತಾಂಶ_ಕೊನೆ = (ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ)(copy_reloc_ದತ್ತಾಂಶ + ಗಾತ್ರ copy_reloc_ದತ್ತಾಂಶ);
    ಪ್ರತಿಜ್ಞಾ(ಕೊನೆ == ಕೊನೆ_3);
    ಪ್ರತಿಜ್ಞಾ((ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ)ಕೊನೆ >= ದತ್ತಾಂಶ_ಕೊನೆ);
    ಪ್ರತಿಜ್ಞಾ(copy_reloc_ದತ್ತಾಂಶ[256] == 42);
}

/* ------------------------------------------------------ */
#ಅಥವಾಆದರೆ TEST-O == 5
ಶೂನ್ಯ __attribute__((section(".text.linker_test"), noinline, ಬಳಸಿದ))
linker_test_ಪಠ್ಯ(ಶೂನ್ಯ)
{
}
__attribute__((section(".bss.linker_test"), ಬಳಸಿದ))
ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ linker_test_bss[257];

__attribute__((section(".data.linker_test"), ಬಳಸಿದ))
ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ linker_test_ದತ್ತಾಂಶ[23] = { 1 };

#ಅಥವಾಆದರೆ TEST-MAIN == 5
ಬಾಹ್ಯ ಶೂನ್ಯ linker_test_ಪಠ್ಯ(ಶೂನ್ಯ);
ಬಾಹ್ಯ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ linker_test_ದತ್ತಾಂಶ[23];
ಬಾಹ್ಯ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ linker_test_bss[257];
ಬಾಹ್ಯ ಅಕ್ಷರ etext[], _etext[];
ಬಾಹ್ಯ ಅಕ್ಷರ edata[], _edata[];
ಬಾಹ್ಯ ಅಕ್ಷರ ಕೊನೆ[], ಕೊನೆ_3[];

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ)
{
    ಅಕ್ಷರ* ಪಠ್ಯ_addr = (ಶೂನ್ಯ*)linker_test_ಪಠ್ಯ;
    ಅಕ್ಷರ* ದತ್ತಾಂಶ_ಕೊನೆ = linker_test_ದತ್ತಾಂಶ + ಗಾತ್ರ linker_test_ದತ್ತಾಂಶ;
    ಅಕ್ಷರ* bss_ಕೊನೆ = linker_test_bss + ಗಾತ್ರ linker_test_bss;

    ಬರೆ("linker boundary test\n");
    linker_test_ದತ್ತಾಂಶ[22] = 42;
    linker_test_bss[256] = 42;
    ಪ್ರತಿಜ್ಞಾ(linker_test_bss > linker_test_ದತ್ತಾಂಶ);
    ಪ್ರತಿಜ್ಞಾ(etext == _etext);
    ಪ್ರತಿಜ್ಞಾ(edata == _edata);
    ಪ್ರತಿಜ್ಞಾ(ಕೊನೆ == ಕೊನೆ_3);
    ಪ್ರತಿಜ್ಞಾ(etext >= ಪಠ್ಯ_addr);
    ಪ್ರತಿಜ್ಞಾ(edata >= ದತ್ತಾಂಶ_ಕೊನೆ);
    ಪ್ರತಿಜ್ಞಾ(ಕೊನೆ >= bss_ಕೊನೆ);
    ಪ್ರತಿಜ್ಞಾ(linker_test_ದತ್ತಾಂಶ[22] == 42);
    ಪ್ರತಿಜ್ಞಾ(linker_test_bss[256] == 42);
}

/* ------------------------------------------------------ */
#ಅಥವಾಆದರೆ TEST-SO == 6
ಪೂರ್ಣಾಂಕ ಕೊನೆ;
ಪೂರ್ಣಾಂಕ eight = 8;
ಪೂರ್ಣಾಂಕ nine;
ಪೂರ್ಣಾಂಕ dso_ಕೂಡಿಸು() { ಹಿಂತಿರುಗಿ ಕೊನೆ + eight + nine; }

#ಅಥವಾಆದರೆ TEST-MAIN == 6
ಪೂರ್ಣಾಂಕ ಕೊನೆ = 7;
ಪೂರ್ಣಾಂಕ eight;
ಪೂರ್ಣಾಂಕ nine = 9;
ಪೂರ್ಣಾಂಕ dso_ಕೂಡಿಸು();
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
    ಪೂರ್ಣಾಂಕ ಮೊತ್ತ;
    ಬರೆ("DSO initialized data test\n");
    ಮೊತ್ತ = dso_ಕೂಡಿಸು();
    ಪ್ರತಿಜ್ಞಾ(ಕೊನೆ == 7);
    ಪ್ರತಿಜ್ಞಾ(eight == 8);
    ಪ್ರತಿಜ್ಞಾ(nine == 9);
    ಪ್ರತಿಜ್ಞಾ(ಮೊತ್ತ == 24) || ಬರೆ("-- %d + %d + %d = %d\n", ಕೊನೆ, eight, nine, ಮೊತ್ತ);
}

/* ------------------------------------------------------ */
#ಆದರೆ_ಅಂತ್ಯ
