#تعریف_کړه ISOC99_سرچینه 1

#ضمن <stdio.h>
#ضمن <math.h>

صحيح اصلي()
{
   چاپ_کړه("%f\n", ساین(0.12));
   چاپ_کړه("%f\n", کوساین(0.12));
   چاپ_کړه("%f\n", tan(0.12));
   چاپ_کړه("%f\n", asin(0.12));
   چاپ_کړه("%f\n", acos(0.12));
   چاپ_کړه("%f\n", atan(0.12));
   چاپ_کړه("%f\n", sinh(0.12));
   چاپ_کړه("%f\n", cosh(0.12));
   چاپ_کړه("%f\n", tanh(0.12));
   چاپ_کړه("%f\n", توانیز_تابع(0.12));
   چاپ_کړه("%f\n", fabs(-0.12));
   چاپ_کړه("%f\n", لوګاریتم(0.12));
   چاپ_کړه("%f\n", log10(0.12));
   چاپ_کړه("%f\n", توان(0.12, 0.12));
   چاپ_کړه("%f\n", جذر(0.12));
   چاپ_کړه("%f\n", پړاو(12.34));
   چاپ_کړه("%f\n", ceil(12.34));
   چاپ_کړه("%f\n", floor(12.34));

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
