#define _ISOC99_SOURCE 1

#अन्तर्भाव <stdio.h>
#अन्तर्भाव <math.h>

पूर्णांक main()
{
   म_लिखो("%f\n", sin(0.12));
   म_लिखो("%f\n", cos(0.12));
   म_लिखो("%f\n", tan(0.12));
   म_लिखो("%f\n", asin(0.12));
   म_लिखो("%f\n", acos(0.12));
   म_लिखो("%f\n", atan(0.12));
   म_लिखो("%f\n", sinh(0.12));
   म_लिखो("%f\n", cosh(0.12));
   म_लिखो("%f\n", tanh(0.12));
   म_लिखो("%f\n", exp(0.12));
   म_लिखो("%f\n", भ_असल(-0.12));
   म_लिखो("%f\n", log(0.12));
   म_लिखो("%f\n", log10(0.12));
   म_लिखो("%f\n", घात(0.12, 0.12));
   म_लिखो("%f\n", वर्ग_मूल(0.12));
   म_लिखो("%f\n", round(12.34));
   म_लिखो("%f\n", उच्चमान(12.34));
   म_लिखो("%f\n", न्यूनमान(12.34));

   परत 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
