#تعریف_کن ISOC99_منبع 1

#ضمن <stdio.h>
#ضمن <math.h>

صحيح اصلی()
{
   چاپ_کن("%f\n", سینوس(0.12));
   چاپ_کن("%f\n", کسینوس(0.12));
   چاپ_کن("%f\n", tan(0.12));
   چاپ_کن("%f\n", asin(0.12));
   چاپ_کن("%f\n", acos(0.12));
   چاپ_کن("%f\n", atan(0.12));
   چاپ_کن("%f\n", sinh(0.12));
   چاپ_کن("%f\n", cosh(0.12));
   چاپ_کن("%f\n", tanh(0.12));
   چاپ_کن("%f\n", نمایی_تابع(0.12));
   چاپ_کن("%f\n", fabs(-0.12));
   چاپ_کن("%f\n", لگاریتم(0.12));
   چاپ_کن("%f\n", log10(0.12));
   چاپ_کن("%f\n", توان(0.12, 0.12));
   چاپ_کن("%f\n", جذر(0.12));
   چاپ_کن("%f\n", دور(12.34));
   چاپ_کن("%f\n", ceil(12.34));
   چاپ_کن("%f\n", floor(12.34));

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
