#تعریف_کرو ISOC99_سروت 1

#ضمن <stdio.h>
#ضمن <math.h>

صحيح مکھ()
{
   لکھو("%f\n", جیب(0.12));
   لکھو("%f\n", جیب_تمام(0.12));
   لکھو("%f\n", tan(0.12));
   لکھو("%f\n", asin(0.12));
   لکھو("%f\n", acos(0.12));
   لکھو("%f\n", atan(0.12));
   لکھو("%f\n", sinh(0.12));
   لکھو("%f\n", cosh(0.12));
   لکھو("%f\n", tanh(0.12));
   لکھو("%f\n", قوت_نما(0.12));
   لکھو("%f\n", fabs(-0.12));
   لکھو("%f\n", لوگارتھم(0.12));
   لکھو("%f\n", log10(0.12));
   لکھو("%f\n", قوت(0.12, 0.12));
   لکھو("%f\n", جذر(0.12));
   لکھو("%f\n", گیڑا(12.34));
   لکھو("%f\n", ceil(12.34));
   لکھو("%f\n", floor(12.34));

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
