#परिभाषय _ISOC99_SOURCE 1

#अन्तर्भाव <stdio.h>
#अन्तर्भाव <math.h>

पूर्णाङ्क मुख्यम्()
{
   प्रारूप_लिख("%f\n", ज्या(0.12));
   प्रारूप_लिख("%f\n", कोटिज्या(0.12));
   प्रारूप_लिख("%f\n", tan(0.12));
   प्रारूप_लिख("%f\n", asin(0.12));
   प्रारूप_लिख("%f\n", acos(0.12));
   प्रारूप_लिख("%f\n", atan(0.12));
   प्रारूप_लिख("%f\n", sinh(0.12));
   प्रारूप_लिख("%f\n", cosh(0.12));
   प्रारूप_लिख("%f\n", tanh(0.12));
   प्रारूप_लिख("%f\n", घातांकः(0.12));
   प्रारूप_लिख("%f\n", fabs(-0.12));
   प्रारूप_लिख("%f\n", लघुगणकः(0.12));
   प्रारूप_लिख("%f\n", log10(0.12));
   प्रारूप_लिख("%f\n", घातः(0.12, 0.12));
   प्रारूप_लिख("%f\n", वर्गमूलम्(0.12));
   प्रारूप_लिख("%f\n", आवर्तनम्(12.34));
   प्रारूप_लिख("%f\n", ceil(12.34));
   प्रारूप_लिख("%f\n", floor(12.34));

   प्रत्यागम 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
