#ವ್ಯಾಖ್ಯಾನಿಸು ISOC99_ಮೂಲ 1

#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <math.h>

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
   ಬರೆ("%f\n", ಜ್ಯಾ(0.12));
   ಬರೆ("%f\n", ಕೋಜ್ಯಾ(0.12));
   ಬರೆ("%f\n", tan(0.12));
   ಬರೆ("%f\n", asin(0.12));
   ಬರೆ("%f\n", acos(0.12));
   ಬರೆ("%f\n", atan(0.12));
   ಬರೆ("%f\n", sinh(0.12));
   ಬರೆ("%f\n", cosh(0.12));
   ಬರೆ("%f\n", tanh(0.12));
   ಬರೆ("%f\n", ಘಾತಾಂಕ(0.12));
   ಬರೆ("%f\n", fabs(-0.12));
   ಬರೆ("%f\n", ಲಘುಗಣಕ(0.12));
   ಬರೆ("%f\n", log10(0.12));
   ಬರೆ("%f\n", ಘಾತ(0.12, 0.12));
   ಬರೆ("%f\n", ವರ್ಗಮೂಲ(0.12));
   ಬರೆ("%f\n", ಸುತ್ತು(12.34));
   ಬರೆ("%f\n", ceil(12.34));
   ಬರೆ("%f\n", floor(12.34));

   ಹಿಂತಿರುಗಿ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
