#وصف_ڪريو ISOC99_ذريعو 1

#ضمن <stdio.h>
#ضمن <math.h>

صحيح مکيه()
{
   لکو("%f\n", جيب(0.12));
   لکو("%f\n", جيب_تمام(0.12));
   لکو("%f\n", tan(0.12));
   لکو("%f\n", asin(0.12));
   لکو("%f\n", acos(0.12));
   لکو("%f\n", atan(0.12));
   لکو("%f\n", sinh(0.12));
   لکو("%f\n", cosh(0.12));
   لکو("%f\n", tanh(0.12));
   لکو("%f\n", قوت_نما(0.12));
   لکو("%f\n", fabs(-0.12));
   لکو("%f\n", لاگرٿم(0.12));
   لکو("%f\n", log10(0.12));
   لکو("%f\n", قوت(0.12, 0.12));
   لکو("%f\n", جذر(0.12));
   لکو("%f\n", ڦيرو(12.34));
   لکو("%f\n", ceil(12.34));
   لکو("%f\n", floor(12.34));

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
