#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>

पूर्णाङ्क मुख्यम्()
{
   वर्ण a[10];

   वाक्यं_प्रतिलिख(a, "hello");
   प्रारूप_लिख("%s\n", a);

   strncpy(a, "gosh", 2);
   प्रारूप_लिख("%s\n", a);

   प्रारूप_लिख("%d\n", वाक्यं_तुलय(a, "apple") > 0);
   प्रारूप_लिख("%d\n", वाक्यं_तुलय(a, "goere") > 0);
   प्रारूप_लिख("%d\n", वाक्यं_तुलय(a, "zebra") < 0);

   प्रारूप_लिख("%d\n", वाक्यदैर्घ्यम्(a));

   वाक्यं_योजय(a, "!");
   प्रारूप_लिख("%s\n", a);

   प्रारूप_लिख("%d\n", वाक्ये_तुलय(a, "apple", 2) > 0);
   प्रारूप_लिख("%d\n", वाक्ये_तुलय(a, "goere", 2) == 0);
   प्रारूप_लिख("%d\n", वाक्ये_तुलय(a, "goerg", 2) == 0);
   प्रारूप_लिख("%d\n", वाक्ये_तुलय(a, "zebra", 2) < 0);

   प्रारूप_लिख("%s\n", strchr(a, 'o'));
   प्रारूप_लिख("%s\n", strrchr(a, 'l'));
   प्रारूप_लिख("%d\n", strrchr(a, 'x') == रिक्त);

   स्मृतिं_पूरय(&a[1], 'r', 4);
   प्रारूप_लिख("%s\n", a);

   स्मृतिं_प्रतिलिख(&a[2], a, 2);
   प्रारूप_लिख("%s\n", a);

   प्रारूप_लिख("%d\n", memcmp(a, "apple", 4) > 0);
   प्रारूप_लिख("%d\n", memcmp(a, "grgr", 4) == 0);
   प्रारूप_लिख("%d\n", memcmp(a, "zebra", 4) < 0);

   प्रत्यागम 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
