#समावेश <stdio.h>
#समावेश <string.h>

पूर्णांक मुख्य()
{
   अक्षर a[10];

   म_नकल(a, "hello");
   म_लिखो("%s\n", a);

   म_नकलन(a, "gosh", 2);
   म_लिखो("%s\n", a);

   म_लिखो("%d\n", म_भेद(a, "apple") > 0);
   म_लिखो("%d\n", म_भेद(a, "goere") > 0);
   म_लिखो("%d\n", म_भेद(a, "zebra") < 0);

   म_लिखो("%d\n", म_माप(a));

   म_जोड़ो(a, "!");
   म_लिखो("%s\n", a);

   म_लिखो("%d\n", म_भेदन(a, "apple", 2) > 0);
   म_लिखो("%d\n", म_भेदन(a, "goere", 2) == 0);
   म_लिखो("%d\n", म_भेदन(a, "goerg", 2) == 0);
   म_लिखो("%d\n", म_भेदन(a, "zebra", 2) < 0);

   म_लिखो("%s\n", म_अक्षर(a, 'o'));
   म_लिखो("%s\n", म_खोजप(a, 'l'));
   म_लिखो("%d\n", म_खोजप(a, 'x') == शून्य);

   स_रखो(&a[1], 'r', 4);
   म_लिखो("%s\n", a);

   स_नकल(&a[2], a, 2);
   म_लिखो("%s\n", a);

   म_लिखो("%d\n", स_भेद(a, "apple", 4) > 0);
   म_लिखो("%d\n", स_भेद(a, "grgr", 4) == 0);
   म_लिखो("%d\n", स_भेद(a, "zebra", 4) < 0);

   वापस 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
