पूर्णांक म_लिखो(स्थिर अक्षर*, ...);

पूर्णांक मुख्य()
{
    अक्षर a;
    लघु b;

    म_लिखो("sizeof a : %d %d\n", माप(अक्षर), माप(a));
    म_लिखो("sizeof b : %d %d\n", माप(लघु), माप(b));

    पूर्णांक ii[] = {}; /* gnu extension, size = 0 */
    म_लिखो("sizeof ii : %d\n", माप ii);

    पूर्णांक kk[] = { 1 };
    म_लिखो("sizeof kk : %d\n", माप kk);

    अक्षर cc[] = "12";
    म_लिखो("sizeof cc : %d\n", माप cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    म_लिखो("len-of ll : %d\n", माप ll / माप ll[0]);

    अटल काष्ठा {
        पूर्णांक a,b,c;
        पूर्णांक d[];
    } ss[] = {{ 1, 2, 3, {} }};
    म_लिखो("sizeof ss : %d\n", माप ss);

    वापस 0;
}
