पूर्णाङ्क प्रारूप_लिख(ध्रुव वर्ण*, ...);

पूर्णाङ्क मुख्यम्()
{
    वर्ण a;
    ह्रस्व b;

    प्रारूप_लिख("sizeof a : %d %d\n", परिमाण(वर्ण), परिमाण(a));
    प्रारूप_लिख("sizeof b : %d %d\n", परिमाण(ह्रस्व), परिमाण(b));

    पूर्णाङ्क ii[] = {}; /* gnu extension, size = 0 */
    प्रारूप_लिख("sizeof ii : %d\n", परिमाण ii);

    पूर्णाङ्क kk[] = { 1 };
    प्रारूप_लिख("sizeof kk : %d\n", परिमाण kk);

    वर्ण cc[] = "12";
    प्रारूप_लिख("sizeof cc : %d\n", परिमाण cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    प्रारूप_लिख("len-of ll : %d\n", परिमाण ll / परिमाण ll[0]);

    स्थिर संरचना {
        पूर्णाङ्क a,b,c;
        पूर्णाङ्क d[];
    } ss[] = {{ 1, 2, 3, {} }};
    प्रारूप_लिख("sizeof ss : %d\n", परिमाण ss);

    प्रत्यागम 0;
}
