ਪੂਰਨ ਲਿਖੋ(ਅਚਲ ਅੱਖਰ*, ...);

ਪੂਰਨ ਮੁੱਖ()
{
    ਅੱਖਰ a;
    ਛੋਟਾ b;

    ਲਿਖੋ("sizeof a : %d %d\n", ਆਕਾਰ(ਅੱਖਰ), ਆਕਾਰ(a));
    ਲਿਖੋ("sizeof b : %d %d\n", ਆਕਾਰ(ਛੋਟਾ), ਆਕਾਰ(b));

    ਪੂਰਨ ii[] = {}; /* gnu extension, size = 0 */
    ਲਿਖੋ("sizeof ii : %d\n", ਆਕਾਰ ii);

    ਪੂਰਨ kk[] = { 1 };
    ਲਿਖੋ("sizeof kk : %d\n", ਆਕਾਰ kk);

    ਅੱਖਰ cc[] = "12";
    ਲਿਖੋ("sizeof cc : %d\n", ਆਕਾਰ cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    ਲਿਖੋ("len-of ll : %d\n", ਆਕਾਰ ll / ਆਕਾਰ ll[0]);

    ਸਥਿਰ ਬਣਤਰ {
        ਪੂਰਨ a,b,c;
        ਪੂਰਨ d[];
    } ss[] = {{ 1, 2, 3, {} }};
    ਲਿਖੋ("sizeof ss : %d\n", ਆਕਾਰ ss);

    ਵਾਪਸ 0;
}
