पूर्णाङ्क म_लिखो(ध्रुव वर्ण*, ...);

पूर्णाङ्क main()
{
    वर्ण a;
    लघु b;

    म_लिखो("sizeof a : %d %d\n", परिमाण(वर्ण), परिमाण(a));
    म_लिखो("sizeof b : %d %d\n", परिमाण(लघु), परिमाण(b));

    पूर्णाङ्क ii[] = {}; /* gnu extension, size = 0 */
    म_लिखो("sizeof ii : %d\n", परिमाण ii);

    पूर्णाङ्क kk[] = { 1 };
    म_लिखो("sizeof kk : %d\n", परिमाण kk);

    वर्ण cc[] = "12";
    म_लिखो("sizeof cc : %d\n", परिमाण cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    म_लिखो("len-of ll : %d\n", परिमाण ll / परिमाण ll[0]);

    स्थिर संरचना {
        पूर्णाङ्क a,b,c;
        पूर्णाङ्क d[];
    } ss[] = {{ 1, 2, 3, {} }};
    म_लिखो("sizeof ss : %d\n", परिमाण ss);

    प्रत्यागम 0;
}
