పూర్ణాంకం రాయి(స్థిరరాశి అక్షరం*, ...);

పూర్ణాంకం ప్రధాన()
{
    అక్షరం a;
    పొట్టి b;

    రాయి("sizeof a : %d %d\n", పరిమాణం(అక్షరం), పరిమాణం(a));
    రాయి("sizeof b : %d %d\n", పరిమాణం(పొట్టి), పరిమాణం(b));

    పూర్ణాంకం ii[] = {}; /* gnu extension, size = 0 */
    రాయి("sizeof ii : %d\n", పరిమాణం ii);

    పూర్ణాంకం kk[] = { 1 };
    రాయి("sizeof kk : %d\n", పరిమాణం kk);

    అక్షరం cc[] = "12";
    రాయి("sizeof cc : %d\n", పరిమాణం cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    రాయి("len-of ll : %d\n", పరిమాణం ll / పరిమాణం ll[0]);

    స్థిర నిర్మాణం {
        పూర్ణాంకం a,b,c;
        పూర్ణాంకం d[];
    } ss[] = {{ 1, 2, 3, {} }};
    రాయి("sizeof ss : %d\n", పరిమాణం ss);

    తిరిగి 0;
}
