पूर्णांक म_लिखो(स्थिरांक अक्षर*, ...);

पूर्णांक main()
{
    अक्षर a;
    लघु b;

    म_लिखो("sizeof a : %d %d\n", आकार(अक्षर), आकार(a));
    म_लिखो("sizeof b : %d %d\n", आकार(लघु), आकार(b));

    पूर्णांक ii[] = {}; /* gnu extension, size = 0 */
    म_लिखो("sizeof ii : %d\n", आकार ii);

    पूर्णांक kk[] = { 1 };
    म_लिखो("sizeof kk : %d\n", आकार kk);

    अक्षर cc[] = "12";
    म_लिखो("sizeof cc : %d\n", आकार cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    म_लिखो("len-of ll : %d\n", आकार ll / आकार ll[0]);

    स्थिर संरचना {
        पूर्णांक a,b,c;
        पूर्णांक d[];
    } ss[] = {{ 1, 2, 3, {} }};
    म_लिखो("sizeof ss : %d\n", आकार ss);

    परत 0;
}
