صحيح لکھو(ثابت حرف*, ...);

صحيح مکھ()
{
    حرف a;
    چھوٹا b;

    لکھو("sizeof a : %d %d\n", حجم(حرف), حجم(a));
    لکھو("sizeof b : %d %d\n", حجم(چھوٹا), حجم(b));

    صحيح ii[] = {}; /* gnu extension, size = 0 */
    لکھو("sizeof ii : %d\n", حجم ii);

    صحيح kk[] = { 1 };
    لکھو("sizeof kk : %d\n", حجم kk);

    حرف cc[] = "12";
    لکھو("sizeof cc : %d\n", حجم cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    لکھو("len-of ll : %d\n", حجم ll / حجم ll[0]);

    ساكن بنية {
        صحيح a,b,c;
        صحيح d[];
    } ss[] = {{ 1, 2, 3, {} }};
    لکھو("sizeof ss : %d\n", حجم ss);

    أرجع 0;
}
