صحيح چاپ_کړه(ثابت حرف*, ...);

صحيح اصلي()
{
    حرف a;
    لنډ b;

    چاپ_کړه("sizeof a : %d %d\n", حجم(حرف), حجم(a));
    چاپ_کړه("sizeof b : %d %d\n", حجم(لنډ), حجم(b));

    صحيح ii[] = {}; /* gnu extension, size = 0 */
    چاپ_کړه("sizeof ii : %d\n", حجم ii);

    صحيح kk[] = { 1 };
    چاپ_کړه("sizeof kk : %d\n", حجم kk);

    حرف cc[] = "12";
    چاپ_کړه("sizeof cc : %d\n", حجم cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    چاپ_کړه("len-of ll : %d\n", حجم ll / حجم ll[0]);

    ساكن بنية {
        صحيح a,b,c;
        صحيح d[];
    } ss[] = {{ 1, 2, 3, {} }};
    چاپ_کړه("sizeof ss : %d\n", حجم ss);

    أرجع 0;
}
