ಪೂರ್ಣಾಂಕ ಬರೆ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ*, ...);

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
    ಅಕ್ಷರ a;
    ಗಿಡ್ಡ b;

    ಬರೆ("sizeof a : %d %d\n", ಗಾತ್ರ(ಅಕ್ಷರ), ಗಾತ್ರ(a));
    ಬರೆ("sizeof b : %d %d\n", ಗಾತ್ರ(ಗಿಡ್ಡ), ಗಾತ್ರ(b));

    ಪೂರ್ಣಾಂಕ ii[] = {}; /* gnu extension, size = 0 */
    ಬರೆ("sizeof ii : %d\n", ಗಾತ್ರ ii);

    ಪೂರ್ಣಾಂಕ kk[] = { 1 };
    ಬರೆ("sizeof kk : %d\n", ಗಾತ್ರ kk);

    ಅಕ್ಷರ cc[] = "12";
    ಬರೆ("sizeof cc : %d\n", ಗಾತ್ರ cc);

    __WCHAR_TYPE__ ll[] = L"12345";
    ಬರೆ("len-of ll : %d\n", ಗಾತ್ರ ll / ಗಾತ್ರ ll[0]);

    ಸ್ಥಿರ ರಚನೆ {
        ಪೂರ್ಣಾಂಕ a,b,c;
        ಪೂರ್ಣಾಂಕ d[];
    } ss[] = {{ 1, 2, 3, {} }};
    ಬರೆ("sizeof ss : %d\n", ಗಾತ್ರ ss);

    ಹಿಂತಿರುಗಿ 0;
}
