#समावेश <stdio.h>

बाह्य पूर्णांक Array3[10];
पूर्णांक Array3[] = { 12, 34, };
पूर्णांक मुख्य()
{
   पूर्णांक गिनती_3;

   पूर्णांक Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   क्रम (गिनती_3 = 0; गिनती_3 < 10; गिनती_3++)
      म_लिखो("%d: %d\n", गिनती_3, Array[गिनती_3]);

   पूर्णांक Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   क्रम (गिनती_3 = 0; गिनती_3 < 10; गिनती_3++)
      म_लिखो("%d: %d\n", गिनती_3, Array2[गिनती_3]);

   क्रम (गिनती_3 = 0; गिनती_3 < 10; गिनती_3++)
      म_लिखो("%d: %d\n", गिनती_3, Array3[गिनती_3]);

   वापस 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
