#ضمن <stdio.h>

خارجي صحيح Array3[10];
صحيح Array3[] = { 12, 34, };
صحيح مکيه()
{
   صحيح ڳڻپ_3;

   صحيح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   لكل (ڳڻپ_3 = 0; ڳڻپ_3 < 10; ڳڻپ_3++)
      لکو("%d: %d\n", ڳڻپ_3, Array[ڳڻپ_3]);

   صحيح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   لكل (ڳڻپ_3 = 0; ڳڻپ_3 < 10; ڳڻپ_3++)
      لکو("%d: %d\n", ڳڻپ_3, Array2[ڳڻپ_3]);

   لكل (ڳڻپ_3 = 0; ڳڻپ_3 < 10; ڳڻپ_3++)
      لکو("%d: %d\n", ڳڻپ_3, Array3[ڳڻپ_3]);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
