#ضمن <stdio.h>

خارجي صحيح Array3[10];
صحيح Array3[] = { 12, 34, };
صحيح اصلی()
{
   صحيح شمار_3;

   صحيح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   لكل (شمار_3 = 0; شمار_3 < 10; شمار_3++)
      چاپ_کن("%d: %d\n", شمار_3, Array[شمار_3]);

   صحيح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   لكل (شمار_3 = 0; شمار_3 < 10; شمار_3++)
      چاپ_کن("%d: %d\n", شمار_3, Array2[شمار_3]);

   لكل (شمار_3 = 0; شمار_3 < 10; شمار_3++)
      چاپ_کن("%d: %d\n", شمار_3, Array3[شمار_3]);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
