#ضمن <stdio.h>

خارجي صحيح Array3[10];
صحيح Array3[] = { 12, 34, };
صحيح main()
{
   صحيح عدد_3;

   صحيح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   لكل (عدد_3 = 0; عدد_3 < 10; عدد_3++)
      printf("%d: %d\n", عدد_3, Array[عدد_3]);

   صحيح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   لكل (عدد_3 = 0; عدد_3 < 10; عدد_3++)
      printf("%d: %d\n", عدد_3, Array2[عدد_3]);

   لكل (عدد_3 = 0; عدد_3 < 10; عدد_3++)
      printf("%d: %d\n", عدد_3, Array3[عدد_3]);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
