#అన్తర్భావ <stdio.h>

బాహ్య పూర్ణాంకం Array3[10];
పూర్ణాంకం Array3[] = { 12, 34, };
పూర్ణాంకం ప్రధాన()
{
   పూర్ణాంకం లెక్క_3;

   పూర్ణాంకం Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   కొరకు (లెక్క_3 = 0; లెక్క_3 < 10; లెక్క_3++)
      రాయి("%d: %d\n", లెక్క_3, Array[లెక్క_3]);

   పూర్ణాంకం Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   కొరకు (లెక్క_3 = 0; లెక్క_3 < 10; లెక్క_3++)
      రాయి("%d: %d\n", లెక్క_3, Array2[లెక్క_3]);

   కొరకు (లెక్క_3 = 0; లెక్క_3 < 10; లెక్క_3++)
      రాయి("%d: %d\n", లెక్క_3, Array3[లెక్క_3]);

   తిరిగి 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
