#ಅನ್ತರ್ಭಾವ <stdio.h>

ಬಾಹ್ಯ ಪೂರ್ಣಾಂಕ Array3[10];
ಪೂರ್ಣಾಂಕ Array3[] = { 12, 34, };
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
   ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_4;

   ಪೂರ್ಣಾಂಕ Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   ಗಾಗಿ (ಎಣಿಕೆ_4 = 0; ಎಣಿಕೆ_4 < 10; ಎಣಿಕೆ_4++)
      ಬರೆ("%d: %d\n", ಎಣಿಕೆ_4, Array[ಎಣಿಕೆ_4]);

   ಪೂರ್ಣಾಂಕ Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   ಗಾಗಿ (ಎಣಿಕೆ_4 = 0; ಎಣಿಕೆ_4 < 10; ಎಣಿಕೆ_4++)
      ಬರೆ("%d: %d\n", ಎಣಿಕೆ_4, Array2[ಎಣಿಕೆ_4]);

   ಗಾಗಿ (ಎಣಿಕೆ_4 = 0; ಎಣಿಕೆ_4 < 10; ಎಣಿಕೆ_4++)
      ಬರೆ("%d: %d\n", ಎಣಿಕೆ_4, Array3[ಎಣಿಕೆ_4]);

   ಹಿಂತಿರುಗಿ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
