#अन्तर्भाव <stdio.h>

बाह्य पूर्णांक Array3[10];
पूर्णांक Array3[] = { 12, 34, };
पूर्णांक main()
{
   पूर्णांक मोजणी_3;

   पूर्णांक Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   साठी (मोजणी_3 = 0; मोजणी_3 < 10; मोजणी_3++)
      म_लिखो("%d: %d\n", मोजणी_3, Array[मोजणी_3]);

   पूर्णांक Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   साठी (मोजणी_3 = 0; मोजणी_3 < 10; मोजणी_3++)
      म_लिखो("%d: %d\n", मोजणी_3, Array2[मोजणी_3]);

   साठी (मोजणी_3 = 0; मोजणी_3 < 10; मोजणी_3++)
      म_लिखो("%d: %d\n", मोजणी_3, Array3[मोजणी_3]);

   परत 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
