#شامل <stdio.h>

خارجی صحیح Array3[10];
صحیح Array3[] = { 12, 34, };
صحیح مین()
{
   صحیح گنتی_3;

   صحیح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   برائے (گنتی_3 = 0; گنتی_3 < 10; گنتی_3++)
      لکھو("%d: %d\n", گنتی_3, Array[گنتی_3]);

   صحیح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   برائے (گنتی_3 = 0; گنتی_3 < 10; گنتی_3++)
      لکھو("%d: %d\n", گنتی_3, Array2[گنتی_3]);

   برائے (گنتی_3 = 0; گنتی_3 < 10; گنتی_3++)
      لکھو("%d: %d\n", گنتی_3, Array3[گنتی_3]);

   واپس 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
