#ضمن <stdio.h>

خارجي صحيح Array3[10];
صحيح Array3[] = { 12, 34, };
صحيح main()
{
   صحيح کيراءن_3;

   صحيح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   لكل (کيراءن_3 = 0; کيراءن_3 < 10; کيراءن_3++)
      printf("%d: %d\n", کيراءن_3, Array[کيراءن_3]);

   صحيح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   لكل (کيراءن_3 = 0; کيراءن_3 < 10; کيراءن_3++)
      printf("%d: %d\n", کيراءن_3, Array2[کيراءن_3]);

   لكل (کيراءن_3 = 0; کيراءن_3 < 10; کيراءن_3++)
      printf("%d: %d\n", کيراءن_3, Array3[کيراءن_3]);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
