#அந்தர்பாவ <stdio.h>

வெளி முழு Array3[10];
முழு Array3[] = { 12, 34, };
முழு முதன்மை()
{
   முழு மொத்தம்_3;

   முழு Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   க்கு (மொத்தம்_3 = 0; மொத்தம்_3 < 10; மொத்தம்_3++)
      printf("%d: %d\n", மொத்தம்_3, Array[மொத்தம்_3]);

   முழு Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   க்கு (மொத்தம்_3 = 0; மொத்தம்_3 < 10; மொத்தம்_3++)
      printf("%d: %d\n", மொத்தம்_3, Array2[மொத்தம்_3]);

   க்கு (மொத்தம்_3 = 0; மொத்தம்_3 < 10; மொத்தம்_3++)
      printf("%d: %d\n", மொத்தம்_3, Array3[மொத்தம்_3]);

   திரும்பு 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
