#अन्तर्भाव <stdio.h>

बाह्य पूर्णाङ्क Array3[10];
पूर्णाङ्क Array3[] = { 12, 34, };
पूर्णाङ्क main()
{
   पूर्णाङ्क गन्ती_3;

   पूर्णाङ्क Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   लागि (गन्ती_3 = 0; गन्ती_3 < 10; गन्ती_3++)
      म_लिखो("%d: %d\n", गन्ती_3, Array[गन्ती_3]);

   पूर्णाङ्क Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   लागि (गन्ती_3 = 0; गन्ती_3 < 10; गन्ती_3++)
      म_लिखो("%d: %d\n", गन्ती_3, Array2[गन्ती_3]);

   लागि (गन्ती_3 = 0; गन्ती_3 < 10; गन्ती_3++)
      म_लिखो("%d: %d\n", गन्ती_3, Array3[गन्ती_3]);

   फर्काऊ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
