#അന്തര്ഭാവ <stdio.h>

ബാഹ്യ പൂർണ്ണസംഖ്യ Array3[10];
പൂർണ്ണസംഖ്യ Array3[] = { 12, 34, };
പൂർണ്ണസംഖ്യ പ്രധാന()
{
   പൂർണ്ണസംഖ്യ എണ്ണം_3;

   പൂർണ്ണസംഖ്യ Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   വേണ്ടി (എണ്ണം_3 = 0; എണ്ണം_3 < 10; എണ്ണം_3++)
      printf("%d: %d\n", എണ്ണം_3, Array[എണ്ണം_3]);

   പൂർണ്ണസംഖ്യ Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   വേണ്ടി (എണ്ണം_3 = 0; എണ്ണം_3 < 10; എണ്ണം_3++)
      printf("%d: %d\n", എണ്ണം_3, Array2[എണ്ണം_3]);

   വേണ്ടി (എണ്ണം_3 = 0; എണ്ണം_3 < 10; എണ്ണം_3++)
      printf("%d: %d\n", എണ്ണം_3, Array3[എണ്ണം_3]);

   തിരികെ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
