#ضمن <stdio.h>

خارجي صحيح Array3[10];
صحيح Array3[] = { 12, 34, };
صحيح main()
{
   صحيح سانى_3;

   صحيح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   لكل (سانى_3 = 0; سانى_3 < 10; سانى_3++)
      printf("%d: %d\n", سانى_3, Array[سانى_3]);

   صحيح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   لكل (سانى_3 = 0; سانى_3 < 10; سانى_3++)
      printf("%d: %d\n", سانى_3, Array2[سانى_3]);

   لكل (سانى_3 = 0; سانى_3 < 10; سانى_3++)
      printf("%d: %d\n", سانى_3, Array3[سانى_3]);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
