#ಅನ್ತರ್ಭಾವ <stdio.h>

ಬಾಹ್ಯ ಪೂರ್ಣಾಙ್ಕ Array3[10];
ಪೂರ್ಣಾಙ್ಕ Array3[] = { 12, 34, };
ಪೂರ್ಣಾಙ್ಕ main()
{
   ಪೂರ್ಣಾಙ್ಕ ಎಣಿಕೆ_3;

   ಪೂರ್ಣಾಙ್ಕ Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   ಪ್ರತಿ (ಎಣಿಕೆ_3 = 0; ಎಣಿಕೆ_3 < 10; ಎಣಿಕೆ_3++)
      printf("%d: %d\n", ಎಣಿಕೆ_3, Array[ಎಣಿಕೆ_3]);

   ಪೂರ್ಣಾಙ್ಕ Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   ಪ್ರತಿ (ಎಣಿಕೆ_3 = 0; ಎಣಿಕೆ_3 < 10; ಎಣಿಕೆ_3++)
      printf("%d: %d\n", ಎಣಿಕೆ_3, Array2[ಎಣಿಕೆ_3]);

   ಪ್ರತಿ (ಎಣಿಕೆ_3 = 0; ಎಣಿಕೆ_3 < 10; ಎಣಿಕೆ_3++)
      printf("%d: %d\n", ಎಣಿಕೆ_3, Array3[ಎಣಿಕೆ_3]);

   ಪ್ರತ್ಯಾಗಮ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
