#ଅନ୍ତର୍ଭାଵ <stdio.h>

ବାହ୍ୟ ପୂର୍ଣ୍ଣସଂଖ୍ୟା Array3[10];
ପୂର୍ଣ୍ଣସଂଖ୍ୟା Array3[] = { 12, 34, };
ପୂର୍ଣ୍ଣସଂଖ୍ୟା ମୁଖ୍ୟ()
{
   ପୂର୍ଣ୍ଣସଂଖ୍ୟା ଗଣନା_4;

   ପୂର୍ଣ୍ଣସଂଖ୍ୟା Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   ପାଇଁ (ଗଣନା_4 = 0; ଗଣନା_4 < 10; ଗଣନା_4++)
      printf("%d: %d\n", ଗଣନା_4, Array[ଗଣନା_4]);

   ପୂର୍ଣ୍ଣସଂଖ୍ୟା Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   ପାଇଁ (ଗଣନା_4 = 0; ଗଣନା_4 < 10; ଗଣନା_4++)
      printf("%d: %d\n", ଗଣନା_4, Array2[ଗଣନା_4]);

   ପାଇଁ (ଗଣନା_4 = 0; ଗଣନା_4 < 10; ଗଣନା_4++)
      printf("%d: %d\n", ଗଣନା_4, Array3[ଗଣନା_4]);

   ଫେରନ୍ତୁ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
