#ضمن <stdio.h>

خارجي صحيح Array3[10];
صحيح Array3[] = { 12, 34, };
صحيح اصلي()
{
   صحيح شمېر_3;

   صحيح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   لكل (شمېر_3 = 0; شمېر_3 < 10; شمېر_3++)
      چاپ_کړه("%d: %d\n", شمېر_3, Array[شمېر_3]);

   صحيح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   لكل (شمېر_3 = 0; شمېر_3 < 10; شمېر_3++)
      چاپ_کړه("%d: %d\n", شمېر_3, Array2[شمېر_3]);

   لكل (شمېر_3 = 0; شمېر_3 < 10; شمېر_3++)
      چاپ_کړه("%d: %d\n", شمېر_3, Array3[شمېر_3]);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
