#شامل <stdio.h>

بیرونی صحیح Array3[10];
صحیح Array3[] = { 12, 34, };
صحیح اصلی()
{
   صحیح شمار_3;

   صحیح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   برای (شمار_3 = 0; شمار_3 < 10; شمار_3++)
      printf("%d: %d\n", شمار_3, Array[شمار_3]);

   صحیح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   برای (شمار_3 = 0; شمار_3 < 10; شمار_3++)
      printf("%d: %d\n", شمار_3, Array2[شمار_3]);

   برای (شمار_3 = 0; شمار_3 < 10; شمار_3++)
      printf("%d: %d\n", شمار_3, Array3[شمار_3]);

   بازگشت 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
