#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

ਬਾਹਰੀ ਪੂਰਨ Array3[10];
ਪੂਰਨ Array3[] = { 12, 34, };
ਪੂਰਨ ਮੁੱਖ()
{
   ਪੂਰਨ ਗਿਣਤੀ_4;

   ਪੂਰਨ Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   ਲਈ (ਗਿਣਤੀ_4 = 0; ਗਿਣਤੀ_4 < 10; ਗਿਣਤੀ_4++)
      ਲਿਖੋ("%d: %d\n", ਗਿਣਤੀ_4, Array[ਗਿਣਤੀ_4]);

   ਪੂਰਨ Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   ਲਈ (ਗਿਣਤੀ_4 = 0; ਗਿਣਤੀ_4 < 10; ਗਿਣਤੀ_4++)
      ਲਿਖੋ("%d: %d\n", ਗਿਣਤੀ_4, Array2[ਗਿਣਤੀ_4]);

   ਲਈ (ਗਿਣਤੀ_4 = 0; ਗਿਣਤੀ_4 < 10; ਗਿਣਤੀ_4++)
      ਲਿਖੋ("%d: %d\n", ਗਿਣਤੀ_4, Array3[ਗਿਣਤੀ_4]);

   ਵਾਪਸ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
