#ضمن <stdio.h>

خارجي صحيح Array3[10];
صحيح Array3[] = { 12, 34, };
صحيح الرئيسية()
{
   صحيح تعداد_4;

   صحيح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   لكل (تعداد_4 = 0; تعداد_4 < 10; تعداد_4++)
      printf("%d: %d\n", تعداد_4, Array[تعداد_4]);

   صحيح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   لكل (تعداد_4 = 0; تعداد_4 < 10; تعداد_4++)
      printf("%d: %d\n", تعداد_4, Array2[تعداد_4]);

   لكل (تعداد_4 = 0; تعداد_4 < 10; تعداد_4++)
      printf("%d: %d\n", تعداد_4, Array3[تعداد_4]);

   إرجاع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
