#অন্তর্ভাৱ <stdio.h>

বাহ্য পূর্ণাঙ্ক Array3[10];
পূর্ণাঙ্ক Array3[] = { 12, 34, };
পূর্ণাঙ্ক main()
{
   পূর্ণাঙ্ক গুনতি_3;

   পূর্ণাঙ্ক Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   বাবে (গুনতি_3 = 0; গুনতি_3 < 10; গুনতি_3++)
      printf("%d: %d\n", গুনতি_3, Array[গুনতি_3]);

   পূর্ণাঙ্ক Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   বাবে (গুনতি_3 = 0; গুনতি_3 < 10; গুনতি_3++)
      printf("%d: %d\n", গুনতি_3, Array2[গুনতি_3]);

   বাবে (গুনতি_3 = 0; গুনতি_3 < 10; গুনতি_3++)
      printf("%d: %d\n", গুনতি_3, Array3[গুনতি_3]);

   ঘূৰাই 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
