#ضمن <stdio.h>

خارجي صحيح Array3[10];
صحيح Array3[] = { 12, 34, };
صحيح مکھ()
{
   صحيح گنتی_3;

   صحيح Array[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753 };

   لكل (گنتی_3 = 0; گنتی_3 < 10; گنتی_3++)
      لکھو("%d: %d\n", گنتی_3, Array[گنتی_3]);

   صحيح Array2[10] = { 12, 34, 56, 78, 90, 123, 456, 789, 8642, 9753, };

   لكل (گنتی_3 = 0; گنتی_3 < 10; گنتی_3++)
      لکھو("%d: %d\n", گنتی_3, Array2[گنتی_3]);

   لكل (گنتی_3 = 0; گنتی_3 < 10; گنتی_3++)
      لکھو("%d: %d\n", گنتی_3, Array3[گنتی_3]);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
