#ضمن <stdio.h>

صحيح مکھ()
{
   لکھو("#include test\n");

#إذا 1
#إذا 0
   لکھو("a\n");
#وإلا
   لکھو("b\n");
#جے_انت
#وإلا
#إذا 0
   لکھو("c\n");
#وإلا
   لکھو("d\n");
#جے_انت
#جے_انت

#إذا 0
#إذا 1
   لکھو("e\n");
#وإلا
   لکھو("f\n");
#جے_انت
#وإلا
#إذا 1
   لکھو("g\n");
#وإلا
   لکھو("h\n");
#جے_انت
#جے_انت

#تعریف_کرو DEF

#جے_تعریف_شدہ DEF
#جے_تعریف_شدہ DEF
   لکھو("i\n");
#وإلا
   لکھو("j\n");
#جے_انت
#وإلا
#جے_تعریف_شدہ DEF
   لکھو("k\n");
#وإلا
   لکھو("l\n");
#جے_انت
#جے_انت

#جے_بنا_تعریف DEF
#جے_بنا_تعریف DEF
   لکھو("m\n");
#وإلا
   لکھو("n\n");
#جے_انت
#وإلا
#جے_بنا_تعریف DEF
   لکھو("o\n");
#وإلا
   لکھو("p\n");
#جے_انت
#جے_انت

#تعریف_کرو ONE 1
#تعریف_کرو ZERO 0

#إذا ONE
#إذا ZERO
   لکھو("q\n");
#وإلا
   لکھو("r\n");
#جے_انت
#وإلا
#إذا ZERO
   لکھو("s\n");
#وإلا
   لکھو("t\n");
#جے_انت
#جے_انت

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
