#ضمن <stdio.h>

صحيح اصلي()
{
   چاپ_کړه("#include test\n");

#إذا 1
#إذا 0
   چاپ_کړه("a\n");
#وإلا
   چاپ_کړه("b\n");
#د_که_پای
#وإلا
#إذا 0
   چاپ_کړه("c\n");
#وإلا
   چاپ_کړه("d\n");
#د_که_پای
#د_که_پای

#إذا 0
#إذا 1
   چاپ_کړه("e\n");
#وإلا
   چاپ_کړه("f\n");
#د_که_پای
#وإلا
#إذا 1
   چاپ_کړه("g\n");
#وإلا
   چاپ_کړه("h\n");
#د_که_پای
#د_که_پای

#تعریف_کړه DEF

#که_تعریف_شوی DEF
#که_تعریف_شوی DEF
   چاپ_کړه("i\n");
#وإلا
   چاپ_کړه("j\n");
#د_که_پای
#وإلا
#که_تعریف_شوی DEF
   چاپ_کړه("k\n");
#وإلا
   چاپ_کړه("l\n");
#د_که_پای
#د_که_پای

#که_نه_تعریف_شوی DEF
#که_نه_تعریف_شوی DEF
   چاپ_کړه("m\n");
#وإلا
   چاپ_کړه("n\n");
#د_که_پای
#وإلا
#که_نه_تعریف_شوی DEF
   چاپ_کړه("o\n");
#وإلا
   چاپ_کړه("p\n");
#د_که_پای
#د_که_پای

#تعریف_کړه ONE 1
#تعریف_کړه ZERO 0

#إذا ONE
#إذا ZERO
   چاپ_کړه("q\n");
#وإلا
   چاپ_کړه("r\n");
#د_که_پای
#وإلا
#إذا ZERO
   چاپ_کړه("s\n");
#وإلا
   چاپ_کړه("t\n");
#د_که_پای
#د_که_پای

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
