#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

ਪੂਰਨ ਮੁੱਖ()
{
   ਲਿਖੋ("#include test\n");

#ਜੇ 1
#ਜੇ 0
   ਲਿਖੋ("a\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("b\n");
#ਜੇ_ਅੰਤ
#ਨਹੀਂਤਾਂ
#ਜੇ 0
   ਲਿਖੋ("c\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("d\n");
#ਜੇ_ਅੰਤ
#ਜੇ_ਅੰਤ

#ਜੇ 0
#ਜੇ 1
   ਲਿਖੋ("e\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("f\n");
#ਜੇ_ਅੰਤ
#ਨਹੀਂਤਾਂ
#ਜੇ 1
   ਲਿਖੋ("g\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("h\n");
#ਜੇ_ਅੰਤ
#ਜੇ_ਅੰਤ

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ DEF

#ਜੇ_ਪਰਿਭਾਸ਼ਿਤ DEF
#ਜੇ_ਪਰਿਭਾਸ਼ਿਤ DEF
   ਲਿਖੋ("i\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("j\n");
#ਜੇ_ਅੰਤ
#ਨਹੀਂਤਾਂ
#ਜੇ_ਪਰਿਭਾਸ਼ਿਤ DEF
   ਲਿਖੋ("k\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("l\n");
#ਜੇ_ਅੰਤ
#ਜੇ_ਅੰਤ

#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ DEF
#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ DEF
   ਲਿਖੋ("m\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("n\n");
#ਜੇ_ਅੰਤ
#ਨਹੀਂਤਾਂ
#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ DEF
   ਲਿਖੋ("o\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("p\n");
#ਜੇ_ਅੰਤ
#ਜੇ_ਅੰਤ

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ ONE 1
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ ZERO 0

#ਜੇ ONE
#ਜੇ ZERO
   ਲਿਖੋ("q\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("r\n");
#ਜੇ_ਅੰਤ
#ਨਹੀਂਤਾਂ
#ਜੇ ZERO
   ਲਿਖੋ("s\n");
#ਨਹੀਂਤਾਂ
   ਲਿਖੋ("t\n");
#ਜੇ_ਅੰਤ
#ਜੇ_ਅੰਤ

   ਵਾਪਸ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
