#ಅನ್ತರ್ಭಾವ <stdio.h>

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
   ಬರೆ("#include test\n");

#ಆದರೆ 1
#ಆದರೆ 0
   ಬರೆ("a\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("b\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಇಲ್ಲದಿದ್ದರೆ
#ಆದರೆ 0
   ಬರೆ("c\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("d\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ_ಅಂತ್ಯ

#ಆದರೆ 0
#ಆದರೆ 1
   ಬರೆ("e\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("f\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಇಲ್ಲದಿದ್ದರೆ
#ಆದರೆ 1
   ಬರೆ("g\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("h\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿಸು DEF

#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ DEF
#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ DEF
   ಬರೆ("i\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("j\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಇಲ್ಲದಿದ್ದರೆ
#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ DEF
   ಬರೆ("k\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("l\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ DEF
#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ DEF
   ಬರೆ("m\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("n\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಇಲ್ಲದಿದ್ದರೆ
#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ DEF
   ಬರೆ("o\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("p\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿಸು ONE 1
#ವ್ಯಾಖ್ಯಾನಿಸು ZERO 0

#ಆದರೆ ONE
#ಆದರೆ ZERO
   ಬರೆ("q\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("r\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಇಲ್ಲದಿದ್ದರೆ
#ಆದರೆ ZERO
   ಬರೆ("s\n");
#ಇಲ್ಲದಿದ್ದರೆ
   ಬರೆ("t\n");
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ_ಅಂತ್ಯ

   ಹಿಂತಿರುಗಿ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
