#ضمن <stdio.h>

صحيح اصلی()
{
   چاپ_کن("#include test\n");

#إذا 1
#إذا 0
   چاپ_کن("a\n");
#وإلا
   چاپ_کن("b\n");
#پایان_اگر
#وإلا
#إذا 0
   چاپ_کن("c\n");
#وإلا
   چاپ_کن("d\n");
#پایان_اگر
#پایان_اگر

#إذا 0
#إذا 1
   چاپ_کن("e\n");
#وإلا
   چاپ_کن("f\n");
#پایان_اگر
#وإلا
#إذا 1
   چاپ_کن("g\n");
#وإلا
   چاپ_کن("h\n");
#پایان_اگر
#پایان_اگر

#تعریف_کن DEF

#اگر_تعریف_شده DEF
#اگر_تعریف_شده DEF
   چاپ_کن("i\n");
#وإلا
   چاپ_کن("j\n");
#پایان_اگر
#وإلا
#اگر_تعریف_شده DEF
   چاپ_کن("k\n");
#وإلا
   چاپ_کن("l\n");
#پایان_اگر
#پایان_اگر

#اگر_تعریف_نشده DEF
#اگر_تعریف_نشده DEF
   چاپ_کن("m\n");
#وإلا
   چاپ_کن("n\n");
#پایان_اگر
#وإلا
#اگر_تعریف_نشده DEF
   چاپ_کن("o\n");
#وإلا
   چاپ_کن("p\n");
#پایان_اگر
#پایان_اگر

#تعریف_کن ONE 1
#تعریف_کن ZERO 0

#إذا ONE
#إذا ZERO
   چاپ_کن("q\n");
#وإلا
   چاپ_کن("r\n");
#پایان_اگر
#وإلا
#إذا ZERO
   چاپ_کن("s\n");
#وإلا
   چاپ_کن("t\n");
#پایان_اگر
#پایان_اگر

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
