#अन्तर्भाव <stdio.h>

पूर्णाङ्क मुख्यम्()
{
   प्रारूप_लिख("#include test\n");

#यदि 1
#यदि 0
   प्रारूप_लिख("a\n");
#अन्यथा
   प्रारूप_लिख("b\n");
#यदि_अन्तः
#अन्यथा
#यदि 0
   प्रारूप_लिख("c\n");
#अन्यथा
   प्रारूप_लिख("d\n");
#यदि_अन्तः
#यदि_अन्तः

#यदि 0
#यदि 1
   प्रारूप_लिख("e\n");
#अन्यथा
   प्रारूप_लिख("f\n");
#यदि_अन्तः
#अन्यथा
#यदि 1
   प्रारूप_लिख("g\n");
#अन्यथा
   प्रारूप_लिख("h\n");
#यदि_अन्तः
#यदि_अन्तः

#परिभाषय DEF

#यदि_परिभाषितम् DEF
#यदि_परिभाषितम् DEF
   प्रारूप_लिख("i\n");
#अन्यथा
   प्रारूप_लिख("j\n");
#यदि_अन्तः
#अन्यथा
#यदि_परिभाषितम् DEF
   प्रारूप_लिख("k\n");
#अन्यथा
   प्रारूप_लिख("l\n");
#यदि_अन्तः
#यदि_अन्तः

#यदि_अपरिभाषितम् DEF
#यदि_अपरिभाषितम् DEF
   प्रारूप_लिख("m\n");
#अन्यथा
   प्रारूप_लिख("n\n");
#यदि_अन्तः
#अन्यथा
#यदि_अपरिभाषितम् DEF
   प्रारूप_लिख("o\n");
#अन्यथा
   प्रारूप_लिख("p\n");
#यदि_अन्तः
#यदि_अन्तः

#परिभाषय ONE 1
#परिभाषय ZERO 0

#यदि ONE
#यदि ZERO
   प्रारूप_लिख("q\n");
#अन्यथा
   प्रारूप_लिख("r\n");
#यदि_अन्तः
#अन्यथा
#यदि ZERO
   प्रारूप_लिख("s\n");
#अन्यथा
   प्रारूप_लिख("t\n");
#यदि_अन्तः
#यदि_अन्तः

   प्रत्यागम 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
