#ضمن <stdio.h>

صحيح مکيه()
{
   لکو("#include test\n");

#إذا 1
#إذا 0
   لکو("a\n");
#وإلا
   لکو("b\n");
#جيڪڏهن_پورو
#وإلا
#إذا 0
   لکو("c\n");
#وإلا
   لکو("d\n");
#جيڪڏهن_پورو
#جيڪڏهن_پورو

#إذا 0
#إذا 1
   لکو("e\n");
#وإلا
   لکو("f\n");
#جيڪڏهن_پورو
#وإلا
#إذا 1
   لکو("g\n");
#وإلا
   لکو("h\n");
#جيڪڏهن_پورو
#جيڪڏهن_پورو

#وصف_ڪريو DEF

#جيڪڏهن_وصف_ٿيل DEF
#جيڪڏهن_وصف_ٿيل DEF
   لکو("i\n");
#وإلا
   لکو("j\n");
#جيڪڏهن_پورو
#وإلا
#جيڪڏهن_وصف_ٿيل DEF
   لکو("k\n");
#وإلا
   لکو("l\n");
#جيڪڏهن_پورو
#جيڪڏهن_پورو

#جيڪڏهن_وصف_نه_ٿيل DEF
#جيڪڏهن_وصف_نه_ٿيل DEF
   لکو("m\n");
#وإلا
   لکو("n\n");
#جيڪڏهن_پورو
#وإلا
#جيڪڏهن_وصف_نه_ٿيل DEF
   لکو("o\n");
#وإلا
   لکو("p\n");
#جيڪڏهن_پورو
#جيڪڏهن_پورو

#وصف_ڪريو ONE 1
#وصف_ڪريو ZERO 0

#إذا ONE
#إذا ZERO
   لکو("q\n");
#وإلا
   لکو("r\n");
#جيڪڏهن_پورو
#وإلا
#إذا ZERO
   لکو("s\n");
#وإلا
   لکو("t\n");
#جيڪڏهن_پورو
#جيڪڏهن_پورو

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
