#شامل <stdio.h>

صحیح مین()
{
   لکھو("#include test\n");

#اگر 1
#اگر 0
   لکھو("a\n");
#ورنہ
   لکھو("b\n");
#اگر_ختم
#ورنہ
#اگر 0
   لکھو("c\n");
#ورنہ
   لکھو("d\n");
#اگر_ختم
#اگر_ختم

#اگر 0
#اگر 1
   لکھو("e\n");
#ورنہ
   لکھو("f\n");
#اگر_ختم
#ورنہ
#اگر 1
   لکھو("g\n");
#ورنہ
   لکھو("h\n");
#اگر_ختم
#اگر_ختم

#تعریف_کرو DEF

#اگر_تعریف_شدہ DEF
#اگر_تعریف_شدہ DEF
   لکھو("i\n");
#ورنہ
   لکھو("j\n");
#اگر_ختم
#ورنہ
#اگر_تعریف_شدہ DEF
   لکھو("k\n");
#ورنہ
   لکھو("l\n");
#اگر_ختم
#اگر_ختم

#اگر_غیر_تعریف_شدہ DEF
#اگر_غیر_تعریف_شدہ DEF
   لکھو("m\n");
#ورنہ
   لکھو("n\n");
#اگر_ختم
#ورنہ
#اگر_غیر_تعریف_شدہ DEF
   لکھو("o\n");
#ورنہ
   لکھو("p\n");
#اگر_ختم
#اگر_ختم

#تعریف_کرو ONE 1
#تعریف_کرو ZERO 0

#اگر ONE
#اگر ZERO
   لکھو("q\n");
#ورنہ
   لکھو("r\n");
#اگر_ختم
#ورنہ
#اگر ZERO
   لکھو("s\n");
#ورنہ
   لکھو("t\n");
#اگر_ختم
#اگر_ختم

   واپس 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
