#समावेश <stdio.h>

पूर्णांक मुख्य()
{
   म_लिखो("#include test\n");

#अगर 1
#अगर 0
   म_लिखो("a\n");
#अन्यथा
   म_लिखो("b\n");
#पूर्ण_अगर
#अन्यथा
#अगर 0
   म_लिखो("c\n");
#अन्यथा
   म_लिखो("d\n");
#पूर्ण_अगर
#पूर्ण_अगर

#अगर 0
#अगर 1
   म_लिखो("e\n");
#अन्यथा
   म_लिखो("f\n");
#पूर्ण_अगर
#अन्यथा
#अगर 1
   म_लिखो("g\n");
#अन्यथा
   म_लिखो("h\n");
#पूर्ण_अगर
#पूर्ण_अगर

#घोषणा DEF

#अगर_घोषित DEF
#अगर_घोषित DEF
   म_लिखो("i\n");
#अन्यथा
   म_लिखो("j\n");
#पूर्ण_अगर
#अन्यथा
#अगर_घोषित DEF
   म_लिखो("k\n");
#अन्यथा
   म_लिखो("l\n");
#पूर्ण_अगर
#पूर्ण_अगर

#अगर_अघोषित DEF
#अगर_अघोषित DEF
   म_लिखो("m\n");
#अन्यथा
   म_लिखो("n\n");
#पूर्ण_अगर
#अन्यथा
#अगर_अघोषित DEF
   म_लिखो("o\n");
#अन्यथा
   म_लिखो("p\n");
#पूर्ण_अगर
#पूर्ण_अगर

#घोषणा ONE 1
#घोषणा ZERO 0

#अगर ONE
#अगर ZERO
   म_लिखो("q\n");
#अन्यथा
   म_लिखो("r\n");
#पूर्ण_अगर
#अन्यथा
#अगर ZERO
   म_लिखो("s\n");
#अन्यथा
   म_लिखो("t\n");
#पूर्ण_अगर
#पूर्ण_अगर

   वापस 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
