#అన్తర్భావ <stdio.h>

పూర్ణాంకం ప్రధాన()
{
   రాయి("#include test\n");

#ఒకవేళ 1
#ఒకవేళ 0
   రాయి("a\n");
#లేకపోతే
   రాయి("b\n");
#అయితే_ముగింపు
#లేకపోతే
#ఒకవేళ 0
   రాయి("c\n");
#లేకపోతే
   రాయి("d\n");
#అయితే_ముగింపు
#అయితే_ముగింపు

#ఒకవేళ 0
#ఒకవేళ 1
   రాయి("e\n");
#లేకపోతే
   రాయి("f\n");
#అయితే_ముగింపు
#లేకపోతే
#ఒకవేళ 1
   రాయి("g\n");
#లేకపోతే
   రాయి("h\n");
#అయితే_ముగింపు
#అయితే_ముగింపు

#నిర్వచించు DEF

#నిర్వచితమైతే DEF
#నిర్వచితమైతే DEF
   రాయి("i\n");
#లేకపోతే
   రాయి("j\n");
#అయితే_ముగింపు
#లేకపోతే
#నిర్వచితమైతే DEF
   రాయి("k\n");
#లేకపోతే
   రాయి("l\n");
#అయితే_ముగింపు
#అయితే_ముగింపు

#నిర్వచితం_కాకపోతే DEF
#నిర్వచితం_కాకపోతే DEF
   రాయి("m\n");
#లేకపోతే
   రాయి("n\n");
#అయితే_ముగింపు
#లేకపోతే
#నిర్వచితం_కాకపోతే DEF
   రాయి("o\n");
#లేకపోతే
   రాయి("p\n");
#అయితే_ముగింపు
#అయితే_ముగింపు

#నిర్వచించు ONE 1
#నిర్వచించు ZERO 0

#ఒకవేళ ONE
#ఒకవేళ ZERO
   రాయి("q\n");
#లేకపోతే
   రాయి("r\n");
#అయితే_ముగింపు
#లేకపోతే
#ఒకవేళ ZERO
   రాయి("s\n");
#లేకపోతే
   రాయి("t\n");
#అయితే_ముగింపు
#అయితే_ముగింపు

   తిరిగి 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
