#अन्तर्भाव <stdio.h>

पूर्णाङ्क fred()
{
   म_लिखो("fred\n");
   फर्काऊ 0;
}

पूर्णाङ्क joe()
{
   म_लिखो("joe\n");
   फर्काऊ 1;
}

पूर्णाङ्क main()
{
   म_लिखो("%d\n", fred() && joe());
   म_लिखो("%d\n", fred() || joe());
   म_लिखो("%d\n", joe() && fred());
   म_लिखो("%d\n", joe() || fred());
   म_लिखो("%d\n", fred() && (1 + joe()));
   म_लिखो("%d\n", fred() || (0 + joe()));
   म_लिखो("%d\n", joe() && (0 + fred()));
   म_लिखो("%d\n", joe() || (1 + fred()));

   फर्काऊ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
