#अन्तर्भाव <stdio.h>

पूर्णाङ्क fred()
{
   प्रारूप_लिख("fred\n");
   प्रत्यागम 0;
}

पूर्णाङ्क joe()
{
   प्रारूप_लिख("joe\n");
   प्रत्यागम 1;
}

पूर्णाङ्क मुख्यम्()
{
   प्रारूप_लिख("%d\n", fred() && joe());
   प्रारूप_लिख("%d\n", fred() || joe());
   प्रारूप_लिख("%d\n", joe() && fred());
   प्रारूप_लिख("%d\n", joe() || fred());
   प्रारूप_लिख("%d\n", fred() && (1 + joe()));
   प्रारूप_लिख("%d\n", fred() || (0 + joe()));
   प्रारूप_लिख("%d\n", joe() && (0 + fred()));
   प्रारूप_लिख("%d\n", joe() || (1 + fred()));

   प्रत्यागम 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
