#ضمن <stdio.h>

صحيح fred()
{
   چاپ_کړه("fred\n");
   أرجع 0;
}

صحيح joe()
{
   چاپ_کړه("joe\n");
   أرجع 1;
}

صحيح اصلي()
{
   چاپ_کړه("%d\n", fred() && joe());
   چاپ_کړه("%d\n", fred() || joe());
   چاپ_کړه("%d\n", joe() && fred());
   چاپ_کړه("%d\n", joe() || fred());
   چاپ_کړه("%d\n", fred() && (1 + joe()));
   چاپ_کړه("%d\n", fred() || (0 + joe()));
   چاپ_کړه("%d\n", joe() && (0 + fred()));
   چاپ_کړه("%d\n", joe() || (1 + fred()));

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
