#అన్తర్భావ <stdio.h>

పూర్ణాంకం fred()
{
   రాయి("fred\n");
   తిరిగి 0;
}

పూర్ణాంకం joe()
{
   రాయి("joe\n");
   తిరిగి 1;
}

పూర్ణాంకం ప్రధాన()
{
   రాయి("%d\n", fred() && joe());
   రాయి("%d\n", fred() || joe());
   రాయి("%d\n", joe() && fred());
   రాయి("%d\n", joe() || fred());
   రాయి("%d\n", fred() && (1 + joe()));
   రాయి("%d\n", fred() || (0 + joe()));
   రాయి("%d\n", joe() && (0 + fred()));
   రాయి("%d\n", joe() || (1 + fred()));

   తిరిగి 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
