#अन्तर्भाव <stdio.h>

शून्य fred()
{
   प्रारूप_लिख("In fred()\n");
   गच्छ समाप्तम्;
   प्रारूप_लिख("In middle\n");
समाप्तम्:
   प्रारूप_लिख("At end\n");
}

शून्य joe()
{
   पूर्णाङ्क b = 5678;

   प्रारूप_लिख("In joe()\n");

   {
      पूर्णाङ्क c = 1234;
      प्रारूप_लिख("c = %d\n", c);
      गच्छ outer;
      प्रारूप_लिख("uh-oh\n");
   }

outer:    

   प्रारूप_लिख("done\n");
}

शून्य henry()
{
   पूर्णाङ्क a;

   प्रारूप_लिख("In henry()\n");
   गच्छ inner;

   {
      पूर्णाङ्क b;
inner:    
      b = 1234;
      प्रारूप_लिख("b = %d\n", b);
   }

   प्रारूप_लिख("done\n");
}

पूर्णाङ्क मुख्यम्()
{
   fred();
   joe();
   henry();

   प्रत्यागम 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
