#अन्तर्भाव <stdio.h>

/* This was first introduced to test the ARM port */

#परिभाषय UINT_MAX ((अचिह्नित) -1)

पूर्णाङ्क मुख्यम्()
{
    प्रारूप_लिख("18/21=%u\n", 18/21);
    प्रारूप_लिख("18%%21=%u\n", 18%21);
    प्रारूप_लिख("41/21=%u\n", 41/21);
    प्रारूप_लिख("41%%21=%u\n", 41%21);
    प्रारूप_लिख("42/21=%u\n", 42/21);
    प्रारूप_लिख("42%%21=%u\n", 42%21);
    प्रारूप_लिख("43/21=%u\n", 43/21);
    प्रारूप_लिख("43%%21=%u\n", 43%21);
    प्रारूप_लिख("126/21=%u\n", 126/21);
    प्रारूप_लिख("126%%21=%u\n", 126%21);
    प्रारूप_लिख("131/21=%u\n", 131/21);
    प्रारूप_लिख("131%%21=%u\n", 131%21);
    प्रारूप_लिख("(UINT_MAX/2+3)/2=%u\n", (UINT_MAX/2+3)/2);
    प्रारूप_लिख("(UINT_MAX/2+3)%%2=%u\n", (UINT_MAX/2+3)%2);

    प्रारूप_लिख("18/-21=%u\n", 18/-21);
    प्रारूप_लिख("18%%-21=%u\n", 18%-21);
    प्रारूप_लिख("41/-21=%u\n", 41/-21);
    प्रारूप_लिख("41%%-21=%u\n", 41%-21);
    प्रारूप_लिख("42/-21=%u\n", 42/-21);
    प्रारूप_लिख("42%%-21=%u\n", 42%-21);
    प्रारूप_लिख("43/-21=%u\n", 43/-21);
    प्रारूप_लिख("43%%-21=%u\n", 43%-21);
    प्रारूप_लिख("126/-21=%u\n", 126/-21);
    प्रारूप_लिख("126%%-21=%u\n", 126%-21);
    प्रारूप_लिख("131/-21=%u\n", 131/-21);
    प्रारूप_लिख("131%%-21=%u\n", 131%-21);
    प्रारूप_लिख("(UINT_MAX/2+3)/-2=%u\n", (UINT_MAX/2+3)/-2);
    प्रारूप_लिख("(UINT_MAX/2+3)%%-2=%u\n", (UINT_MAX/2+3)%-2);

    प्रारूप_लिख("-18/21=%u\n", -18/21);
    प्रारूप_लिख("-18%%21=%u\n", -18%21);
    प्रारूप_लिख("-41/21=%u\n", -41/21);
    प्रारूप_लिख("-41%%21=%u\n", -41%21);
    प्रारूप_लिख("-42/21=%u\n", -42/21);
    प्रारूप_लिख("-42%%21=%u\n", -42%21);
    प्रारूप_लिख("-43/21=%u\n", -43/21);
    प्रारूप_लिख("-43%%21=%u\n", -43%21);
    प्रारूप_लिख("-126/21=%u\n", -126/21);
    प्रारूप_लिख("-126%%21=%u\n", -126%21);
    प्रारूप_लिख("-131/21=%u\n", -131/21);
    प्रारूप_लिख("-131%%21=%u\n", -131%21);
    प्रारूप_लिख("-(UINT_MAX/2+3)/2=%u\n", (0-(UINT_MAX/2+3))/2);
    प्रारूप_लिख("-(UINT_MAX/2+3)%%2=%u\n", (0-(UINT_MAX/2+3))%2);

    प्रारूप_लिख("-18/-21=%u\n", -18/-21);
    प्रारूप_लिख("-18%%-21=%u\n", -18%-21);
    प्रारूप_लिख("-41/-21=%u\n", -41/-21);
    प्रारूप_लिख("-41%%-21=%u\n", -41%-21);
    प्रारूप_लिख("-42/-21=%u\n", -42/-21);
    प्रारूप_लिख("-42%%-21=%u\n", -42%-21);
    प्रारूप_लिख("-43/-21=%u\n", -43/-21);
    प्रारूप_लिख("-43%%-21=%u\n", -43%-21);
    प्रारूप_लिख("-126/-21=%u\n", -126/-21);
    प्रारूप_लिख("-126%%-21=%u\n", -126%-21);
    प्रारूप_लिख("-131/-21=%u\n", -131/-21);
    प्रारूप_लिख("-131%%-21=%u\n", -131%-21);
    प्रारूप_लिख("-(UINT_MAX/2+3)/-2=%u\n", (0-(UINT_MAX/2+3))/-2);
    प्रारूप_लिख("-(UINT_MAX/2+3)%%-2=%u\n", (0-(UINT_MAX/2+3))%-2);

    प्रत्यागम 0;
}
