#अन्तर्भाव <stdio.h>

/* This was first introduced to test the ARM port */

#define अच_पूर्णांक_उच्च ((अचिन्हित) -1)

पूर्णांक main()
{
    म_लिखो("18/21=%u\n", 18/21);
    म_लिखो("18%%21=%u\n", 18%21);
    म_लिखो("41/21=%u\n", 41/21);
    म_लिखो("41%%21=%u\n", 41%21);
    म_लिखो("42/21=%u\n", 42/21);
    म_लिखो("42%%21=%u\n", 42%21);
    म_लिखो("43/21=%u\n", 43/21);
    म_लिखो("43%%21=%u\n", 43%21);
    म_लिखो("126/21=%u\n", 126/21);
    म_लिखो("126%%21=%u\n", 126%21);
    म_लिखो("131/21=%u\n", 131/21);
    म_लिखो("131%%21=%u\n", 131%21);
    म_लिखो("(UINT_MAX/2+3)/2=%u\n", (अच_पूर्णांक_उच्च/2+3)/2);
    म_लिखो("(UINT_MAX/2+3)%%2=%u\n", (अच_पूर्णांक_उच्च/2+3)%2);

    म_लिखो("18/-21=%u\n", 18/-21);
    म_लिखो("18%%-21=%u\n", 18%-21);
    म_लिखो("41/-21=%u\n", 41/-21);
    म_लिखो("41%%-21=%u\n", 41%-21);
    म_लिखो("42/-21=%u\n", 42/-21);
    म_लिखो("42%%-21=%u\n", 42%-21);
    म_लिखो("43/-21=%u\n", 43/-21);
    म_लिखो("43%%-21=%u\n", 43%-21);
    म_लिखो("126/-21=%u\n", 126/-21);
    म_लिखो("126%%-21=%u\n", 126%-21);
    म_लिखो("131/-21=%u\n", 131/-21);
    म_लिखो("131%%-21=%u\n", 131%-21);
    म_लिखो("(UINT_MAX/2+3)/-2=%u\n", (अच_पूर्णांक_उच्च/2+3)/-2);
    म_लिखो("(UINT_MAX/2+3)%%-2=%u\n", (अच_पूर्णांक_उच्च/2+3)%-2);

    म_लिखो("-18/21=%u\n", -18/21);
    म_लिखो("-18%%21=%u\n", -18%21);
    म_लिखो("-41/21=%u\n", -41/21);
    म_लिखो("-41%%21=%u\n", -41%21);
    म_लिखो("-42/21=%u\n", -42/21);
    म_लिखो("-42%%21=%u\n", -42%21);
    म_लिखो("-43/21=%u\n", -43/21);
    म_लिखो("-43%%21=%u\n", -43%21);
    म_लिखो("-126/21=%u\n", -126/21);
    म_लिखो("-126%%21=%u\n", -126%21);
    म_लिखो("-131/21=%u\n", -131/21);
    म_लिखो("-131%%21=%u\n", -131%21);
    म_लिखो("-(UINT_MAX/2+3)/2=%u\n", (0-(अच_पूर्णांक_उच्च/2+3))/2);
    म_लिखो("-(UINT_MAX/2+3)%%2=%u\n", (0-(अच_पूर्णांक_उच्च/2+3))%2);

    म_लिखो("-18/-21=%u\n", -18/-21);
    म_लिखो("-18%%-21=%u\n", -18%-21);
    म_लिखो("-41/-21=%u\n", -41/-21);
    म_लिखो("-41%%-21=%u\n", -41%-21);
    म_लिखो("-42/-21=%u\n", -42/-21);
    म_लिखो("-42%%-21=%u\n", -42%-21);
    म_लिखो("-43/-21=%u\n", -43/-21);
    म_लिखो("-43%%-21=%u\n", -43%-21);
    म_लिखो("-126/-21=%u\n", -126/-21);
    म_लिखो("-126%%-21=%u\n", -126%-21);
    म_लिखो("-131/-21=%u\n", -131/-21);
    म_लिखो("-131%%-21=%u\n", -131%-21);
    म_लिखो("-(UINT_MAX/2+3)/-2=%u\n", (0-(अच_पूर्णांक_उच्च/2+3))/-2);
    म_लिखो("-(UINT_MAX/2+3)%%-2=%u\n", (0-(अच_पूर्णांक_उच्च/2+3))%-2);

    परत 0;
}
