#ضمن <stdio.h>

/* This was first introduced to test the ARM port */

#تعریف_کړه UINT_MAX ((بینښه) -1)

صحيح اصلي()
{
    چاپ_کړه("18/21=%u\n", 18/21);
    چاپ_کړه("18%%21=%u\n", 18%21);
    چاپ_کړه("41/21=%u\n", 41/21);
    چاپ_کړه("41%%21=%u\n", 41%21);
    چاپ_کړه("42/21=%u\n", 42/21);
    چاپ_کړه("42%%21=%u\n", 42%21);
    چاپ_کړه("43/21=%u\n", 43/21);
    چاپ_کړه("43%%21=%u\n", 43%21);
    چاپ_کړه("126/21=%u\n", 126/21);
    چاپ_کړه("126%%21=%u\n", 126%21);
    چاپ_کړه("131/21=%u\n", 131/21);
    چاپ_کړه("131%%21=%u\n", 131%21);
    چاپ_کړه("(UINT_MAX/2+3)/2=%u\n", (UINT_MAX/2+3)/2);
    چاپ_کړه("(UINT_MAX/2+3)%%2=%u\n", (UINT_MAX/2+3)%2);

    چاپ_کړه("18/-21=%u\n", 18/-21);
    چاپ_کړه("18%%-21=%u\n", 18%-21);
    چاپ_کړه("41/-21=%u\n", 41/-21);
    چاپ_کړه("41%%-21=%u\n", 41%-21);
    چاپ_کړه("42/-21=%u\n", 42/-21);
    چاپ_کړه("42%%-21=%u\n", 42%-21);
    چاپ_کړه("43/-21=%u\n", 43/-21);
    چاپ_کړه("43%%-21=%u\n", 43%-21);
    چاپ_کړه("126/-21=%u\n", 126/-21);
    چاپ_کړه("126%%-21=%u\n", 126%-21);
    چاپ_کړه("131/-21=%u\n", 131/-21);
    چاپ_کړه("131%%-21=%u\n", 131%-21);
    چاپ_کړه("(UINT_MAX/2+3)/-2=%u\n", (UINT_MAX/2+3)/-2);
    چاپ_کړه("(UINT_MAX/2+3)%%-2=%u\n", (UINT_MAX/2+3)%-2);

    چاپ_کړه("-18/21=%u\n", -18/21);
    چاپ_کړه("-18%%21=%u\n", -18%21);
    چاپ_کړه("-41/21=%u\n", -41/21);
    چاپ_کړه("-41%%21=%u\n", -41%21);
    چاپ_کړه("-42/21=%u\n", -42/21);
    چاپ_کړه("-42%%21=%u\n", -42%21);
    چاپ_کړه("-43/21=%u\n", -43/21);
    چاپ_کړه("-43%%21=%u\n", -43%21);
    چاپ_کړه("-126/21=%u\n", -126/21);
    چاپ_کړه("-126%%21=%u\n", -126%21);
    چاپ_کړه("-131/21=%u\n", -131/21);
    چاپ_کړه("-131%%21=%u\n", -131%21);
    چاپ_کړه("-(UINT_MAX/2+3)/2=%u\n", (0-(UINT_MAX/2+3))/2);
    چاپ_کړه("-(UINT_MAX/2+3)%%2=%u\n", (0-(UINT_MAX/2+3))%2);

    چاپ_کړه("-18/-21=%u\n", -18/-21);
    چاپ_کړه("-18%%-21=%u\n", -18%-21);
    چاپ_کړه("-41/-21=%u\n", -41/-21);
    چاپ_کړه("-41%%-21=%u\n", -41%-21);
    چاپ_کړه("-42/-21=%u\n", -42/-21);
    چاپ_کړه("-42%%-21=%u\n", -42%-21);
    چاپ_کړه("-43/-21=%u\n", -43/-21);
    چاپ_کړه("-43%%-21=%u\n", -43%-21);
    چاپ_کړه("-126/-21=%u\n", -126/-21);
    چاپ_کړه("-126%%-21=%u\n", -126%-21);
    چاپ_کړه("-131/-21=%u\n", -131/-21);
    چاپ_کړه("-131%%-21=%u\n", -131%-21);
    چاپ_کړه("-(UINT_MAX/2+3)/-2=%u\n", (0-(UINT_MAX/2+3))/-2);
    چاپ_کړه("-(UINT_MAX/2+3)%%-2=%u\n", (0-(UINT_MAX/2+3))%-2);

    أرجع 0;
}
