#समावेश <stdio.h>

पूर्णांक मुख्य()
{
    /* decimal floating constant */
    भग्न fa0 = .123f;
    भग्न fa1 = .123E12F;
    भग्न fa2 = .123e-12f;
    भग्न fa3 = .123e+12f;
    म_लिखो("%f\n%f\n%f\n%f\n\n", fa0, fa1, fa2, fa3);

    भग्न fb0 = 123.123f;
    भग्न fb1 = 123.123E12F;
    भग्न fb2 = 123.123e-12f;
    भग्न fb3 = 123.123e+12f;
    म_लिखो("%f\n%f\n%f\n%f\n\n", fb0, fb1, fb2, fb3);

    भग्न fc0 = 123.f;
    भग्न fc1 = 123.E12F;
    भग्न fc2 = 123.e-12f;
    भग्न fc3 = 123.e+12f;
    म_लिखो("%f\n%f\n%f\n%f\n\n", fc0, fc1, fc2, fc3);

    भग्न fd0 = 123E12F;
    भग्न fd1 = 123e-12f;
    भग्न fd2 = 123e+12f;
    म_लिखो("%f\n%f\n%f\n\n", fd0, fd1, fd2);
    म_लिखो("\n");

    /* hexadecimal floating constant */
    द्विगुन da0 = 0X.1ACP12;
    द्विगुन da1 = 0x.1acp-12;
    द्विगुन da2 = 0x.1acp+12;
    द्विगुन da3 = 0x1.00000000000000000000000000000000000000000000p+12;
    द्विगुन da4 = 0x1000000000000000000000000000000000000000000000p-140;
    म_लिखो("%f\n%f\n%f\n%f\n%f\n\n", da0, da1, da2, da3, da4);

    द्विगुन db0 = 0X1AC.BDP12;
    द्विगुन db1 = 0x1ac.bdp-12;
    द्विगुन db2 = 0x1ac.dbp+12;
    म_लिखो("%f\n%f\n%f\n\n", db0, db1, db2);

    द्विगुन dc0 = 0X1AC.P12;
    द्विगुन dc1 = 0x1ac.p-12;
    द्विगुन dc2 = 0x1ac.p+12;
    म_लिखो("%f\n%f\n%f\n\n", dc0, dc1, dc2);

    द्विगुन dd0 = 0X1ACP12;
    द्विगुन dd1 = 0x1acp-12;
    द्विगुन dd2 = 0x1acp+12;
    म_लिखो("%f\n%f\n%f\n\n", dd0, dd1, dd2);
    म_लिखो("\n");

#अगर_घोषित __TINYC__
    /* TCC extension
       binary floating constant */
    दीर्घ द्विगुन la0 = 0B.110101100P12L;
    दीर्घ द्विगुन la1 = 0b.110101100p-12l;
    दीर्घ द्विगुन la2 = 0b.110101100p+12l;
    म_लिखो("%Lf\n%Lf\n%Lf\n\n", la0, la1, la2);

    दीर्घ द्विगुन lb0 = 0B110101100.10111101P12L;
    दीर्घ द्विगुन lb1 = 0b110101100.10111101p-12l;
    दीर्घ द्विगुन lb2 = 0b110101100.10111101p+12l;
    म_लिखो("%Lf\n%Lf\n%Lf\n\n", lb0, lb1, lb2);

    दीर्घ द्विगुन lc0 = 0B110101100.P12L;
    दीर्घ द्विगुन lc1 = 0b110101100.p-12l;
    दीर्घ द्विगुन lc2 = 0b110101100.p+12l;
    म_लिखो("%Lf\n%Lf\n%Lf\n\n", lc0, lc1, lc2);

    दीर्घ द्विगुन ld0 = 0B110101100P12L;
    दीर्घ द्विगुन ld1 = 0b110101100p-12l;
    दीर्घ द्विगुन ld2 = 0b110101100p+12l;
    म_लिखो("%Lf\n%Lf\n%Lf\n\n", ld0, ld1, ld2);
#पूर्ण_अगर

    वापस 0;
}
