#अन्तर्भाव <stdio.h>

पूर्णांक main()
{
    /* decimal floating constant */
    दशांश fa0 = .123f;
    दशांश fa1 = .123E12F;
    दशांश fa2 = .123e-12f;
    दशांश fa3 = .123e+12f;
    म_लिखो("%f\n%f\n%f\n%f\n\n", fa0, fa1, fa2, fa3);

    दशांश fb0 = 123.123f;
    दशांश fb1 = 123.123E12F;
    दशांश fb2 = 123.123e-12f;
    दशांश fb3 = 123.123e+12f;
    म_लिखो("%f\n%f\n%f\n%f\n\n", fb0, fb1, fb2, fb3);

    दशांश fc0 = 123.f;
    दशांश fc1 = 123.E12F;
    दशांश fc2 = 123.e-12f;
    दशांश fc3 = 123.e+12f;
    म_लिखो("%f\n%f\n%f\n%f\n\n", fc0, fc1, fc2, fc3);

    दशांश fd0 = 123E12F;
    दशांश fd1 = 123e-12f;
    दशांश fd2 = 123e+12f;
    म_लिखो("%f\n%f\n%f\n\n", fd0, fd1, fd2);
    म_लिखो("\n");

    /* hexadecimal floating constant */
    द्विगुण da0 = 0X.1ACP12;
    द्विगुण da1 = 0x.1acp-12;
    द्विगुण da2 = 0x.1acp+12;
    द्विगुण da3 = 0x1.00000000000000000000000000000000000000000000p+12;
    द्विगुण da4 = 0x1000000000000000000000000000000000000000000000p-140;
    म_लिखो("%f\n%f\n%f\n%f\n%f\n\n", da0, da1, da2, da3, da4);

    द्विगुण db0 = 0X1AC.BDP12;
    द्विगुण db1 = 0x1ac.bdp-12;
    द्विगुण db2 = 0x1ac.dbp+12;
    म_लिखो("%f\n%f\n%f\n\n", db0, db1, db2);

    द्विगुण dc0 = 0X1AC.P12;
    द्विगुण dc1 = 0x1ac.p-12;
    द्विगुण dc2 = 0x1ac.p+12;
    म_लिखो("%f\n%f\n%f\n\n", dc0, dc1, dc2);

    द्विगुण dd0 = 0X1ACP12;
    द्विगुण dd1 = 0x1acp-12;
    द्विगुण dd2 = 0x1acp+12;
    म_लिखो("%f\n%f\n%f\n\n", dd0, dd1, dd2);
    म_लिखो("\n");

#ifdef __TINYC__
    /* TCC extension
       binary floating constant */
    दीर्घ द्विगुण la0 = 0B.110101100P12L;
    दीर्घ द्विगुण la1 = 0b.110101100p-12l;
    दीर्घ द्विगुण la2 = 0b.110101100p+12l;
    म_लिखो("%Lf\n%Lf\n%Lf\n\n", la0, la1, la2);

    दीर्घ द्विगुण lb0 = 0B110101100.10111101P12L;
    दीर्घ द्विगुण lb1 = 0b110101100.10111101p-12l;
    दीर्घ द्विगुण lb2 = 0b110101100.10111101p+12l;
    म_लिखो("%Lf\n%Lf\n%Lf\n\n", lb0, lb1, lb2);

    दीर्घ द्विगुण lc0 = 0B110101100.P12L;
    दीर्घ द्विगुण lc1 = 0b110101100.p-12l;
    दीर्घ द्विगुण lc2 = 0b110101100.p+12l;
    म_लिखो("%Lf\n%Lf\n%Lf\n\n", lc0, lc1, lc2);

    दीर्घ द्विगुण ld0 = 0B110101100P12L;
    दीर्घ द्विगुण ld1 = 0b110101100p-12l;
    दीर्घ द्विगुण ld2 = 0b110101100p+12l;
    म_लिखो("%Lf\n%Lf\n%Lf\n\n", ld0, ld1, ld2);
#endif

    परत 0;
}
