#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

ਪੂਰਨ ਮੁੱਖ()
{
    /* decimal floating constant */
    ਦਸ਼ਮਲਵ fa0 = .123f;
    ਦਸ਼ਮਲਵ fa1 = .123E12F;
    ਦਸ਼ਮਲਵ fa2 = .123e-12f;
    ਦਸ਼ਮਲਵ fa3 = .123e+12f;
    ਲਿਖੋ("%f\n%f\n%f\n%f\n\n", fa0, fa1, fa2, fa3);

    ਦਸ਼ਮਲਵ fb0 = 123.123f;
    ਦਸ਼ਮਲਵ fb1 = 123.123E12F;
    ਦਸ਼ਮਲਵ fb2 = 123.123e-12f;
    ਦਸ਼ਮਲਵ fb3 = 123.123e+12f;
    ਲਿਖੋ("%f\n%f\n%f\n%f\n\n", fb0, fb1, fb2, fb3);

    ਦਸ਼ਮਲਵ fc0 = 123.f;
    ਦਸ਼ਮਲਵ fc1 = 123.E12F;
    ਦਸ਼ਮਲਵ fc2 = 123.e-12f;
    ਦਸ਼ਮਲਵ fc3 = 123.e+12f;
    ਲਿਖੋ("%f\n%f\n%f\n%f\n\n", fc0, fc1, fc2, fc3);

    ਦਸ਼ਮਲਵ fd0 = 123E12F;
    ਦਸ਼ਮਲਵ fd1 = 123e-12f;
    ਦਸ਼ਮਲਵ fd2 = 123e+12f;
    ਲਿਖੋ("%f\n%f\n%f\n\n", fd0, fd1, fd2);
    ਲਿਖੋ("\n");

    /* hexadecimal floating constant */
    ਦੁੱਗਣਾ da0 = 0X.1ACP12;
    ਦੁੱਗਣਾ da1 = 0x.1acp-12;
    ਦੁੱਗਣਾ da2 = 0x.1acp+12;
    ਦੁੱਗਣਾ da3 = 0x1.00000000000000000000000000000000000000000000p+12;
    ਦੁੱਗਣਾ da4 = 0x1000000000000000000000000000000000000000000000p-140;
    ਲਿਖੋ("%f\n%f\n%f\n%f\n%f\n\n", da0, da1, da2, da3, da4);

    ਦੁੱਗਣਾ db0 = 0X1AC.BDP12;
    ਦੁੱਗਣਾ db1 = 0x1ac.bdp-12;
    ਦੁੱਗਣਾ db2 = 0x1ac.dbp+12;
    ਲਿਖੋ("%f\n%f\n%f\n\n", db0, db1, db2);

    ਦੁੱਗਣਾ dc0 = 0X1AC.P12;
    ਦੁੱਗਣਾ dc1 = 0x1ac.p-12;
    ਦੁੱਗਣਾ dc2 = 0x1ac.p+12;
    ਲਿਖੋ("%f\n%f\n%f\n\n", dc0, dc1, dc2);

    ਦੁੱਗਣਾ dd0 = 0X1ACP12;
    ਦੁੱਗਣਾ dd1 = 0x1acp-12;
    ਦੁੱਗਣਾ dd2 = 0x1acp+12;
    ਲਿਖੋ("%f\n%f\n%f\n\n", dd0, dd1, dd2);
    ਲਿਖੋ("\n");

#ਜੇ_ਪਰਿਭਾਸ਼ਿਤ __TINYC__
    /* TCC extension
       binary floating constant */
    ਲੰਮਾ ਦੁੱਗਣਾ la0 = 0B.110101100P12L;
    ਲੰਮਾ ਦੁੱਗਣਾ la1 = 0b.110101100p-12l;
    ਲੰਮਾ ਦੁੱਗਣਾ la2 = 0b.110101100p+12l;
    ਲਿਖੋ("%Lf\n%Lf\n%Lf\n\n", la0, la1, la2);

    ਲੰਮਾ ਦੁੱਗਣਾ lb0 = 0B110101100.10111101P12L;
    ਲੰਮਾ ਦੁੱਗਣਾ lb1 = 0b110101100.10111101p-12l;
    ਲੰਮਾ ਦੁੱਗਣਾ lb2 = 0b110101100.10111101p+12l;
    ਲਿਖੋ("%Lf\n%Lf\n%Lf\n\n", lb0, lb1, lb2);

    ਲੰਮਾ ਦੁੱਗਣਾ lc0 = 0B110101100.P12L;
    ਲੰਮਾ ਦੁੱਗਣਾ lc1 = 0b110101100.p-12l;
    ਲੰਮਾ ਦੁੱਗਣਾ lc2 = 0b110101100.p+12l;
    ਲਿਖੋ("%Lf\n%Lf\n%Lf\n\n", lc0, lc1, lc2);

    ਲੰਮਾ ਦੁੱਗਣਾ ld0 = 0B110101100P12L;
    ਲੰਮਾ ਦੁੱਗਣਾ ld1 = 0b110101100p-12l;
    ਲੰਮਾ ਦੁੱਗਣਾ ld2 = 0b110101100p+12l;
    ਲਿਖੋ("%Lf\n%Lf\n%Lf\n\n", ld0, ld1, ld2);
#ਜੇ_ਅੰਤ

    ਵਾਪਸ 0;
}
