#شامل <stdio.h>

صحیح مین()
{
    /* decimal floating constant */
    اعشاری fa0 = .123f;
    اعشاری fa1 = .123E12F;
    اعشاری fa2 = .123e-12f;
    اعشاری fa3 = .123e+12f;
    لکھو("%f\n%f\n%f\n%f\n\n", fa0, fa1, fa2, fa3);

    اعشاری fb0 = 123.123f;
    اعشاری fb1 = 123.123E12F;
    اعشاری fb2 = 123.123e-12f;
    اعشاری fb3 = 123.123e+12f;
    لکھو("%f\n%f\n%f\n%f\n\n", fb0, fb1, fb2, fb3);

    اعشاری fc0 = 123.f;
    اعشاری fc1 = 123.E12F;
    اعشاری fc2 = 123.e-12f;
    اعشاری fc3 = 123.e+12f;
    لکھو("%f\n%f\n%f\n%f\n\n", fc0, fc1, fc2, fc3);

    اعشاری fd0 = 123E12F;
    اعشاری fd1 = 123e-12f;
    اعشاری fd2 = 123e+12f;
    لکھو("%f\n%f\n%f\n\n", fd0, fd1, fd2);
    لکھو("\n");

    /* hexadecimal floating constant */
    دوہرا da0 = 0X.1ACP12;
    دوہرا da1 = 0x.1acp-12;
    دوہرا da2 = 0x.1acp+12;
    دوہرا da3 = 0x1.00000000000000000000000000000000000000000000p+12;
    دوہرا da4 = 0x1000000000000000000000000000000000000000000000p-140;
    لکھو("%f\n%f\n%f\n%f\n%f\n\n", da0, da1, da2, da3, da4);

    دوہرا db0 = 0X1AC.BDP12;
    دوہرا db1 = 0x1ac.bdp-12;
    دوہرا db2 = 0x1ac.dbp+12;
    لکھو("%f\n%f\n%f\n\n", db0, db1, db2);

    دوہرا dc0 = 0X1AC.P12;
    دوہرا dc1 = 0x1ac.p-12;
    دوہرا dc2 = 0x1ac.p+12;
    لکھو("%f\n%f\n%f\n\n", dc0, dc1, dc2);

    دوہرا dd0 = 0X1ACP12;
    دوہرا dd1 = 0x1acp-12;
    دوہرا dd2 = 0x1acp+12;
    لکھو("%f\n%f\n%f\n\n", dd0, dd1, dd2);
    لکھو("\n");

#اگر_تعریف_شدہ __TINYC__
    /* TCC extension
       binary floating constant */
    طویل دوہرا la0 = 0B.110101100P12L;
    طویل دوہرا la1 = 0b.110101100p-12l;
    طویل دوہرا la2 = 0b.110101100p+12l;
    لکھو("%Lf\n%Lf\n%Lf\n\n", la0, la1, la2);

    طویل دوہرا lb0 = 0B110101100.10111101P12L;
    طویل دوہرا lb1 = 0b110101100.10111101p-12l;
    طویل دوہرا lb2 = 0b110101100.10111101p+12l;
    لکھو("%Lf\n%Lf\n%Lf\n\n", lb0, lb1, lb2);

    طویل دوہرا lc0 = 0B110101100.P12L;
    طویل دوہرا lc1 = 0b110101100.p-12l;
    طویل دوہرا lc2 = 0b110101100.p+12l;
    لکھو("%Lf\n%Lf\n%Lf\n\n", lc0, lc1, lc2);

    طویل دوہرا ld0 = 0B110101100P12L;
    طویل دوہرا ld1 = 0b110101100p-12l;
    طویل دوہرا ld2 = 0b110101100p+12l;
    لکھو("%Lf\n%Lf\n%Lf\n\n", ld0, ld1, ld2);
#اگر_ختم

    واپس 0;
}
