#అన్తర్భావ <stdio.h>

#నిర్వచించు $(x) x
#నిర్వచించు $fred 10
#నిర్వచించు joe$ 20
#నిర్వచించు hen$y 30

#నిర్వచించు $10(x) x*10
#నిర్వచించు _$10(x) x/10

పూర్ణాంకం ప్రధాన()
{
   రాయి("fred=%d\n", $fred);
   రాయి("joe=%d\n", joe$);
   రాయి("henry=%d\n", hen$y);

   రాయి("fred2=%d\n", $($fred));
   రాయి("joe2=%d\n", $(joe$));
   రాయి("henry2=%d\n", $(hen$y));

   రాయి("fred10=%d\n", $10($fred));
   రాయి("joe_10=%d\n", _$10(joe$));

   పూర్ణాంకం $ = 10;
   పూర్ణాంకం a100$ = 100;
   పూర్ణాంకం a$$ = 1000;
   పూర్ణాంకం a$c$b = 2121;
   పూర్ణాంకం $100 = 10000;
   స్థిరరాశి అక్షరం *$$$ = "money";

   రాయి("local=%d\n", $);
   రాయి("a100$=%d\n", a100$);
   రాయి("a$$=%d\n", a$$);
   రాయి("a$c$b=%d\n", a$c$b);
   రాయి("$100=%d\n", $100);
   రాయి("$$$=%s", $$$);

   తిరిగి 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
