#ضمن <stdio.h>

#تعریف_کن $(x) x
#تعریف_کن $fred 10
#تعریف_کن joe$ 20
#تعریف_کن hen$y 30

#تعریف_کن $10(x) x*10
#تعریف_کن _$10(x) x/10

صحيح اصلی()
{
   چاپ_کن("fred=%d\n", $fred);
   چاپ_کن("joe=%d\n", joe$);
   چاپ_کن("henry=%d\n", hen$y);

   چاپ_کن("fred2=%d\n", $($fred));
   چاپ_کن("joe2=%d\n", $(joe$));
   چاپ_کن("henry2=%d\n", $(hen$y));

   چاپ_کن("fred10=%d\n", $10($fred));
   چاپ_کن("joe_10=%d\n", _$10(joe$));

   صحيح $ = 10;
   صحيح a100$ = 100;
   صحيح a$$ = 1000;
   صحيح a$c$b = 2121;
   صحيح $100 = 10000;
   ثابت حرف *$$$ = "money";

   چاپ_کن("local=%d\n", $);
   چاپ_کن("a100$=%d\n", a100$);
   چاپ_کن("a$$=%d\n", a$$);
   چاپ_کن("a$c$b=%d\n", a$c$b);
   چاپ_کن("$100=%d\n", $100);
   چاپ_کن("$$$=%s", $$$);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
