#ضمن <stdio.h>

#وصف_ڪريو $(x) x
#وصف_ڪريو $fred 10
#وصف_ڪريو joe$ 20
#وصف_ڪريو hen$y 30

#وصف_ڪريو $10(x) x*10
#وصف_ڪريو _$10(x) x/10

صحيح مکيه()
{
   لکو("fred=%d\n", $fred);
   لکو("joe=%d\n", joe$);
   لکو("henry=%d\n", hen$y);

   لکو("fred2=%d\n", $($fred));
   لکو("joe2=%d\n", $(joe$));
   لکو("henry2=%d\n", $(hen$y));

   لکو("fred10=%d\n", $10($fred));
   لکو("joe_10=%d\n", _$10(joe$));

   صحيح $ = 10;
   صحيح a100$ = 100;
   صحيح a$$ = 1000;
   صحيح a$c$b = 2121;
   صحيح $100 = 10000;
   ثابت حرف *$$$ = "money";

   لکو("local=%d\n", $);
   لکو("a100$=%d\n", a100$);
   لکو("a$$=%d\n", a$$);
   لکو("a$c$b=%d\n", a$c$b);
   لکو("$100=%d\n", $100);
   لکو("$$$=%s", $$$);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
