#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ $(x) x
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ $fred 10
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ joe$ 20
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ hen$y 30

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ $10(x) x*10
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ _$10(x) x/10

ਪੂਰਨ ਮੁੱਖ()
{
   ਲਿਖੋ("fred=%d\n", $fred);
   ਲਿਖੋ("joe=%d\n", joe$);
   ਲਿਖੋ("henry=%d\n", hen$y);

   ਲਿਖੋ("fred2=%d\n", $($fred));
   ਲਿਖੋ("joe2=%d\n", $(joe$));
   ਲਿਖੋ("henry2=%d\n", $(hen$y));

   ਲਿਖੋ("fred10=%d\n", $10($fred));
   ਲਿਖੋ("joe_10=%d\n", _$10(joe$));

   ਪੂਰਨ $ = 10;
   ਪੂਰਨ a100$ = 100;
   ਪੂਰਨ a$$ = 1000;
   ਪੂਰਨ a$c$b = 2121;
   ਪੂਰਨ $100 = 10000;
   ਅਚਲ ਅੱਖਰ *$$$ = "money";

   ਲਿਖੋ("local=%d\n", $);
   ਲਿਖੋ("a100$=%d\n", a100$);
   ਲਿਖੋ("a$$=%d\n", a$$);
   ਲਿਖੋ("a$c$b=%d\n", a$c$b);
   ਲਿਖੋ("$100=%d\n", $100);
   ਲਿਖੋ("$$$=%s", $$$);

   ਵਾਪਸ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
