#ضمن <stdio.h>

#تعریف_کړه $(x) x
#تعریف_کړه $fred 10
#تعریف_کړه joe$ 20
#تعریف_کړه hen$y 30

#تعریف_کړه $10(x) x*10
#تعریف_کړه _$10(x) x/10

صحيح اصلي()
{
   چاپ_کړه("fred=%d\n", $fred);
   چاپ_کړه("joe=%d\n", joe$);
   چاپ_کړه("henry=%d\n", hen$y);

   چاپ_کړه("fred2=%d\n", $($fred));
   چاپ_کړه("joe2=%d\n", $(joe$));
   چاپ_کړه("henry2=%d\n", $(hen$y));

   چاپ_کړه("fred10=%d\n", $10($fred));
   چاپ_کړه("joe_10=%d\n", _$10(joe$));

   صحيح $ = 10;
   صحيح a100$ = 100;
   صحيح a$$ = 1000;
   صحيح a$c$b = 2121;
   صحيح $100 = 10000;
   ثابت حرف *$$$ = "money";

   چاپ_کړه("local=%d\n", $);
   چاپ_کړه("a100$=%d\n", a100$);
   چاپ_کړه("a$$=%d\n", a$$);
   چاپ_کړه("a$c$b=%d\n", a$c$b);
   چاپ_کړه("$100=%d\n", $100);
   چاپ_کړه("$$$=%s", $$$);

   أرجع 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
