#شامل <stdio.h>

#تعریف_کرو $(x) x
#تعریف_کرو $fred 10
#تعریف_کرو joe$ 20
#تعریف_کرو hen$y 30

#تعریف_کرو $10(x) x*10
#تعریف_کرو _$10(x) x/10

صحیح مین()
{
   لکھو("fred=%d\n", $fred);
   لکھو("joe=%d\n", joe$);
   لکھو("henry=%d\n", hen$y);

   لکھو("fred2=%d\n", $($fred));
   لکھو("joe2=%d\n", $(joe$));
   لکھو("henry2=%d\n", $(hen$y));

   لکھو("fred10=%d\n", $10($fred));
   لکھو("joe_10=%d\n", _$10(joe$));

   صحیح $ = 10;
   صحیح a100$ = 100;
   صحیح a$$ = 1000;
   صحیح a$c$b = 2121;
   صحیح $100 = 10000;
   ثابت حرف *$$$ = "money";

   لکھو("local=%d\n", $);
   لکھو("a100$=%d\n", a100$);
   لکھو("a$$=%d\n", a$$);
   لکھو("a$c$b=%d\n", a$c$b);
   لکھو("$100=%d\n", $100);
   لکھو("$$$=%s", $$$);

   واپس 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
