#ಅನ್ತರ್ಭಾವ <stdio.h>

#ವ್ಯಾಖ್ಯಾನಿಸು $(x) x
#ವ್ಯಾಖ್ಯಾನಿಸು $fred 10
#ವ್ಯಾಖ್ಯಾನಿಸು joe$ 20
#ವ್ಯಾಖ್ಯಾನಿಸು hen$y 30

#ವ್ಯಾಖ್ಯಾನಿಸು $10(x) x*10
#ವ್ಯಾಖ್ಯಾನಿಸು _$10(x) x/10

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
   ಬರೆ("fred=%d\n", $fred);
   ಬರೆ("joe=%d\n", joe$);
   ಬರೆ("henry=%d\n", hen$y);

   ಬರೆ("fred2=%d\n", $($fred));
   ಬರೆ("joe2=%d\n", $(joe$));
   ಬರೆ("henry2=%d\n", $(hen$y));

   ಬರೆ("fred10=%d\n", $10($fred));
   ಬರೆ("joe_10=%d\n", _$10(joe$));

   ಪೂರ್ಣಾಂಕ $ = 10;
   ಪೂರ್ಣಾಂಕ a100$ = 100;
   ಪೂರ್ಣಾಂಕ a$$ = 1000;
   ಪೂರ್ಣಾಂಕ a$c$b = 2121;
   ಪೂರ್ಣಾಂಕ $100 = 10000;
   ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *$$$ = "money";

   ಬರೆ("local=%d\n", $);
   ಬರೆ("a100$=%d\n", a100$);
   ಬರೆ("a$$=%d\n", a$$);
   ಬರೆ("a$c$b=%d\n", a$c$b);
   ಬರೆ("$100=%d\n", $100);
   ಬರೆ("$$$=%s", $$$);

   ಹಿಂತಿರುಗಿ 0;
}

/* vim: set expandtab ts=4 sw=3 sts=3 tw=80 :*/
