#अन्तर्भाव <stdio.h>

पूर्णाङ्क f(शून्य)
{
  फर्काऊ 5;
}

शून्य test1()
{
  पूर्णाङ्क गन्ती_2 = 10;
  शून्य *addr[10];
  लागि(;गन्ती_2--;) {
    पूर्णाङ्क a[f()];

    addr[गन्ती_2] = a;

    जारी;
  }

  यदि(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test2()
{
  पूर्णाङ्क गन्ती_2 = 10;
  शून्य *addr[गन्ती_2];
  लागि(;गन्ती_2--;) {
    पूर्णाङ्क a[f()];

    addr[गन्ती_2] = a;

    जारी;
  }

  यदि(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test3()
{
  पूर्णाङ्क गन्ती_2 = 10;
  शून्य *addr[गन्ती_2];
  जबसम्म(गन्ती_2--) {
      पूर्णाङ्क b[f()];
      यदि (गन्ती_2 >= 0) {
          पूर्णाङ्क a[f()];

          addr[गन्ती_2] = a;

          जारी;
      }
  }

  यदि(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test4()
{
  पूर्णाङ्क गन्ती_2 = 10;
  शून्य *addr[गन्ती_2];
  गर {
    पूर्णाङ्क a[f()];

    addr[--गन्ती_2] = a;

    जारी;
  } जबसम्म (गन्ती_2);

  यदि(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test5()
{
  पूर्णाङ्क गन्ती_2 = 10;
  पूर्णाङ्क a[f()];
  पूर्णाङ्क c[f()];

  c[0] = 42;

  लागि(;गन्ती_2--;) {
    पूर्णाङ्क b[f()];
    पूर्णाङ्क i;
    लागि (i=0; i<f(); i++) {
      b[i] = गन्ती_2;
    }
  }

  यदि (c[0] == 42) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

पूर्णाङ्क main(शून्य)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  फर्काऊ 0;
}
