#ضمن <stdio.h>

صحيح f(فراغ)
{
  أرجع 5;
}

فراغ test1()
{
  صحيح عدد_2 = 10;
  فراغ *addr[10];
  لكل(;عدد_2--;) {
    صحيح a[f()];

    addr[عدد_2] = a;

    استمر;
  }

  إذا(addr[9] == addr[0]) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

فراغ test2()
{
  صحيح عدد_2 = 10;
  فراغ *addr[عدد_2];
  لكل(;عدد_2--;) {
    صحيح a[f()];

    addr[عدد_2] = a;

    استمر;
  }

  إذا(addr[9] == addr[0]) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

فراغ test3()
{
  صحيح عدد_2 = 10;
  فراغ *addr[عدد_2];
  طالما(عدد_2--) {
      صحيح b[f()];
      إذا (عدد_2 >= 0) {
          صحيح a[f()];

          addr[عدد_2] = a;

          استمر;
      }
  }

  إذا(addr[9] == addr[0]) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

فراغ test4()
{
  صحيح عدد_2 = 10;
  فراغ *addr[عدد_2];
  افعل {
    صحيح a[f()];

    addr[--عدد_2] = a;

    استمر;
  } طالما (عدد_2);

  إذا(addr[9] == addr[0]) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

فراغ test5()
{
  صحيح عدد_2 = 10;
  صحيح a[f()];
  صحيح c[f()];

  c[0] = 42;

  لكل(;عدد_2--;) {
    صحيح b[f()];
    صحيح i;
    لكل (i=0; i<f(); i++) {
      b[i] = عدد_2;
    }
  }

  إذا (c[0] == 42) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

صحيح main(فراغ)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  أرجع 0;
}
