#ضمن <stdio.h>

صحيح f(فراغ)
{
  أرجع 5;
}

فراغ test1()
{
  صحيح ڳڻپ_2 = 10;
  فراغ *addr[10];
  لكل(;ڳڻپ_2--;) {
    صحيح a[f()];

    addr[ڳڻپ_2] = a;

    استمر;
  }

  إذا(addr[9] == addr[0]) {
    لکو("OK\n");
  } وإلا {
    لکو("NOT OK\n");
  }
}

فراغ test2()
{
  صحيح ڳڻپ_2 = 10;
  فراغ *addr[ڳڻپ_2];
  لكل(;ڳڻپ_2--;) {
    صحيح a[f()];

    addr[ڳڻپ_2] = a;

    استمر;
  }

  إذا(addr[9] == addr[0]) {
    لکو("OK\n");
  } وإلا {
    لکو("NOT OK\n");
  }
}

فراغ test3()
{
  صحيح ڳڻپ_2 = 10;
  فراغ *addr[ڳڻپ_2];
  طالما(ڳڻپ_2--) {
      صحيح b[f()];
      إذا (ڳڻپ_2 >= 0) {
          صحيح a[f()];

          addr[ڳڻپ_2] = a;

          استمر;
      }
  }

  إذا(addr[9] == addr[0]) {
    لکو("OK\n");
  } وإلا {
    لکو("NOT OK\n");
  }
}

فراغ test4()
{
  صحيح ڳڻپ_2 = 10;
  فراغ *addr[ڳڻپ_2];
  افعل {
    صحيح a[f()];

    addr[--ڳڻپ_2] = a;

    استمر;
  } طالما (ڳڻپ_2);

  إذا(addr[9] == addr[0]) {
    لکو("OK\n");
  } وإلا {
    لکو("NOT OK\n");
  }
}

فراغ test5()
{
  صحيح ڳڻپ_2 = 10;
  صحيح a[f()];
  صحيح c[f()];

  c[0] = 42;

  لكل(;ڳڻپ_2--;) {
    صحيح b[f()];
    صحيح i;
    لكل (i=0; i<f(); i++) {
      b[i] = ڳڻپ_2;
    }
  }

  إذا (c[0] == 42) {
    لکو("OK\n");
  } وإلا {
    لکو("NOT OK\n");
  }
}

صحيح مکيه(فراغ)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  أرجع 0;
}
