#অন্তর্ভাব <stdio.h>

পূর্ণসংখ্যা f(শূন্য)
{
  ফেরত 5;
}

শূন্য test1()
{
  পূর্ণসংখ্যা গুনতি_2 = 10;
  শূন্য *addr[10];
  জন্য(;গুনতি_2--;) {
    পূর্ণসংখ্যা a[f()];

    addr[গুনতি_2] = a;

    চালু;
  }

  যদি(addr[9] == addr[0]) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

শূন্য test2()
{
  পূর্ণসংখ্যা গুনতি_2 = 10;
  শূন্য *addr[গুনতি_2];
  জন্য(;গুনতি_2--;) {
    পূর্ণসংখ্যা a[f()];

    addr[গুনতি_2] = a;

    চালু;
  }

  যদি(addr[9] == addr[0]) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

শূন্য test3()
{
  পূর্ণসংখ্যা গুনতি_2 = 10;
  শূন্য *addr[গুনতি_2];
  যখন(গুনতি_2--) {
      পূর্ণসংখ্যা b[f()];
      যদি (গুনতি_2 >= 0) {
          পূর্ণসংখ্যা a[f()];

          addr[গুনতি_2] = a;

          চালু;
      }
  }

  যদি(addr[9] == addr[0]) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

শূন্য test4()
{
  পূর্ণসংখ্যা গুনতি_2 = 10;
  শূন্য *addr[গুনতি_2];
  করো {
    পূর্ণসংখ্যা a[f()];

    addr[--গুনতি_2] = a;

    চালু;
  } যখন (গুনতি_2);

  যদি(addr[9] == addr[0]) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

শূন্য test5()
{
  পূর্ণসংখ্যা গুনতি_2 = 10;
  পূর্ণসংখ্যা a[f()];
  পূর্ণসংখ্যা c[f()];

  c[0] = 42;

  জন্য(;গুনতি_2--;) {
    পূর্ণসংখ্যা b[f()];
    পূর্ণসংখ্যা i;
    জন্য (i=0; i<f(); i++) {
      b[i] = গুনতি_2;
    }
  }

  যদি (c[0] == 42) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

পূর্ণসংখ্যা প্রধান(শূন্য)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  ফেরত 0;
}
