#અન્તર્ભાવ <stdio.h>

પૂર્ણાંક f(શૂન્ય)
{
  પાછા 5;
}

શૂન્ય test1()
{
  પૂર્ણાંક ગણતરી_2 = 10;
  શૂન્ય *addr[10];
  માટે(;ગણતરી_2--;) {
    પૂર્ણાંક a[f()];

    addr[ગણતરી_2] = a;

    ચાલુ;
  }

  જો(addr[9] == addr[0]) {
    printf("OK\n");
  } નહીંતર {
    printf("NOT OK\n");
  }
}

શૂન્ય test2()
{
  પૂર્ણાંક ગણતરી_2 = 10;
  શૂન્ય *addr[ગણતરી_2];
  માટે(;ગણતરી_2--;) {
    પૂર્ણાંક a[f()];

    addr[ગણતરી_2] = a;

    ચાલુ;
  }

  જો(addr[9] == addr[0]) {
    printf("OK\n");
  } નહીંતર {
    printf("NOT OK\n");
  }
}

શૂન્ય test3()
{
  પૂર્ણાંક ગણતરી_2 = 10;
  શૂન્ય *addr[ગણતરી_2];
  જ્યારે(ગણતરી_2--) {
      પૂર્ણાંક b[f()];
      જો (ગણતરી_2 >= 0) {
          પૂર્ણાંક a[f()];

          addr[ગણતરી_2] = a;

          ચાલુ;
      }
  }

  જો(addr[9] == addr[0]) {
    printf("OK\n");
  } નહીંતર {
    printf("NOT OK\n");
  }
}

શૂન્ય test4()
{
  પૂર્ણાંક ગણતરી_2 = 10;
  શૂન્ય *addr[ગણતરી_2];
  કરો {
    પૂર્ણાંક a[f()];

    addr[--ગણતરી_2] = a;

    ચાલુ;
  } જ્યારે (ગણતરી_2);

  જો(addr[9] == addr[0]) {
    printf("OK\n");
  } નહીંતર {
    printf("NOT OK\n");
  }
}

શૂન્ય test5()
{
  પૂર્ણાંક ગણતરી_2 = 10;
  પૂર્ણાંક a[f()];
  પૂર્ણાંક c[f()];

  c[0] = 42;

  માટે(;ગણતરી_2--;) {
    પૂર્ણાંક b[f()];
    પૂર્ણાંક i;
    માટે (i=0; i<f(); i++) {
      b[i] = ગણતરી_2;
    }
  }

  જો (c[0] == 42) {
    printf("OK\n");
  } નહીંતર {
    printf("NOT OK\n");
  }
}

પૂર્ણાંક મુખ્ય(શૂન્ય)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  પાછા 0;
}
