#ضمن <stdio.h>

صحيح f(فراغ)
{
  إرجاع 5;
}

فراغ test1()
{
  صحيح تعداد_3 = 10;
  فراغ *addr[10];
  لكل(;تعداد_3--;) {
    صحيح a[f()];

    addr[تعداد_3] = a;

    استمر;
  }

  إذا(addr[9] == addr[0]) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

فراغ test2()
{
  صحيح تعداد_3 = 10;
  فراغ *addr[تعداد_3];
  لكل(;تعداد_3--;) {
    صحيح a[f()];

    addr[تعداد_3] = a;

    استمر;
  }

  إذا(addr[9] == addr[0]) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

فراغ test3()
{
  صحيح تعداد_3 = 10;
  فراغ *addr[تعداد_3];
  بينما(تعداد_3--) {
      صحيح b[f()];
      إذا (تعداد_3 >= 0) {
          صحيح a[f()];

          addr[تعداد_3] = a;

          استمر;
      }
  }

  إذا(addr[9] == addr[0]) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

فراغ test4()
{
  صحيح تعداد_3 = 10;
  فراغ *addr[تعداد_3];
  افعل {
    صحيح a[f()];

    addr[--تعداد_3] = a;

    استمر;
  } بينما (تعداد_3);

  إذا(addr[9] == addr[0]) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

فراغ test5()
{
  صحيح تعداد_3 = 10;
  صحيح a[f()];
  صحيح c[f()];

  c[0] = 42;

  لكل(;تعداد_3--;) {
    صحيح b[f()];
    صحيح i;
    لكل (i=0; i<f(); i++) {
      b[i] = تعداد_3;
    }
  }

  إذا (c[0] == 42) {
    printf("OK\n");
  } وإلا {
    printf("NOT OK\n");
  }
}

صحيح الرئيسية(فراغ)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  إرجاع 0;
}
