#அந்தர்பாவ <stdio.h>

முழு f(வெறுமை)
{
  திரும்பு 5;
}

வெறுமை test1()
{
  முழு மொத்தம்_2 = 10;
  வெறுமை *addr[10];
  க்கு(;மொத்தம்_2--;) {
    முழு a[f()];

    addr[மொத்தம்_2] = a;

    தொடர்;
  }

  எனில்(addr[9] == addr[0]) {
    printf("OK\n");
  } இல்லையெனில் {
    printf("NOT OK\n");
  }
}

வெறுமை test2()
{
  முழு மொத்தம்_2 = 10;
  வெறுமை *addr[மொத்தம்_2];
  க்கு(;மொத்தம்_2--;) {
    முழு a[f()];

    addr[மொத்தம்_2] = a;

    தொடர்;
  }

  எனில்(addr[9] == addr[0]) {
    printf("OK\n");
  } இல்லையெனில் {
    printf("NOT OK\n");
  }
}

வெறுமை test3()
{
  முழு மொத்தம்_2 = 10;
  வெறுமை *addr[மொத்தம்_2];
  போது(மொத்தம்_2--) {
      முழு b[f()];
      எனில் (மொத்தம்_2 >= 0) {
          முழு a[f()];

          addr[மொத்தம்_2] = a;

          தொடர்;
      }
  }

  எனில்(addr[9] == addr[0]) {
    printf("OK\n");
  } இல்லையெனில் {
    printf("NOT OK\n");
  }
}

வெறுமை test4()
{
  முழு மொத்தம்_2 = 10;
  வெறுமை *addr[மொத்தம்_2];
  செய் {
    முழு a[f()];

    addr[--மொத்தம்_2] = a;

    தொடர்;
  } போது (மொத்தம்_2);

  எனில்(addr[9] == addr[0]) {
    printf("OK\n");
  } இல்லையெனில் {
    printf("NOT OK\n");
  }
}

வெறுமை test5()
{
  முழு மொத்தம்_2 = 10;
  முழு a[f()];
  முழு c[f()];

  c[0] = 42;

  க்கு(;மொத்தம்_2--;) {
    முழு b[f()];
    முழு i;
    க்கு (i=0; i<f(); i++) {
      b[i] = மொத்தம்_2;
    }
  }

  எனில் (c[0] == 42) {
    printf("OK\n");
  } இல்லையெனில் {
    printf("NOT OK\n");
  }
}

முழு முதன்மை(வெறுமை)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  திரும்பு 0;
}
