#അന്തര്ഭാവ <stdio.h>

പൂർണ്ണസംഖ്യ f(ശൂന്യം)
{
  തിരികെ 5;
}

ശൂന്യം test1()
{
  പൂർണ്ണസംഖ്യ എണ്ണം_2 = 10;
  ശൂന്യം *addr[10];
  വേണ്ടി(;എണ്ണം_2--;) {
    പൂർണ്ണസംഖ്യ a[f()];

    addr[എണ്ണം_2] = a;

    തുടരുക;
  }

  എങ്കിൽ(addr[9] == addr[0]) {
    printf("OK\n");
  } അല്ലെങ്കിൽ {
    printf("NOT OK\n");
  }
}

ശൂന്യം test2()
{
  പൂർണ്ണസംഖ്യ എണ്ണം_2 = 10;
  ശൂന്യം *addr[എണ്ണം_2];
  വേണ്ടി(;എണ്ണം_2--;) {
    പൂർണ്ണസംഖ്യ a[f()];

    addr[എണ്ണം_2] = a;

    തുടരുക;
  }

  എങ്കിൽ(addr[9] == addr[0]) {
    printf("OK\n");
  } അല്ലെങ്കിൽ {
    printf("NOT OK\n");
  }
}

ശൂന്യം test3()
{
  പൂർണ്ണസംഖ്യ എണ്ണം_2 = 10;
  ശൂന്യം *addr[എണ്ണം_2];
  ആകുമ്പോൾ(എണ്ണം_2--) {
      പൂർണ്ണസംഖ്യ b[f()];
      എങ്കിൽ (എണ്ണം_2 >= 0) {
          പൂർണ്ണസംഖ്യ a[f()];

          addr[എണ്ണം_2] = a;

          തുടരുക;
      }
  }

  എങ്കിൽ(addr[9] == addr[0]) {
    printf("OK\n");
  } അല്ലെങ്കിൽ {
    printf("NOT OK\n");
  }
}

ശൂന്യം test4()
{
  പൂർണ്ണസംഖ്യ എണ്ണം_2 = 10;
  ശൂന്യം *addr[എണ്ണം_2];
  ചെയ്യുക {
    പൂർണ്ണസംഖ്യ a[f()];

    addr[--എണ്ണം_2] = a;

    തുടരുക;
  } ആകുമ്പോൾ (എണ്ണം_2);

  എങ്കിൽ(addr[9] == addr[0]) {
    printf("OK\n");
  } അല്ലെങ്കിൽ {
    printf("NOT OK\n");
  }
}

ശൂന്യം test5()
{
  പൂർണ്ണസംഖ്യ എണ്ണം_2 = 10;
  പൂർണ്ണസംഖ്യ a[f()];
  പൂർണ്ണസംഖ്യ c[f()];

  c[0] = 42;

  വേണ്ടി(;എണ്ണം_2--;) {
    പൂർണ്ണസംഖ്യ b[f()];
    പൂർണ്ണസംഖ്യ i;
    വേണ്ടി (i=0; i<f(); i++) {
      b[i] = എണ്ണം_2;
    }
  }

  എങ്കിൽ (c[0] == 42) {
    printf("OK\n");
  } അല്ലെങ്കിൽ {
    printf("NOT OK\n");
  }
}

പൂർണ്ണസംഖ്യ പ്രധാന(ശൂന്യം)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  തിരികെ 0;
}
