#شامل <stdio.h>

صحیح f(تهی)
{
  بازگشت 5;
}

تهی test1()
{
  صحیح شمار_2 = 10;
  تهی *addr[10];
  برای(;شمار_2--;) {
    صحیح a[f()];

    addr[شمار_2] = a;

    ادامه;
  }

  اگر(addr[9] == addr[0]) {
    printf("OK\n");
  } وگرنه {
    printf("NOT OK\n");
  }
}

تهی test2()
{
  صحیح شمار_2 = 10;
  تهی *addr[شمار_2];
  برای(;شمار_2--;) {
    صحیح a[f()];

    addr[شمار_2] = a;

    ادامه;
  }

  اگر(addr[9] == addr[0]) {
    printf("OK\n");
  } وگرنه {
    printf("NOT OK\n");
  }
}

تهی test3()
{
  صحیح شمار_2 = 10;
  تهی *addr[شمار_2];
  وقتی(شمار_2--) {
      صحیح b[f()];
      اگر (شمار_2 >= 0) {
          صحیح a[f()];

          addr[شمار_2] = a;

          ادامه;
      }
  }

  اگر(addr[9] == addr[0]) {
    printf("OK\n");
  } وگرنه {
    printf("NOT OK\n");
  }
}

تهی test4()
{
  صحیح شمار_2 = 10;
  تهی *addr[شمار_2];
  انجامبده {
    صحیح a[f()];

    addr[--شمار_2] = a;

    ادامه;
  } وقتی (شمار_2);

  اگر(addr[9] == addr[0]) {
    printf("OK\n");
  } وگرنه {
    printf("NOT OK\n");
  }
}

تهی test5()
{
  صحیح شمار_2 = 10;
  صحیح a[f()];
  صحیح c[f()];

  c[0] = 42;

  برای(;شمار_2--;) {
    صحیح b[f()];
    صحیح i;
    برای (i=0; i<f(); i++) {
      b[i] = شمار_2;
    }
  }

  اگر (c[0] == 42) {
    printf("OK\n");
  } وگرنه {
    printf("NOT OK\n");
  }
}

صحیح اصلی(تهی)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  بازگشت 0;
}
