#অন্তর্ভাৱ <stdio.h>

পূর্ণাঙ্ক f(শূন্য)
{
  ঘূৰাই 5;
}

শূন্য test1()
{
  পূর্ণাঙ্ক গুনতি_2 = 10;
  শূন্য *addr[10];
  বাবে(;গুনতি_2--;) {
    পূর্ণাঙ্ক a[f()];

    addr[গুনতি_2] = a;

    অনুৱর্ত;
  }

  যদি(addr[9] == addr[0]) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

শূন্য test2()
{
  পূর্ণাঙ্ক গুনতি_2 = 10;
  শূন্য *addr[গুনতি_2];
  বাবে(;গুনতি_2--;) {
    পূর্ণাঙ্ক a[f()];

    addr[গুনতি_2] = a;

    অনুৱর্ত;
  }

  যদি(addr[9] == addr[0]) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

শূন্য test3()
{
  পূর্ণাঙ্ক গুনতি_2 = 10;
  শূন্য *addr[গুনতি_2];
  যেতিয়ালৈ(গুনতি_2--) {
      পূর্ণাঙ্ক b[f()];
      যদি (গুনতি_2 >= 0) {
          পূর্ণাঙ্ক a[f()];

          addr[গুনতি_2] = a;

          অনুৱর্ত;
      }
  }

  যদি(addr[9] == addr[0]) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

শূন্য test4()
{
  পূর্ণাঙ্ক গুনতি_2 = 10;
  শূন্য *addr[গুনতি_2];
  কৰা {
    পূর্ণাঙ্ক a[f()];

    addr[--গুনতি_2] = a;

    অনুৱর্ত;
  } যেতিয়ালৈ (গুনতি_2);

  যদি(addr[9] == addr[0]) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

শূন্য test5()
{
  পূর্ণাঙ্ক গুনতি_2 = 10;
  পূর্ণাঙ্ক a[f()];
  পূর্ণাঙ্ক c[f()];

  c[0] = 42;

  বাবে(;গুনতি_2--;) {
    পূর্ণাঙ্ক b[f()];
    পূর্ণাঙ্ক i;
    বাবে (i=0; i<f(); i++) {
      b[i] = গুনতি_2;
    }
  }

  যদি (c[0] == 42) {
    printf("OK\n");
  } অন্যথা {
    printf("NOT OK\n");
  }
}

পূর্ণাঙ্ক main(শূন্য)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  ঘূৰাই 0;
}
