#ଅନ୍ତର୍ଭାଵ <stdio.h>

ପୂର୍ଣ୍ଣସଂଖ୍ୟା f(ଶୂନ୍ୟ)
{
  ଫେରନ୍ତୁ 5;
}

ଶୂନ୍ୟ test1()
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା ଗଣନା_3 = 10;
  ଶୂନ୍ୟ *addr[10];
  ପାଇଁ(;ଗଣନା_3--;) {
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା a[f()];

    addr[ଗଣନା_3] = a;

    ଜାରି;
  }

  ଯଦି(addr[9] == addr[0]) {
    printf("OK\n");
  } ଅନ୍ୟଥା {
    printf("NOT OK\n");
  }
}

ଶୂନ୍ୟ test2()
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା ଗଣନା_3 = 10;
  ଶୂନ୍ୟ *addr[ଗଣନା_3];
  ପାଇଁ(;ଗଣନା_3--;) {
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା a[f()];

    addr[ଗଣନା_3] = a;

    ଜାରି;
  }

  ଯଦି(addr[9] == addr[0]) {
    printf("OK\n");
  } ଅନ୍ୟଥା {
    printf("NOT OK\n");
  }
}

ଶୂନ୍ୟ test3()
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା ଗଣନା_3 = 10;
  ଶୂନ୍ୟ *addr[ଗଣନା_3];
  ଯେତେବେଳେ(ଗଣନା_3--) {
      ପୂର୍ଣ୍ଣସଂଖ୍ୟା b[f()];
      ଯଦି (ଗଣନା_3 >= 0) {
          ପୂର୍ଣ୍ଣସଂଖ୍ୟା a[f()];

          addr[ଗଣନା_3] = a;

          ଜାରି;
      }
  }

  ଯଦି(addr[9] == addr[0]) {
    printf("OK\n");
  } ଅନ୍ୟଥା {
    printf("NOT OK\n");
  }
}

ଶୂନ୍ୟ test4()
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା ଗଣନା_3 = 10;
  ଶୂନ୍ୟ *addr[ଗଣନା_3];
  କର {
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା a[f()];

    addr[--ଗଣନା_3] = a;

    ଜାରି;
  } ଯେତେବେଳେ (ଗଣନା_3);

  ଯଦି(addr[9] == addr[0]) {
    printf("OK\n");
  } ଅନ୍ୟଥା {
    printf("NOT OK\n");
  }
}

ଶୂନ୍ୟ test5()
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା ଗଣନା_3 = 10;
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା a[f()];
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା c[f()];

  c[0] = 42;

  ପାଇଁ(;ଗଣନା_3--;) {
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା b[f()];
    ପୂର୍ଣ୍ଣସଂଖ୍ୟା i;
    ପାଇଁ (i=0; i<f(); i++) {
      b[i] = ଗଣନା_3;
    }
  }

  ଯଦି (c[0] == 42) {
    printf("OK\n");
  } ଅନ୍ୟଥା {
    printf("NOT OK\n");
  }
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା ମୁଖ୍ୟ(ଶୂନ୍ୟ)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  ଫେରନ୍ତୁ 0;
}
