#अन्तर्भाव <stdio.h>

पूर्णाङ्क f(शून्य)
{
  पटिनिवत्त 5;
}

शून्य test1()
{
  पूर्णाङ्क गणनम्_2 = 10;
  शून्य *addr[10];
  अत्थाय(;गणनम्_2--;) {
    पूर्णाङ्क a[f()];

    addr[गणनम्_2] = a;

    अनुवर्त;
  }

  सचे(addr[9] == addr[0]) {
    printf("OK\n");
  } अञ्ञथा {
    printf("NOT OK\n");
  }
}

शून्य test2()
{
  पूर्णाङ्क गणनम्_2 = 10;
  शून्य *addr[गणनम्_2];
  अत्थाय(;गणनम्_2--;) {
    पूर्णाङ्क a[f()];

    addr[गणनम्_2] = a;

    अनुवर्त;
  }

  सचे(addr[9] == addr[0]) {
    printf("OK\n");
  } अञ्ञथा {
    printf("NOT OK\n");
  }
}

शून्य test3()
{
  पूर्णाङ्क गणनम्_2 = 10;
  शून्य *addr[गणनम्_2];
  याव(गणनम्_2--) {
      पूर्णाङ्क b[f()];
      सचे (गणनम्_2 >= 0) {
          पूर्णाङ्क a[f()];

          addr[गणनम्_2] = a;

          अनुवर्त;
      }
  }

  सचे(addr[9] == addr[0]) {
    printf("OK\n");
  } अञ्ञथा {
    printf("NOT OK\n");
  }
}

शून्य test4()
{
  पूर्णाङ्क गणनम्_2 = 10;
  शून्य *addr[गणनम्_2];
  करोहि {
    पूर्णाङ्क a[f()];

    addr[--गणनम्_2] = a;

    अनुवर्त;
  } याव (गणनम्_2);

  सचे(addr[9] == addr[0]) {
    printf("OK\n");
  } अञ्ञथा {
    printf("NOT OK\n");
  }
}

शून्य test5()
{
  पूर्णाङ्क गणनम्_2 = 10;
  पूर्णाङ्क a[f()];
  पूर्णाङ्क c[f()];

  c[0] = 42;

  अत्थाय(;गणनम्_2--;) {
    पूर्णाङ्क b[f()];
    पूर्णाङ्क i;
    अत्थाय (i=0; i<f(); i++) {
      b[i] = गणनम्_2;
    }
  }

  सचे (c[0] == 42) {
    printf("OK\n");
  } अञ्ञथा {
    printf("NOT OK\n");
  }
}

पूर्णाङ्क main(शून्य)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  पटिनिवत्त 0;
}
