#अन्तर्भाव <stdio.h>

पूर्णांक f(शून्य)
{
  परत 5;
}

शून्य test1()
{
  पूर्णांक मोजणी_2 = 10;
  शून्य *addr[10];
  साठी(;मोजणी_2--;) {
    पूर्णांक a[f()];

    addr[मोजणी_2] = a;

    सुरूठेवा;
  }

  जर(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test2()
{
  पूर्णांक मोजणी_2 = 10;
  शून्य *addr[मोजणी_2];
  साठी(;मोजणी_2--;) {
    पूर्णांक a[f()];

    addr[मोजणी_2] = a;

    सुरूठेवा;
  }

  जर(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test3()
{
  पूर्णांक मोजणी_2 = 10;
  शून्य *addr[मोजणी_2];
  पर्यंत(मोजणी_2--) {
      पूर्णांक b[f()];
      जर (मोजणी_2 >= 0) {
          पूर्णांक a[f()];

          addr[मोजणी_2] = a;

          सुरूठेवा;
      }
  }

  जर(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test4()
{
  पूर्णांक मोजणी_2 = 10;
  शून्य *addr[मोजणी_2];
  करा {
    पूर्णांक a[f()];

    addr[--मोजणी_2] = a;

    सुरूठेवा;
  } पर्यंत (मोजणी_2);

  जर(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test5()
{
  पूर्णांक मोजणी_2 = 10;
  पूर्णांक a[f()];
  पूर्णांक c[f()];

  c[0] = 42;

  साठी(;मोजणी_2--;) {
    पूर्णांक b[f()];
    पूर्णांक i;
    साठी (i=0; i<f(); i++) {
      b[i] = मोजणी_2;
    }
  }

  जर (c[0] == 42) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

पूर्णांक main(शून्य)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  परत 0;
}
