#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

ਪੂਰਨ f(ਖਾਲੀ)
{
  ਵਾਪਸ 5;
}

ਖਾਲੀ test1()
{
  ਪੂਰਨ ਗਿਣਤੀ_3 = 10;
  ਖਾਲੀ *addr[10];
  ਲਈ(;ਗਿਣਤੀ_3--;) {
    ਪੂਰਨ a[f()];

    addr[ਗਿਣਤੀ_3] = a;

    ਜਾਰੀ;
  }

  ਜੇ(addr[9] == addr[0]) {
    ਲਿਖੋ("OK\n");
  } ਨਹੀਂਤਾਂ {
    ਲਿਖੋ("NOT OK\n");
  }
}

ਖਾਲੀ test2()
{
  ਪੂਰਨ ਗਿਣਤੀ_3 = 10;
  ਖਾਲੀ *addr[ਗਿਣਤੀ_3];
  ਲਈ(;ਗਿਣਤੀ_3--;) {
    ਪੂਰਨ a[f()];

    addr[ਗਿਣਤੀ_3] = a;

    ਜਾਰੀ;
  }

  ਜੇ(addr[9] == addr[0]) {
    ਲਿਖੋ("OK\n");
  } ਨਹੀਂਤਾਂ {
    ਲਿਖੋ("NOT OK\n");
  }
}

ਖਾਲੀ test3()
{
  ਪੂਰਨ ਗਿਣਤੀ_3 = 10;
  ਖਾਲੀ *addr[ਗਿਣਤੀ_3];
  ਜਦੋਂ(ਗਿਣਤੀ_3--) {
      ਪੂਰਨ b[f()];
      ਜੇ (ਗਿਣਤੀ_3 >= 0) {
          ਪੂਰਨ a[f()];

          addr[ਗਿਣਤੀ_3] = a;

          ਜਾਰੀ;
      }
  }

  ਜੇ(addr[9] == addr[0]) {
    ਲਿਖੋ("OK\n");
  } ਨਹੀਂਤਾਂ {
    ਲਿਖੋ("NOT OK\n");
  }
}

ਖਾਲੀ test4()
{
  ਪੂਰਨ ਗਿਣਤੀ_3 = 10;
  ਖਾਲੀ *addr[ਗਿਣਤੀ_3];
  ਕਰੋ {
    ਪੂਰਨ a[f()];

    addr[--ਗਿਣਤੀ_3] = a;

    ਜਾਰੀ;
  } ਜਦੋਂ (ਗਿਣਤੀ_3);

  ਜੇ(addr[9] == addr[0]) {
    ਲਿਖੋ("OK\n");
  } ਨਹੀਂਤਾਂ {
    ਲਿਖੋ("NOT OK\n");
  }
}

ਖਾਲੀ test5()
{
  ਪੂਰਨ ਗਿਣਤੀ_3 = 10;
  ਪੂਰਨ a[f()];
  ਪੂਰਨ c[f()];

  c[0] = 42;

  ਲਈ(;ਗਿਣਤੀ_3--;) {
    ਪੂਰਨ b[f()];
    ਪੂਰਨ i;
    ਲਈ (i=0; i<f(); i++) {
      b[i] = ਗਿਣਤੀ_3;
    }
  }

  ਜੇ (c[0] == 42) {
    ਲਿਖੋ("OK\n");
  } ਨਹੀਂਤਾਂ {
    ਲਿਖੋ("NOT OK\n");
  }
}

ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  ਵਾਪਸ 0;
}
