#అన్తర్భావ <stdio.h>

పూర్ణాంకం f(శూన్య)
{
  తిరిగి 5;
}

శూన్య test1()
{
  పూర్ణాంకం లెక్క_2 = 10;
  శూన్య *addr[10];
  కొరకు(;లెక్క_2--;) {
    పూర్ణాంకం a[f()];

    addr[లెక్క_2] = a;

    కొనసాగు;
  }

  ఒకవేళ(addr[9] == addr[0]) {
    రాయి("OK\n");
  } లేకపోతే {
    రాయి("NOT OK\n");
  }
}

శూన్య test2()
{
  పూర్ణాంకం లెక్క_2 = 10;
  శూన్య *addr[లెక్క_2];
  కొరకు(;లెక్క_2--;) {
    పూర్ణాంకం a[f()];

    addr[లెక్క_2] = a;

    కొనసాగు;
  }

  ఒకవేళ(addr[9] == addr[0]) {
    రాయి("OK\n");
  } లేకపోతే {
    రాయి("NOT OK\n");
  }
}

శూన్య test3()
{
  పూర్ణాంకం లెక్క_2 = 10;
  శూన్య *addr[లెక్క_2];
  అయితే(లెక్క_2--) {
      పూర్ణాంకం b[f()];
      ఒకవేళ (లెక్క_2 >= 0) {
          పూర్ణాంకం a[f()];

          addr[లెక్క_2] = a;

          కొనసాగు;
      }
  }

  ఒకవేళ(addr[9] == addr[0]) {
    రాయి("OK\n");
  } లేకపోతే {
    రాయి("NOT OK\n");
  }
}

శూన్య test4()
{
  పూర్ణాంకం లెక్క_2 = 10;
  శూన్య *addr[లెక్క_2];
  చేయి {
    పూర్ణాంకం a[f()];

    addr[--లెక్క_2] = a;

    కొనసాగు;
  } అయితే (లెక్క_2);

  ఒకవేళ(addr[9] == addr[0]) {
    రాయి("OK\n");
  } లేకపోతే {
    రాయి("NOT OK\n");
  }
}

శూన్య test5()
{
  పూర్ణాంకం లెక్క_2 = 10;
  పూర్ణాంకం a[f()];
  పూర్ణాంకం c[f()];

  c[0] = 42;

  కొరకు(;లెక్క_2--;) {
    పూర్ణాంకం b[f()];
    పూర్ణాంకం i;
    కొరకు (i=0; i<f(); i++) {
      b[i] = లెక్క_2;
    }
  }

  ఒకవేళ (c[0] == 42) {
    రాయి("OK\n");
  } లేకపోతే {
    రాయి("NOT OK\n");
  }
}

పూర్ణాంకం ప్రధాన(శూన్య)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  తిరిగి 0;
}
