#समावेश <stdio.h>

पूर्णांक f(व्योम)
{
  वापस 5;
}

व्योम test1()
{
  पूर्णांक गिनती_2 = 10;
  व्योम *addr[10];
  क्रम(;गिनती_2--;) {
    पूर्णांक a[f()];

    addr[गिनती_2] = a;

    जारी;
  }

  अगर(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

व्योम test2()
{
  पूर्णांक गिनती_2 = 10;
  व्योम *addr[गिनती_2];
  क्रम(;गिनती_2--;) {
    पूर्णांक a[f()];

    addr[गिनती_2] = a;

    जारी;
  }

  अगर(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

व्योम test3()
{
  पूर्णांक गिनती_2 = 10;
  व्योम *addr[गिनती_2];
  जबतक(गिनती_2--) {
      पूर्णांक b[f()];
      अगर (गिनती_2 >= 0) {
          पूर्णांक a[f()];

          addr[गिनती_2] = a;

          जारी;
      }
  }

  अगर(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

व्योम test4()
{
  पूर्णांक गिनती_2 = 10;
  व्योम *addr[गिनती_2];
  करो {
    पूर्णांक a[f()];

    addr[--गिनती_2] = a;

    जारी;
  } जबतक (गिनती_2);

  अगर(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

व्योम test5()
{
  पूर्णांक गिनती_2 = 10;
  पूर्णांक a[f()];
  पूर्णांक c[f()];

  c[0] = 42;

  क्रम(;गिनती_2--;) {
    पूर्णांक b[f()];
    पूर्णांक i;
    क्रम (i=0; i<f(); i++) {
      b[i] = गिनती_2;
    }
  }

  अगर (c[0] == 42) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

पूर्णांक मुख्य(व्योम)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  वापस 0;
}
