#ಅನ್ತರ್ಭಾವ <stdio.h>

ಪೂರ್ಣಾಂಕ f(ಶೂನ್ಯ)
{
  ಹಿಂತಿರುಗಿ 5;
}

ಶೂನ್ಯ test1()
{
  ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_3 = 10;
  ಶೂನ್ಯ *addr[10];
  ಗಾಗಿ(;ಎಣಿಕೆ_3--;) {
    ಪೂರ್ಣಾಂಕ a[f()];

    addr[ಎಣಿಕೆ_3] = a;

    ಮುಂದುವರಿ;
  }

  ಆದರೆ(addr[9] == addr[0]) {
    ಬರೆ("OK\n");
  } ಇಲ್ಲದಿದ್ದರೆ {
    ಬರೆ("NOT OK\n");
  }
}

ಶೂನ್ಯ test2()
{
  ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_3 = 10;
  ಶೂನ್ಯ *addr[ಎಣಿಕೆ_3];
  ಗಾಗಿ(;ಎಣಿಕೆ_3--;) {
    ಪೂರ್ಣಾಂಕ a[f()];

    addr[ಎಣಿಕೆ_3] = a;

    ಮುಂದುವರಿ;
  }

  ಆದರೆ(addr[9] == addr[0]) {
    ಬರೆ("OK\n");
  } ಇಲ್ಲದಿದ್ದರೆ {
    ಬರೆ("NOT OK\n");
  }
}

ಶೂನ್ಯ test3()
{
  ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_3 = 10;
  ಶೂನ್ಯ *addr[ಎಣಿಕೆ_3];
  ಆಗ(ಎಣಿಕೆ_3--) {
      ಪೂರ್ಣಾಂಕ b[f()];
      ಆದರೆ (ಎಣಿಕೆ_3 >= 0) {
          ಪೂರ್ಣಾಂಕ a[f()];

          addr[ಎಣಿಕೆ_3] = a;

          ಮುಂದುವರಿ;
      }
  }

  ಆದರೆ(addr[9] == addr[0]) {
    ಬರೆ("OK\n");
  } ಇಲ್ಲದಿದ್ದರೆ {
    ಬರೆ("NOT OK\n");
  }
}

ಶೂನ್ಯ test4()
{
  ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_3 = 10;
  ಶೂನ್ಯ *addr[ಎಣಿಕೆ_3];
  ಮಾಡು {
    ಪೂರ್ಣಾಂಕ a[f()];

    addr[--ಎಣಿಕೆ_3] = a;

    ಮುಂದುವರಿ;
  } ಆಗ (ಎಣಿಕೆ_3);

  ಆದರೆ(addr[9] == addr[0]) {
    ಬರೆ("OK\n");
  } ಇಲ್ಲದಿದ್ದರೆ {
    ಬರೆ("NOT OK\n");
  }
}

ಶೂನ್ಯ test5()
{
  ಪೂರ್ಣಾಂಕ ಎಣಿಕೆ_3 = 10;
  ಪೂರ್ಣಾಂಕ a[f()];
  ಪೂರ್ಣಾಂಕ c[f()];

  c[0] = 42;

  ಗಾಗಿ(;ಎಣಿಕೆ_3--;) {
    ಪೂರ್ಣಾಂಕ b[f()];
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ (i=0; i<f(); i++) {
      b[i] = ಎಣಿಕೆ_3;
    }
  }

  ಆದರೆ (c[0] == 42) {
    ಬರೆ("OK\n");
  } ಇಲ್ಲದಿದ್ದರೆ {
    ಬರೆ("NOT OK\n");
  }
}

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  ಹಿಂತಿರುಗಿ 0;
}
