#ಅನ್ತರ್ಭಾವ <stdio.h>

ಪೂರ್ಣಾಙ್ಕ f(ಶೂನ್ಯ)
{
  ಪ್ರತ್ಯಾಗಮ 5;
}

ಶೂನ್ಯ test1()
{
  ಪೂರ್ಣಾಙ್ಕ ಎಣಿಕೆ_2 = 10;
  ಶೂನ್ಯ *addr[10];
  ಪ್ರತಿ(;ಎಣಿಕೆ_2--;) {
    ಪೂರ್ಣಾಙ್ಕ a[f()];

    addr[ಎಣಿಕೆ_2] = a;

    ಅನುವರ್ತ;
  }

  ಯದಿ(addr[9] == addr[0]) {
    printf("OK\n");
  } ಅನ್ಯಥಾ {
    printf("NOT OK\n");
  }
}

ಶೂನ್ಯ test2()
{
  ಪೂರ್ಣಾಙ್ಕ ಎಣಿಕೆ_2 = 10;
  ಶೂನ್ಯ *addr[ಎಣಿಕೆ_2];
  ಪ್ರತಿ(;ಎಣಿಕೆ_2--;) {
    ಪೂರ್ಣಾಙ್ಕ a[f()];

    addr[ಎಣಿಕೆ_2] = a;

    ಅನುವರ್ತ;
  }

  ಯದಿ(addr[9] == addr[0]) {
    printf("OK\n");
  } ಅನ್ಯಥಾ {
    printf("NOT OK\n");
  }
}

ಶೂನ್ಯ test3()
{
  ಪೂರ್ಣಾಙ್ಕ ಎಣಿಕೆ_2 = 10;
  ಶೂನ್ಯ *addr[ಎಣಿಕೆ_2];
  ಯಾವತ್(ಎಣಿಕೆ_2--) {
      ಪೂರ್ಣಾಙ್ಕ b[f()];
      ಯದಿ (ಎಣಿಕೆ_2 >= 0) {
          ಪೂರ್ಣಾಙ್ಕ a[f()];

          addr[ಎಣಿಕೆ_2] = a;

          ಅನುವರ್ತ;
      }
  }

  ಯದಿ(addr[9] == addr[0]) {
    printf("OK\n");
  } ಅನ್ಯಥಾ {
    printf("NOT OK\n");
  }
}

ಶೂನ್ಯ test4()
{
  ಪೂರ್ಣಾಙ್ಕ ಎಣಿಕೆ_2 = 10;
  ಶೂನ್ಯ *addr[ಎಣಿಕೆ_2];
  ಕುರು {
    ಪೂರ್ಣಾಙ್ಕ a[f()];

    addr[--ಎಣಿಕೆ_2] = a;

    ಅನುವರ್ತ;
  } ಯಾವತ್ (ಎಣಿಕೆ_2);

  ಯದಿ(addr[9] == addr[0]) {
    printf("OK\n");
  } ಅನ್ಯಥಾ {
    printf("NOT OK\n");
  }
}

ಶೂನ್ಯ test5()
{
  ಪೂರ್ಣಾಙ್ಕ ಎಣಿಕೆ_2 = 10;
  ಪೂರ್ಣಾಙ್ಕ a[f()];
  ಪೂರ್ಣಾಙ್ಕ c[f()];

  c[0] = 42;

  ಪ್ರತಿ(;ಎಣಿಕೆ_2--;) {
    ಪೂರ್ಣಾಙ್ಕ b[f()];
    ಪೂರ್ಣಾಙ್ಕ i;
    ಪ್ರತಿ (i=0; i<f(); i++) {
      b[i] = ಎಣಿಕೆ_2;
    }
  }

  ಯದಿ (c[0] == 42) {
    printf("OK\n");
  } ಅನ್ಯಥಾ {
    printf("NOT OK\n");
  }
}

ಪೂರ್ಣಾಙ್ಕ main(ಶೂನ್ಯ)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  ಪ್ರತ್ಯಾಗಮ 0;
}
