#अन्तर्भाव <stdio.h>

पूर्णाङ्क f(शून्य)
{
  प्रत्यागम 5;
}

शून्य test1()
{
  पूर्णाङ्क गिनती_2 = 10;
  शून्य *addr[10];
  प्रति(;गिनती_2--;) {
    पूर्णाङ्क a[f()];

    addr[गिनती_2] = a;

    अनुवर्त;
  }

  यदि(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test2()
{
  पूर्णाङ्क गिनती_2 = 10;
  शून्य *addr[गिनती_2];
  प्रति(;गिनती_2--;) {
    पूर्णाङ्क a[f()];

    addr[गिनती_2] = a;

    अनुवर्त;
  }

  यदि(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test3()
{
  पूर्णाङ्क गिनती_2 = 10;
  शून्य *addr[गिनती_2];
  यावत्(गिनती_2--) {
      पूर्णाङ्क b[f()];
      यदि (गिनती_2 >= 0) {
          पूर्णाङ्क a[f()];

          addr[गिनती_2] = a;

          अनुवर्त;
      }
  }

  यदि(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test4()
{
  पूर्णाङ्क गिनती_2 = 10;
  शून्य *addr[गिनती_2];
  कुरु {
    पूर्णाङ्क a[f()];

    addr[--गिनती_2] = a;

    अनुवर्त;
  } यावत् (गिनती_2);

  यदि(addr[9] == addr[0]) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

शून्य test5()
{
  पूर्णाङ्क गिनती_2 = 10;
  पूर्णाङ्क a[f()];
  पूर्णाङ्क c[f()];

  c[0] = 42;

  प्रति(;गिनती_2--;) {
    पूर्णाङ्क b[f()];
    पूर्णाङ्क i;
    प्रति (i=0; i<f(); i++) {
      b[i] = गिनती_2;
    }
  }

  यदि (c[0] == 42) {
    म_लिखो("OK\n");
  } अन्यथा {
    म_लिखो("NOT OK\n");
  }
}

पूर्णाङ्क main(शून्य)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  प्रत्यागम 0;
}
