#شامل <stdio.h>

صحیح f(خالی)
{
  واپس 5;
}

خالی test1()
{
  صحیح گنتی_2 = 10;
  خالی *addr[10];
  برائے(;گنتی_2--;) {
    صحیح a[f()];

    addr[گنتی_2] = a;

    جاری;
  }

  اگر(addr[9] == addr[0]) {
    لکھو("OK\n");
  } ورنہ {
    لکھو("NOT OK\n");
  }
}

خالی test2()
{
  صحیح گنتی_2 = 10;
  خالی *addr[گنتی_2];
  برائے(;گنتی_2--;) {
    صحیح a[f()];

    addr[گنتی_2] = a;

    جاری;
  }

  اگر(addr[9] == addr[0]) {
    لکھو("OK\n");
  } ورنہ {
    لکھو("NOT OK\n");
  }
}

خالی test3()
{
  صحیح گنتی_2 = 10;
  خالی *addr[گنتی_2];
  جب(گنتی_2--) {
      صحیح b[f()];
      اگر (گنتی_2 >= 0) {
          صحیح a[f()];

          addr[گنتی_2] = a;

          جاری;
      }
  }

  اگر(addr[9] == addr[0]) {
    لکھو("OK\n");
  } ورنہ {
    لکھو("NOT OK\n");
  }
}

خالی test4()
{
  صحیح گنتی_2 = 10;
  خالی *addr[گنتی_2];
  کرو {
    صحیح a[f()];

    addr[--گنتی_2] = a;

    جاری;
  } جب (گنتی_2);

  اگر(addr[9] == addr[0]) {
    لکھو("OK\n");
  } ورنہ {
    لکھو("NOT OK\n");
  }
}

خالی test5()
{
  صحیح گنتی_2 = 10;
  صحیح a[f()];
  صحیح c[f()];

  c[0] = 42;

  برائے(;گنتی_2--;) {
    صحیح b[f()];
    صحیح i;
    برائے (i=0; i<f(); i++) {
      b[i] = گنتی_2;
    }
  }

  اگر (c[0] == 42) {
    لکھو("OK\n");
  } ورنہ {
    لکھو("NOT OK\n");
  }
}

صحیح مین(خالی)
{
  test1();
  test2();
  test3();
  test4();
  test5();

  واپس 0;
}
