#ಅನ್ತರ್ಭಾವ <stdio.h>
ರಚನೆ wchar {
    ಅಕ್ಷರ *ದತ್ತಾಂಶ; ಅಕ್ಷರ mem[];
};
ರಚನೆ wint {
    ಅಕ್ಷರ *ದತ್ತಾಂಶ; ಪೂರ್ಣಾಂಕ mem[];
};
ಪೂರ್ಣಾಂಕ f1char (ಶೂನ್ಯ) {
    ಅಕ್ಷರ s[9]="nonono";
    ರಚನೆ wchar q = {"bugs"};
    ಹಿಂತಿರುಗಿ !s[0];
}
ಪೂರ್ಣಾಂಕ f1int (ಶೂನ್ಯ) {
    ಅಕ್ಷರ s[9]="nonono";
    ರಚನೆ wint q = {"bugs"};
    ಹಿಂತಿರುಗಿ !s[0];
}
ಪೂರ್ಣಾಂಕ ಖಾಲಿಗಳು[] = {}; // GNU extension
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ (ಶೂನ್ಯ) {
   ಅಕ್ಷರ s[9]="nonono";
   ಸ್ಥಿರ ರಚನೆ wchar q = {"bugs", {'c'}};
   //printf ("tcc has %s %s\n", s, q.data);
   ಆದರೆ (f1char() || f1int())
     ಬರೆ ("bla\n");
   ಹಿಂತಿರುಗಿ !s[0];
}
