#अन्तर्भाव <stdio.h>
संरचना wchar {
    वर्ण *दत्त; वर्ण mem[];
};
संरचना wint {
    वर्ण *दत्त; पूर्णाङ्क mem[];
};
पूर्णाङ्क f1char (शून्य) {
    वर्ण s[9]="nonono";
    संरचना wchar q = {"bugs"};
    प्रत्यागम !s[0];
}
पूर्णाङ्क f1int (शून्य) {
    वर्ण s[9]="nonono";
    संरचना wint q = {"bugs"};
    प्रत्यागम !s[0];
}
पूर्णाङ्क रिक्तानि[] = {}; // GNU extension
पूर्णाङ्क मुख्यम् (शून्य) {
   वर्ण s[9]="nonono";
   स्थिर संरचना wchar q = {"bugs", {'c'}};
   //printf ("tcc has %s %s\n", s, q.data);
   यदि (f1char() || f1int())
     प्रारूप_लिख ("bla\n");
   प्रत्यागम !s[0];
}
