#అన్తర్భావ <stdio.h>
నిర్మాణం wchar {
    అక్షరం *దత్తాంశం; అక్షరం mem[];
};
నిర్మాణం wint {
    అక్షరం *దత్తాంశం; పూర్ణాంకం mem[];
};
పూర్ణాంకం f1char (శూన్య) {
    అక్షరం s[9]="nonono";
    నిర్మాణం wchar q = {"bugs"};
    తిరిగి !s[0];
}
పూర్ణాంకం f1int (శూన్య) {
    అక్షరం s[9]="nonono";
    నిర్మాణం wint q = {"bugs"};
    తిరిగి !s[0];
}
పూర్ణాంకం ఖాళీలు[] = {}; // GNU extension
పూర్ణాంకం ప్రధాన (శూన్య) {
   అక్షరం s[9]="nonono";
   స్థిర నిర్మాణం wchar q = {"bugs", {'c'}};
   //printf ("tcc has %s %s\n", s, q.data);
   ఒకవేళ (f1char() || f1int())
     రాయి ("bla\n");
   తిరిగి !s[0];
}
