/* The following are all valid decls, even though some subtypes
   are incomplete.  */
గణన E *e;
స్థిరరాశి గణన E *e1;
గణన E స్థిరరాశి *e2;
నిర్మాణం S *s;
స్థిరరాశి నిర్మాణం S *s1;
నిర్మాణం S స్థిరరాశి *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
రకనిర్వచనం పూర్ణాంకం (*fptr1)();
పూర్ణాంకం f1 (పూర్ణాంకం (), పూర్ణాంకం);
రకనిర్వచనం పూర్ణాంకం (*fptr2)(పూర్ణాంకం x);
పూర్ణాంకం f2 (పూర్ణాంకం (పూర్ణాంకం x), పూర్ణాంకం);
రకనిర్వచనం పూర్ణాంకం (*fptr3)(పూర్ణాంకం);
పూర్ణాంకం f3 (పూర్ణాంకం (పూర్ణాంకం), పూర్ణాంకం);
రకనిర్వచనం పూర్ణాంకం (*fptr4[4])(పూర్ణాంకం);
పూర్ణాంకం f4 (పూర్ణాంకం (*[4])(పూర్ణాంకం), పూర్ణాంకం);
రకనిర్వచనం పూర్ణాంకం (*fptr5)(fptr1);
పూర్ణాంకం f5 (పూర్ణాంకం (పూర్ణాంకం()), fptr1);
పూర్ణాంకం f1 (fptr1 fp, పూర్ణాంకం i)
{
  తిరిగి (*fp)(i);
}
పూర్ణాంకం f2 (fptr2 fp, పూర్ణాంకం i)
{
  తిరిగి (*fp)(i);
}
పూర్ణాంకం f3 (fptr3 fp, పూర్ణాంకం i)
{
  తిరిగి (*fp)(i);
}
పూర్ణాంకం f4 (fptr4 fp, పూర్ణాంకం i)
{
  తిరిగి (*fp[i])(i);
}
పూర్ణాంకం f5 (fptr5 fp, fptr1 i)
{
  తిరిగి fp(i);
}
రకనిర్వచనం పూర్ణాంకం intx4[4];
పూర్ణాంకం f8 (intx4, పూర్ణాంకం);
పూర్ణాంకం f8 (పూర్ణాంకం ([4]), పూర్ణాంకం);
పూర్ణాంకం f8 (పూర్ణాంకం y[4], పూర్ణాంకం i)
{
  తిరిగి y[i];
}
పూర్ణాంకం f9 (పూర్ణాంకం (*)(పూర్ణాంకం), పూర్ణాంకం);
పూర్ణాంకం f9 (పూర్ణాంకం ((పూర్ణాంకం)), పూర్ణాంకం);
పూర్ణాంకం f9 (పూర్ణాంకం f(పూర్ణాంకం), పూర్ణాంకం i)
{
  తిరిగి f(i);
}
పూర్ణాంకం ప్రధాన () { తిరిగి 0; }
