/* The following are all valid decls, even though some subtypes
   are incomplete.  */
গণনা E *e;
ধ্রুবক গণনা E *e1;
গণনা E ধ্রুবক *e2;
কাঠামো S *s;
ধ্রুবক কাঠামো S *s1;
কাঠামো S ধ্রুবক *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
প্রকারলেখ পূর্ণসংখ্যা (*fptr1)();
পূর্ণসংখ্যা f1 (পূর্ণসংখ্যা (), পূর্ণসংখ্যা);
প্রকারলেখ পূর্ণসংখ্যা (*fptr2)(পূর্ণসংখ্যা x);
পূর্ণসংখ্যা f2 (পূর্ণসংখ্যা (পূর্ণসংখ্যা x), পূর্ণসংখ্যা);
প্রকারলেখ পূর্ণসংখ্যা (*fptr3)(পূর্ণসংখ্যা);
পূর্ণসংখ্যা f3 (পূর্ণসংখ্যা (পূর্ণসংখ্যা), পূর্ণসংখ্যা);
প্রকারলেখ পূর্ণসংখ্যা (*fptr4[4])(পূর্ণসংখ্যা);
পূর্ণসংখ্যা f4 (পূর্ণসংখ্যা (*[4])(পূর্ণসংখ্যা), পূর্ণসংখ্যা);
প্রকারলেখ পূর্ণসংখ্যা (*fptr5)(fptr1);
পূর্ণসংখ্যা f5 (পূর্ণসংখ্যা (পূর্ণসংখ্যা()), fptr1);
পূর্ণসংখ্যা f1 (fptr1 fp, পূর্ণসংখ্যা i)
{
  ফেরত (*fp)(i);
}
পূর্ণসংখ্যা f2 (fptr2 fp, পূর্ণসংখ্যা i)
{
  ফেরত (*fp)(i);
}
পূর্ণসংখ্যা f3 (fptr3 fp, পূর্ণসংখ্যা i)
{
  ফেরত (*fp)(i);
}
পূর্ণসংখ্যা f4 (fptr4 fp, পূর্ণসংখ্যা i)
{
  ফেরত (*fp[i])(i);
}
পূর্ণসংখ্যা f5 (fptr5 fp, fptr1 i)
{
  ফেরত fp(i);
}
প্রকারলেখ পূর্ণসংখ্যা intx4[4];
পূর্ণসংখ্যা f8 (intx4, পূর্ণসংখ্যা);
পূর্ণসংখ্যা f8 (পূর্ণসংখ্যা ([4]), পূর্ণসংখ্যা);
পূর্ণসংখ্যা f8 (পূর্ণসংখ্যা y[4], পূর্ণসংখ্যা i)
{
  ফেরত y[i];
}
পূর্ণসংখ্যা f9 (পূর্ণসংখ্যা (*)(পূর্ণসংখ্যা), পূর্ণসংখ্যা);
পূর্ণসংখ্যা f9 (পূর্ণসংখ্যা ((পূর্ণসংখ্যা)), পূর্ণসংখ্যা);
পূর্ণসংখ্যা f9 (পূর্ণসংখ্যা f(পূর্ণসংখ্যা), পূর্ণসংখ্যা i)
{
  ফেরত f(i);
}
পূর্ণসংখ্যা প্রধান () { ফেরত 0; }
