/* The following are all valid decls, even though some subtypes
   are incomplete.  */
क्रमागत E *e;
स्थिर क्रमागत E *e1;
क्रमागत E स्थिर *e2;
काष्ठा S *s;
स्थिर काष्ठा S *s1;
काष्ठा S स्थिर *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
प्रकार पूर्णांक (*fptr1)();
पूर्णांक f1 (पूर्णांक (), पूर्णांक);
प्रकार पूर्णांक (*fptr2)(पूर्णांक x);
पूर्णांक f2 (पूर्णांक (पूर्णांक x), पूर्णांक);
प्रकार पूर्णांक (*fptr3)(पूर्णांक);
पूर्णांक f3 (पूर्णांक (पूर्णांक), पूर्णांक);
प्रकार पूर्णांक (*fptr4[4])(पूर्णांक);
पूर्णांक f4 (पूर्णांक (*[4])(पूर्णांक), पूर्णांक);
प्रकार पूर्णांक (*fptr5)(fptr1);
पूर्णांक f5 (पूर्णांक (पूर्णांक()), fptr1);
पूर्णांक f1 (fptr1 fp, पूर्णांक i)
{
  वापस (*fp)(i);
}
पूर्णांक f2 (fptr2 fp, पूर्णांक i)
{
  वापस (*fp)(i);
}
पूर्णांक f3 (fptr3 fp, पूर्णांक i)
{
  वापस (*fp)(i);
}
पूर्णांक f4 (fptr4 fp, पूर्णांक i)
{
  वापस (*fp[i])(i);
}
पूर्णांक f5 (fptr5 fp, fptr1 i)
{
  वापस fp(i);
}
प्रकार पूर्णांक intx4[4];
पूर्णांक f8 (intx4, पूर्णांक);
पूर्णांक f8 (पूर्णांक ([4]), पूर्णांक);
पूर्णांक f8 (पूर्णांक y[4], पूर्णांक i)
{
  वापस y[i];
}
पूर्णांक f9 (पूर्णांक (*)(पूर्णांक), पूर्णांक);
पूर्णांक f9 (पूर्णांक ((पूर्णांक)), पूर्णांक);
पूर्णांक f9 (पूर्णांक f(पूर्णांक), पूर्णांक i)
{
  वापस f(i);
}
पूर्णांक मुख्य () { वापस 0; }
