/* The following are all valid decls, even though some subtypes
   are incomplete.  */
গণনা E *e;
ধ্রুব গণনা E *e1;
গণনা E ধ্রুব *e2;
সংরচনা S *s;
ধ্রুব সংরচনা S *s1;
সংরচনা S ধ্রুব *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
প্রকারনির্দেশ পূর্ণাঙ্ক (*fptr1)();
পূর্ণাঙ্ক f1 (পূর্ণাঙ্ক (), পূর্ণাঙ্ক);
প্রকারনির্দেশ পূর্ণাঙ্ক (*fptr2)(পূর্ণাঙ্ক x);
পূর্ণাঙ্ক f2 (পূর্ণাঙ্ক (পূর্ণাঙ্ক x), পূর্ণাঙ্ক);
প্রকারনির্দেশ পূর্ণাঙ্ক (*fptr3)(পূর্ণাঙ্ক);
পূর্ণাঙ্ক f3 (পূর্ণাঙ্ক (পূর্ণাঙ্ক), পূর্ণাঙ্ক);
প্রকারনির্দেশ পূর্ণাঙ্ক (*fptr4[4])(পূর্ণাঙ্ক);
পূর্ণাঙ্ক f4 (পূর্ণাঙ্ক (*[4])(পূর্ণাঙ্ক), পূর্ণাঙ্ক);
প্রকারনির্দেশ পূর্ণাঙ্ক (*fptr5)(fptr1);
পূর্ণাঙ্ক f5 (পূর্ণাঙ্ক (পূর্ণাঙ্ক()), fptr1);
পূর্ণাঙ্ক f1 (fptr1 fp, পূর্ণাঙ্ক i)
{
  প্রত্যাগম (*fp)(i);
}
পূর্ণাঙ্ক f2 (fptr2 fp, পূর্ণাঙ্ক i)
{
  প্রত্যাগম (*fp)(i);
}
পূর্ণাঙ্ক f3 (fptr3 fp, পূর্ণাঙ্ক i)
{
  প্রত্যাগম (*fp)(i);
}
পূর্ণাঙ্ক f4 (fptr4 fp, পূর্ণাঙ্ক i)
{
  প্রত্যাগম (*fp[i])(i);
}
পূর্ণাঙ্ক f5 (fptr5 fp, fptr1 i)
{
  প্রত্যাগম fp(i);
}
প্রকারনির্দেশ পূর্ণাঙ্ক intx4[4];
পূর্ণাঙ্ক f8 (intx4, পূর্ণাঙ্ক);
পূর্ণাঙ্ক f8 (পূর্ণাঙ্ক ([4]), পূর্ণাঙ্ক);
পূর্ণাঙ্ক f8 (পূর্ণাঙ্ক y[4], পূর্ণাঙ্ক i)
{
  প্রত্যাগম y[i];
}
পূর্ণাঙ্ক f9 (পূর্ণাঙ্ক (*)(পূর্ণাঙ্ক), পূর্ণাঙ্ক);
পূর্ণাঙ্ক f9 (পূর্ণাঙ্ক ((পূর্ণাঙ্ক)), পূর্ণাঙ্ক);
পূর্ণাঙ্ক f9 (পূর্ণাঙ্ক f(পূর্ণাঙ্ক), পূর্ণাঙ্ক i)
{
  প্রত্যাগম f(i);
}
পূর্ণাঙ্ক main () { প্রত্যাগম 0; }
