/* The following are all valid decls, even though some subtypes
   are incomplete.  */
ગણના E *e;
અચલ ગણના E *e1;
ગણના E અચલ *e2;
સંરચના S *s;
અચલ સંરચના S *s1;
સંરચના S અચલ *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
પ્રકારવ્યાખ્યા પૂર્ણાંક (*fptr1)();
પૂર્ણાંક f1 (પૂર્ણાંક (), પૂર્ણાંક);
પ્રકારવ્યાખ્યા પૂર્ણાંક (*fptr2)(પૂર્ણાંક x);
પૂર્ણાંક f2 (પૂર્ણાંક (પૂર્ણાંક x), પૂર્ણાંક);
પ્રકારવ્યાખ્યા પૂર્ણાંક (*fptr3)(પૂર્ણાંક);
પૂર્ણાંક f3 (પૂર્ણાંક (પૂર્ણાંક), પૂર્ણાંક);
પ્રકારવ્યાખ્યા પૂર્ણાંક (*fptr4[4])(પૂર્ણાંક);
પૂર્ણાંક f4 (પૂર્ણાંક (*[4])(પૂર્ણાંક), પૂર્ણાંક);
પ્રકારવ્યાખ્યા પૂર્ણાંક (*fptr5)(fptr1);
પૂર્ણાંક f5 (પૂર્ણાંક (પૂર્ણાંક()), fptr1);
પૂર્ણાંક f1 (fptr1 fp, પૂર્ણાંક i)
{
  પાછા (*fp)(i);
}
પૂર્ણાંક f2 (fptr2 fp, પૂર્ણાંક i)
{
  પાછા (*fp)(i);
}
પૂર્ણાંક f3 (fptr3 fp, પૂર્ણાંક i)
{
  પાછા (*fp)(i);
}
પૂર્ણાંક f4 (fptr4 fp, પૂર્ણાંક i)
{
  પાછા (*fp[i])(i);
}
પૂર્ણાંક f5 (fptr5 fp, fptr1 i)
{
  પાછા fp(i);
}
પ્રકારવ્યાખ્યા પૂર્ણાંક intx4[4];
પૂર્ણાંક f8 (intx4, પૂર્ણાંક);
પૂર્ણાંક f8 (પૂર્ણાંક ([4]), પૂર્ણાંક);
પૂર્ણાંક f8 (પૂર્ણાંક y[4], પૂર્ણાંક i)
{
  પાછા y[i];
}
પૂર્ણાંક f9 (પૂર્ણાંક (*)(પૂર્ણાંક), પૂર્ણાંક);
પૂર્ણાંક f9 (પૂર્ણાંક ((પૂર્ણાંક)), પૂર્ણાંક);
પૂર્ણાંક f9 (પૂર્ણાંક f(પૂર્ણાંક), પૂર્ણાંક i)
{
  પાછા f(i);
}
પૂર્ણાંક મુખ્ય () { પાછા 0; }
