/* The following are all valid decls, even though some subtypes
   are incomplete.  */
ಗಣನಾ E *e;
ಧ್ರುವ ಗಣನಾ E *e1;
ಗಣನಾ E ಧ್ರುವ *e2;
ಸಂರಚನಾ S *s;
ಧ್ರುವ ಸಂರಚನಾ S *s1;
ಸಂರಚನಾ S ಧ್ರುವ *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
ಪ್ರಕಾರನಿರ್ದೇಶ ಪೂರ್ಣಾಙ್ಕ (*fptr1)();
ಪೂರ್ಣಾಙ್ಕ f1 (ಪೂರ್ಣಾಙ್ಕ (), ಪೂರ್ಣಾಙ್ಕ);
ಪ್ರಕಾರನಿರ್ದೇಶ ಪೂರ್ಣಾಙ್ಕ (*fptr2)(ಪೂರ್ಣಾಙ್ಕ x);
ಪೂರ್ಣಾಙ್ಕ f2 (ಪೂರ್ಣಾಙ್ಕ (ಪೂರ್ಣಾಙ್ಕ x), ಪೂರ್ಣಾಙ್ಕ);
ಪ್ರಕಾರನಿರ್ದೇಶ ಪೂರ್ಣಾಙ್ಕ (*fptr3)(ಪೂರ್ಣಾಙ್ಕ);
ಪೂರ್ಣಾಙ್ಕ f3 (ಪೂರ್ಣಾಙ್ಕ (ಪೂರ್ಣಾಙ್ಕ), ಪೂರ್ಣಾಙ್ಕ);
ಪ್ರಕಾರನಿರ್ದೇಶ ಪೂರ್ಣಾಙ್ಕ (*fptr4[4])(ಪೂರ್ಣಾಙ್ಕ);
ಪೂರ್ಣಾಙ್ಕ f4 (ಪೂರ್ಣಾಙ್ಕ (*[4])(ಪೂರ್ಣಾಙ್ಕ), ಪೂರ್ಣಾಙ್ಕ);
ಪ್ರಕಾರನಿರ್ದೇಶ ಪೂರ್ಣಾಙ್ಕ (*fptr5)(fptr1);
ಪೂರ್ಣಾಙ್ಕ f5 (ಪೂರ್ಣಾಙ್ಕ (ಪೂರ್ಣಾಙ್ಕ()), fptr1);
ಪೂರ್ಣಾಙ್ಕ f1 (fptr1 fp, ಪೂರ್ಣಾಙ್ಕ i)
{
  ಪ್ರತ್ಯಾಗಮ (*fp)(i);
}
ಪೂರ್ಣಾಙ್ಕ f2 (fptr2 fp, ಪೂರ್ಣಾಙ್ಕ i)
{
  ಪ್ರತ್ಯಾಗಮ (*fp)(i);
}
ಪೂರ್ಣಾಙ್ಕ f3 (fptr3 fp, ಪೂರ್ಣಾಙ್ಕ i)
{
  ಪ್ರತ್ಯಾಗಮ (*fp)(i);
}
ಪೂರ್ಣಾಙ್ಕ f4 (fptr4 fp, ಪೂರ್ಣಾಙ್ಕ i)
{
  ಪ್ರತ್ಯಾಗಮ (*fp[i])(i);
}
ಪೂರ್ಣಾಙ್ಕ f5 (fptr5 fp, fptr1 i)
{
  ಪ್ರತ್ಯಾಗಮ fp(i);
}
ಪ್ರಕಾರನಿರ್ದೇಶ ಪೂರ್ಣಾಙ್ಕ intx4[4];
ಪೂರ್ಣಾಙ್ಕ f8 (intx4, ಪೂರ್ಣಾಙ್ಕ);
ಪೂರ್ಣಾಙ್ಕ f8 (ಪೂರ್ಣಾಙ್ಕ ([4]), ಪೂರ್ಣಾಙ್ಕ);
ಪೂರ್ಣಾಙ್ಕ f8 (ಪೂರ್ಣಾಙ್ಕ y[4], ಪೂರ್ಣಾಙ್ಕ i)
{
  ಪ್ರತ್ಯಾಗಮ y[i];
}
ಪೂರ್ಣಾಙ್ಕ f9 (ಪೂರ್ಣಾಙ್ಕ (*)(ಪೂರ್ಣಾಙ್ಕ), ಪೂರ್ಣಾಙ್ಕ);
ಪೂರ್ಣಾಙ್ಕ f9 (ಪೂರ್ಣಾಙ್ಕ ((ಪೂರ್ಣಾಙ್ಕ)), ಪೂರ್ಣಾಙ್ಕ);
ಪೂರ್ಣಾಙ್ಕ f9 (ಪೂರ್ಣಾಙ್ಕ f(ಪೂರ್ಣಾಙ್ಕ), ಪೂರ್ಣಾಙ್ಕ i)
{
  ಪ್ರತ್ಯಾಗಮ f(i);
}
ಪೂರ್ಣಾಙ್ಕ main () { ಪ್ರತ್ಯಾಗಮ 0; }
