/* The following are all valid decls, even though some subtypes
   are incomplete.  */
गणना E *e;
स्थिरांक गणना E *e1;
गणना E स्थिरांक *e2;
संरचना S *s;
स्थिरांक संरचना S *s1;
संरचना S स्थिरांक *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
प्रकारव्याख्या पूर्णांक (*fptr1)();
पूर्णांक f1 (पूर्णांक (), पूर्णांक);
प्रकारव्याख्या पूर्णांक (*fptr2)(पूर्णांक x);
पूर्णांक f2 (पूर्णांक (पूर्णांक x), पूर्णांक);
प्रकारव्याख्या पूर्णांक (*fptr3)(पूर्णांक);
पूर्णांक f3 (पूर्णांक (पूर्णांक), पूर्णांक);
प्रकारव्याख्या पूर्णांक (*fptr4[4])(पूर्णांक);
पूर्णांक f4 (पूर्णांक (*[4])(पूर्णांक), पूर्णांक);
प्रकारव्याख्या पूर्णांक (*fptr5)(fptr1);
पूर्णांक f5 (पूर्णांक (पूर्णांक()), fptr1);
पूर्णांक f1 (fptr1 fp, पूर्णांक i)
{
  परत (*fp)(i);
}
पूर्णांक f2 (fptr2 fp, पूर्णांक i)
{
  परत (*fp)(i);
}
पूर्णांक f3 (fptr3 fp, पूर्णांक i)
{
  परत (*fp)(i);
}
पूर्णांक f4 (fptr4 fp, पूर्णांक i)
{
  परत (*fp[i])(i);
}
पूर्णांक f5 (fptr5 fp, fptr1 i)
{
  परत fp(i);
}
प्रकारव्याख्या पूर्णांक intx4[4];
पूर्णांक f8 (intx4, पूर्णांक);
पूर्णांक f8 (पूर्णांक ([4]), पूर्णांक);
पूर्णांक f8 (पूर्णांक y[4], पूर्णांक i)
{
  परत y[i];
}
पूर्णांक f9 (पूर्णांक (*)(पूर्णांक), पूर्णांक);
पूर्णांक f9 (पूर्णांक ((पूर्णांक)), पूर्णांक);
पूर्णांक f9 (पूर्णांक f(पूर्णांक), पूर्णांक i)
{
  परत f(i);
}
पूर्णांक main () { परत 0; }
