/* The following are all valid decls, even though some subtypes
   are incomplete.  */
ಎಣಿಕೆ E *e;
ಸ್ಥಿರಾಂಕ ಎಣಿಕೆ E *e1;
ಎಣಿಕೆ E ಸ್ಥಿರಾಂಕ *e2;
ರಚನೆ S *s;
ಸ್ಥಿರಾಂಕ ರಚನೆ S *s1;
ರಚನೆ S ಸ್ಥಿರಾಂಕ *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ (*fptr1)();
ಪೂರ್ಣಾಂಕ f1 (ಪೂರ್ಣಾಂಕ (), ಪೂರ್ಣಾಂಕ);
ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ (*fptr2)(ಪೂರ್ಣಾಂಕ x);
ಪೂರ್ಣಾಂಕ f2 (ಪೂರ್ಣಾಂಕ (ಪೂರ್ಣಾಂಕ x), ಪೂರ್ಣಾಂಕ);
ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ (*fptr3)(ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ f3 (ಪೂರ್ಣಾಂಕ (ಪೂರ್ಣಾಂಕ), ಪೂರ್ಣಾಂಕ);
ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ (*fptr4[4])(ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ f4 (ಪೂರ್ಣಾಂಕ (*[4])(ಪೂರ್ಣಾಂಕ), ಪೂರ್ಣಾಂಕ);
ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ (*fptr5)(fptr1);
ಪೂರ್ಣಾಂಕ f5 (ಪೂರ್ಣಾಂಕ (ಪೂರ್ಣಾಂಕ()), fptr1);
ಪೂರ್ಣಾಂಕ f1 (fptr1 fp, ಪೂರ್ಣಾಂಕ i)
{
  ಹಿಂತಿರುಗಿ (*fp)(i);
}
ಪೂರ್ಣಾಂಕ f2 (fptr2 fp, ಪೂರ್ಣಾಂಕ i)
{
  ಹಿಂತಿರುಗಿ (*fp)(i);
}
ಪೂರ್ಣಾಂಕ f3 (fptr3 fp, ಪೂರ್ಣಾಂಕ i)
{
  ಹಿಂತಿರುಗಿ (*fp)(i);
}
ಪೂರ್ಣಾಂಕ f4 (fptr4 fp, ಪೂರ್ಣಾಂಕ i)
{
  ಹಿಂತಿರುಗಿ (*fp[i])(i);
}
ಪೂರ್ಣಾಂಕ f5 (fptr5 fp, fptr1 i)
{
  ಹಿಂತಿರುಗಿ fp(i);
}
ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ intx4[4];
ಪೂರ್ಣಾಂಕ f8 (intx4, ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ f8 (ಪೂರ್ಣಾಂಕ ([4]), ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ f8 (ಪೂರ್ಣಾಂಕ y[4], ಪೂರ್ಣಾಂಕ i)
{
  ಹಿಂತಿರುಗಿ y[i];
}
ಪೂರ್ಣಾಂಕ f9 (ಪೂರ್ಣಾಂಕ (*)(ಪೂರ್ಣಾಂಕ), ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ f9 (ಪೂರ್ಣಾಂಕ ((ಪೂರ್ಣಾಂಕ)), ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ f9 (ಪೂರ್ಣಾಂಕ f(ಪೂರ್ಣಾಂಕ), ಪೂರ್ಣಾಂಕ i)
{
  ಹಿಂತಿರುಗಿ f(i);
}
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ () { ಹಿಂತಿರುಗಿ 0; }
