/* The following are all valid decls, even though some subtypes
   are incomplete.  */
എണ്ണൽ E *e;
സ്ഥിരം എണ്ണൽ E *e1;
എണ്ണൽ E സ്ഥിരം *e2;
ഘടന S *s;
സ്ഥിരം ഘടന S *s1;
ഘടന S സ്ഥിരം *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
തരനിർവചനം പൂർണ്ണസംഖ്യ (*fptr1)();
പൂർണ്ണസംഖ്യ f1 (പൂർണ്ണസംഖ്യ (), പൂർണ്ണസംഖ്യ);
തരനിർവചനം പൂർണ്ണസംഖ്യ (*fptr2)(പൂർണ്ണസംഖ്യ x);
പൂർണ്ണസംഖ്യ f2 (പൂർണ്ണസംഖ്യ (പൂർണ്ണസംഖ്യ x), പൂർണ്ണസംഖ്യ);
തരനിർവചനം പൂർണ്ണസംഖ്യ (*fptr3)(പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ f3 (പൂർണ്ണസംഖ്യ (പൂർണ്ണസംഖ്യ), പൂർണ്ണസംഖ്യ);
തരനിർവചനം പൂർണ്ണസംഖ്യ (*fptr4[4])(പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ f4 (പൂർണ്ണസംഖ്യ (*[4])(പൂർണ്ണസംഖ്യ), പൂർണ്ണസംഖ്യ);
തരനിർവചനം പൂർണ്ണസംഖ്യ (*fptr5)(fptr1);
പൂർണ്ണസംഖ്യ f5 (പൂർണ്ണസംഖ്യ (പൂർണ്ണസംഖ്യ()), fptr1);
പൂർണ്ണസംഖ്യ f1 (fptr1 fp, പൂർണ്ണസംഖ്യ i)
{
  തിരികെ (*fp)(i);
}
പൂർണ്ണസംഖ്യ f2 (fptr2 fp, പൂർണ്ണസംഖ്യ i)
{
  തിരികെ (*fp)(i);
}
പൂർണ്ണസംഖ്യ f3 (fptr3 fp, പൂർണ്ണസംഖ്യ i)
{
  തിരികെ (*fp)(i);
}
പൂർണ്ണസംഖ്യ f4 (fptr4 fp, പൂർണ്ണസംഖ്യ i)
{
  തിരികെ (*fp[i])(i);
}
പൂർണ്ണസംഖ്യ f5 (fptr5 fp, fptr1 i)
{
  തിരികെ fp(i);
}
തരനിർവചനം പൂർണ്ണസംഖ്യ intx4[4];
പൂർണ്ണസംഖ്യ f8 (intx4, പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ f8 (പൂർണ്ണസംഖ്യ ([4]), പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ f8 (പൂർണ്ണസംഖ്യ y[4], പൂർണ്ണസംഖ്യ i)
{
  തിരികെ y[i];
}
പൂർണ്ണസംഖ്യ f9 (പൂർണ്ണസംഖ്യ (*)(പൂർണ്ണസംഖ്യ), പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ f9 (പൂർണ്ണസംഖ്യ ((പൂർണ്ണസംഖ്യ)), പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ f9 (പൂർണ്ണസംഖ്യ f(പൂർണ്ണസംഖ്യ), പൂർണ്ണസംഖ്യ i)
{
  തിരികെ f(i);
}
പൂർണ്ണസംഖ്യ പ്രധാന () { തിരികെ 0; }
