/* The following are all valid decls, even though some subtypes
   are incomplete.  */
ଗଣନା E *e;
ଅଚଳ ଗଣନା E *e1;
ଗଣନା E ଅଚଳ *e2;
ସଂରଚନା S *s;
ଅଚଳ ସଂରଚନା S *s1;
ସଂରଚନା S ଅଚଳ *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
ପ୍ରକାରବ୍ୟାଖ୍ୟା ପୂର୍ଣ୍ଣସଂଖ୍ୟା (*fptr1)();
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f1 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା (), ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପ୍ରକାରବ୍ୟାଖ୍ୟା ପୂର୍ଣ୍ଣସଂଖ୍ୟା (*fptr2)(ପୂର୍ଣ୍ଣସଂଖ୍ୟା x);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f2 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା (ପୂର୍ଣ୍ଣସଂଖ୍ୟା x), ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପ୍ରକାରବ୍ୟାଖ୍ୟା ପୂର୍ଣ୍ଣସଂଖ୍ୟା (*fptr3)(ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f3 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା (ପୂର୍ଣ୍ଣସଂଖ୍ୟା), ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପ୍ରକାରବ୍ୟାଖ୍ୟା ପୂର୍ଣ୍ଣସଂଖ୍ୟା (*fptr4[4])(ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f4 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା (*[4])(ପୂର୍ଣ୍ଣସଂଖ୍ୟା), ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପ୍ରକାରବ୍ୟାଖ୍ୟା ପୂର୍ଣ୍ଣସଂଖ୍ୟା (*fptr5)(fptr1);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f5 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା (ପୂର୍ଣ୍ଣସଂଖ୍ୟା()), fptr1);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f1 (fptr1 fp, ପୂର୍ଣ୍ଣସଂଖ୍ୟା i)
{
  ଫେରନ୍ତୁ (*fp)(i);
}
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f2 (fptr2 fp, ପୂର୍ଣ୍ଣସଂଖ୍ୟା i)
{
  ଫେରନ୍ତୁ (*fp)(i);
}
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f3 (fptr3 fp, ପୂର୍ଣ୍ଣସଂଖ୍ୟା i)
{
  ଫେରନ୍ତୁ (*fp)(i);
}
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f4 (fptr4 fp, ପୂର୍ଣ୍ଣସଂଖ୍ୟା i)
{
  ଫେରନ୍ତୁ (*fp[i])(i);
}
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f5 (fptr5 fp, fptr1 i)
{
  ଫେରନ୍ତୁ fp(i);
}
ପ୍ରକାରବ୍ୟାଖ୍ୟା ପୂର୍ଣ୍ଣସଂଖ୍ୟା intx4[4];
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f8 (intx4, ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f8 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା ([4]), ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f8 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା y[4], ପୂର୍ଣ୍ଣସଂଖ୍ୟା i)
{
  ଫେରନ୍ତୁ y[i];
}
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f9 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା (*)(ପୂର୍ଣ୍ଣସଂଖ୍ୟା), ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f9 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା ((ପୂର୍ଣ୍ଣସଂଖ୍ୟା)), ପୂର୍ଣ୍ଣସଂଖ୍ୟା);
ପୂର୍ଣ୍ଣସଂଖ୍ୟା f9 (ପୂର୍ଣ୍ଣସଂଖ୍ୟା f(ପୂର୍ଣ୍ଣସଂଖ୍ୟା), ପୂର୍ଣ୍ଣସଂଖ୍ୟା i)
{
  ଫେରନ୍ତୁ f(i);
}
ପୂର୍ଣ୍ଣସଂଖ୍ୟା ମୁଖ୍ୟ () { ଫେରନ୍ତୁ 0; }
