/* The following are all valid decls, even though some subtypes
   are incomplete.  */
गणना E *e;
ध्रुव गणना E *e1;
गणना E ध्रुव *e2;
संरचना S *s;
ध्रुव संरचना S *s1;
संरचना S ध्रुव *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
प्रकारनिर्देश पूर्णाङ्क (*fptr1)();
पूर्णाङ्क f1 (पूर्णाङ्क (), पूर्णाङ्क);
प्रकारनिर्देश पूर्णाङ्क (*fptr2)(पूर्णाङ्क x);
पूर्णाङ्क f2 (पूर्णाङ्क (पूर्णाङ्क x), पूर्णाङ्क);
प्रकारनिर्देश पूर्णाङ्क (*fptr3)(पूर्णाङ्क);
पूर्णाङ्क f3 (पूर्णाङ्क (पूर्णाङ्क), पूर्णाङ्क);
प्रकारनिर्देश पूर्णाङ्क (*fptr4[4])(पूर्णाङ्क);
पूर्णाङ्क f4 (पूर्णाङ्क (*[4])(पूर्णाङ्क), पूर्णाङ्क);
प्रकारनिर्देश पूर्णाङ्क (*fptr5)(fptr1);
पूर्णाङ्क f5 (पूर्णाङ्क (पूर्णाङ्क()), fptr1);
पूर्णाङ्क f1 (fptr1 fp, पूर्णाङ्क i)
{
  प्रत्यागम (*fp)(i);
}
पूर्णाङ्क f2 (fptr2 fp, पूर्णाङ्क i)
{
  प्रत्यागम (*fp)(i);
}
पूर्णाङ्क f3 (fptr3 fp, पूर्णाङ्क i)
{
  प्रत्यागम (*fp)(i);
}
पूर्णाङ्क f4 (fptr4 fp, पूर्णाङ्क i)
{
  प्रत्यागम (*fp[i])(i);
}
पूर्णाङ्क f5 (fptr5 fp, fptr1 i)
{
  प्रत्यागम fp(i);
}
प्रकारनिर्देश पूर्णाङ्क intx4[4];
पूर्णाङ्क f8 (intx4, पूर्णाङ्क);
पूर्णाङ्क f8 (पूर्णाङ्क ([4]), पूर्णाङ्क);
पूर्णाङ्क f8 (पूर्णाङ्क y[4], पूर्णाङ्क i)
{
  प्रत्यागम y[i];
}
पूर्णाङ्क f9 (पूर्णाङ्क (*)(पूर्णाङ्क), पूर्णाङ्क);
पूर्णाङ्क f9 (पूर्णाङ्क ((पूर्णाङ्क)), पूर्णाङ्क);
पूर्णाङ्क f9 (पूर्णाङ्क f(पूर्णाङ्क), पूर्णाङ्क i)
{
  प्रत्यागम f(i);
}
पूर्णाङ्क main () { प्रत्यागम 0; }
