/* The following are all valid decls, even though some subtypes
   are incomplete.  */
ga_nanaa E *e;
const ga_nanaa E *e1;
ga_nanaa E const *e2;
sa_nracanaa S *s;
const sa_nracanaa S *s1;
sa_nracanaa S const *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
typedef පූර්ණ_සංඛ්‍යා (*fptr1)();
පූර්ණ_සංඛ්‍යා f1 (පූර්ණ_සංඛ්‍යා (), පූර්ණ_සංඛ්‍යා);
typedef පූර්ණ_සංඛ්‍යා (*fptr2)(පූර්ණ_සංඛ්‍යා x);
පූර්ණ_සංඛ්‍යා f2 (පූර්ණ_සංඛ්‍යා (පූර්ණ_සංඛ්‍යා x), පූර්ණ_සංඛ්‍යා);
typedef පූර්ණ_සංඛ්‍යා (*fptr3)(පූර්ණ_සංඛ්‍යා);
පූර්ණ_සංඛ්‍යා f3 (පූර්ණ_සංඛ්‍යා (පූර්ණ_සංඛ්‍යා), පූර්ණ_සංඛ්‍යා);
typedef පූර්ණ_සංඛ්‍යා (*fptr4[4])(පූර්ණ_සංඛ්‍යා);
පූර්ණ_සංඛ්‍යා f4 (පූර්ණ_සංඛ්‍යා (*[4])(පූර්ණ_සංඛ්‍යා), පූර්ණ_සංඛ්‍යා);
typedef පූර්ණ_සංඛ්‍යා (*fptr5)(fptr1);
පූර්ණ_සංඛ්‍යා f5 (පූර්ණ_සංඛ්‍යා (පූර්ණ_සංඛ්‍යා()), fptr1);
පූර්ණ_සංඛ්‍යා f1 (fptr1 fp, පූර්ණ_සංඛ්‍යා i)
{
  ආපසු (*fp)(i);
}
පූර්ණ_සංඛ්‍යා f2 (fptr2 fp, පූර්ණ_සංඛ්‍යා i)
{
  ආපසු (*fp)(i);
}
පූර්ණ_සංඛ්‍යා f3 (fptr3 fp, පූර්ණ_සංඛ්‍යා i)
{
  ආපසු (*fp)(i);
}
පූර්ණ_සංඛ්‍යා f4 (fptr4 fp, පූර්ණ_සංඛ්‍යා i)
{
  ආපසු (*fp[i])(i);
}
පූර්ණ_සංඛ්‍යා f5 (fptr5 fp, fptr1 i)
{
  ආපසු fp(i);
}
typedef පූර්ණ_සංඛ්‍යා intx4[4];
පූර්ණ_සංඛ්‍යා f8 (intx4, පූර්ණ_සංඛ්‍යා);
පූර්ණ_සංඛ්‍යා f8 (පූර්ණ_සංඛ්‍යා ([4]), පූර්ණ_සංඛ්‍යා);
පූර්ණ_සංඛ්‍යා f8 (පූර්ණ_සංඛ්‍යා y[4], පූර්ණ_සංඛ්‍යා i)
{
  ආපසු y[i];
}
පූර්ණ_සංඛ්‍යා f9 (පූර්ණ_සංඛ්‍යා (*)(පූර්ණ_සංඛ්‍යා), පූර්ණ_සංඛ්‍යා);
පූර්ණ_සංඛ්‍යා f9 (පූර්ණ_සංඛ්‍යා ((පූර්ණ_සංඛ්‍යා)), පූර්ණ_සංඛ්‍යා);
පූර්ණ_සංඛ්‍යා f9 (පූර්ණ_සංඛ්‍යා f(පූර්ණ_සංඛ්‍යා), පූර්ණ_සංඛ්‍යා i)
{
  ආපසු f(i);
}
පූර්ණ_සංඛ්‍යා main () { ආපසු 0; }
