/* The following are all valid decls, even though some subtypes
   are incomplete.  */
எண்ணிக்கை E *e;
மாறிலி எண்ணிக்கை E *e1;
எண்ணிக்கை E மாறிலி *e2;
கட்டமைப்பு S *s;
மாறிலி கட்டமைப்பு S *s1;
கட்டமைப்பு S மாறிலி *s2;

/* Various strangely looking declarators, which are all valid
   and have to map to the same numbered typedefs. */
வகைவரை முழு (*fptr1)();
முழு f1 (முழு (), முழு);
வகைவரை முழு (*fptr2)(முழு x);
முழு f2 (முழு (முழு x), முழு);
வகைவரை முழு (*fptr3)(முழு);
முழு f3 (முழு (முழு), முழு);
வகைவரை முழு (*fptr4[4])(முழு);
முழு f4 (முழு (*[4])(முழு), முழு);
வகைவரை முழு (*fptr5)(fptr1);
முழு f5 (முழு (முழு()), fptr1);
முழு f1 (fptr1 fp, முழு i)
{
  திரும்பு (*fp)(i);
}
முழு f2 (fptr2 fp, முழு i)
{
  திரும்பு (*fp)(i);
}
முழு f3 (fptr3 fp, முழு i)
{
  திரும்பு (*fp)(i);
}
முழு f4 (fptr4 fp, முழு i)
{
  திரும்பு (*fp[i])(i);
}
முழு f5 (fptr5 fp, fptr1 i)
{
  திரும்பு fp(i);
}
வகைவரை முழு intx4[4];
முழு f8 (intx4, முழு);
முழு f8 (முழு ([4]), முழு);
முழு f8 (முழு y[4], முழு i)
{
  திரும்பு y[i];
}
முழு f9 (முழு (*)(முழு), முழு);
முழு f9 (முழு ((முழு)), முழு);
முழு f9 (முழு f(முழு), முழு i)
{
  திரும்பு f(i);
}
முழு முதன்மை () { திரும்பு 0; }
