#അന്തര്ഭാവ <stdio.h>

പൂർണ്ണസംഖ്യ
പ്രധാന()
{
#എങ്കിൽ defined(__LLP64__)
	എങ്കിൽ (വലുപ്പം(short) == 2
	    && വലുപ്പം(പൂർണ്ണസംഖ്യ) == 4
	    && വലുപ്പം(long പൂർണ്ണസംഖ്യ) == 4
	    && വലുപ്പം(long long പൂർണ്ണസംഖ്യ) == 8
	    && വലുപ്പം(ശൂന്യം*) == 8) {
		(ശൂന്യം)printf("Ok\n");
	} അല്ലെങ്കിൽ {
		(ശൂന്യം)printf("KO __LLP64__\n");
	}
#അല്ലെങ്കിലെങ്കിൽ defined(__LP64__)
	എങ്കിൽ (വലുപ്പം(short) == 2
	    && വലുപ്പം(പൂർണ്ണസംഖ്യ) == 4
	    && വലുപ്പം(long പൂർണ്ണസംഖ്യ) == 8
	    && വലുപ്പം(long long പൂർണ്ണസംഖ്യ) == 8
	    && വലുപ്പം(ശൂന്യം*) == 8) {
		(ശൂന്യം)printf("Ok\n");
	} അല്ലെങ്കിൽ {
		(ശൂന്യം)printf("KO __LP64__\n");
	}
#അല്ലെങ്കിലെങ്കിൽ defined(__ILP32__)
	എങ്കിൽ (വലുപ്പം(short) == 2
	    && വലുപ്പം(പൂർണ്ണസംഖ്യ) == 4
	    && വലുപ്പം(long പൂർണ്ണസംഖ്യ) == 4
	    && വലുപ്പം(ശൂന്യം*) == 4) {
		(ശൂന്യം)printf("Ok\n");
	} അല്ലെങ്കിൽ {
		(ശൂന്യം)printf("KO __ILP32__\n");
	}
#അല്ലെങ്കിൽ
	(ശൂന്യം)printf("KO no __*LP*__ defined.\n");
#endif
}
