#ضمن <stdio.h>

صحيح
اصلی()
{
#إذا defined(__LLP64__)
	إذا (حجم(کوتاه) == 2
	    && حجم(صحيح) == 4
	    && حجم(دراز صحيح) == 4
	    && حجم(دراز دراز صحيح) == 8
	    && حجم(فراغ*) == 8) {
		(فراغ)چاپ_کن("Ok\n");
	} وإلا {
		(فراغ)چاپ_کن("KO __LLP64__\n");
	}
#وإلاإذا defined(__LP64__)
	إذا (حجم(کوتاه) == 2
	    && حجم(صحيح) == 4
	    && حجم(دراز صحيح) == 8
	    && حجم(دراز دراز صحيح) == 8
	    && حجم(فراغ*) == 8) {
		(فراغ)چاپ_کن("Ok\n");
	} وإلا {
		(فراغ)چاپ_کن("KO __LP64__\n");
	}
#وإلاإذا defined(__ILP32__)
	إذا (حجم(کوتاه) == 2
	    && حجم(صحيح) == 4
	    && حجم(دراز صحيح) == 4
	    && حجم(فراغ*) == 4) {
		(فراغ)چاپ_کن("Ok\n");
	} وإلا {
		(فراغ)چاپ_کن("KO __ILP32__\n");
	}
#وإلا
	(فراغ)چاپ_کن("KO no __*LP*__ defined.\n");
#پایان_اگر
}
