#अन्तर्भाव <stdio.h>

पूर्णाङ्क
main()
{
#यदि defined(__LLP64__)
	यदि (परिमाण(short) == 2
	    && परिमाण(पूर्णाङ्क) == 4
	    && परिमाण(long पूर्णाङ्क) == 4
	    && परिमाण(long long पूर्णाङ्क) == 8
	    && परिमाण(शून्य*) == 8) {
		(शून्य)printf("Ok\n");
	} अन्यथा {
		(शून्य)printf("KO __LLP64__\n");
	}
#नोचेद्यदि defined(__LP64__)
	यदि (परिमाण(short) == 2
	    && परिमाण(पूर्णाङ्क) == 4
	    && परिमाण(long पूर्णाङ्क) == 8
	    && परिमाण(long long पूर्णाङ्क) == 8
	    && परिमाण(शून्य*) == 8) {
		(शून्य)printf("Ok\n");
	} अन्यथा {
		(शून्य)printf("KO __LP64__\n");
	}
#नोचेद्यदि defined(__ILP32__)
	यदि (परिमाण(short) == 2
	    && परिमाण(पूर्णाङ्क) == 4
	    && परिमाण(long पूर्णाङ्क) == 4
	    && परिमाण(शून्य*) == 4) {
		(शून्य)printf("Ok\n");
	} अन्यथा {
		(शून्य)printf("KO __ILP32__\n");
	}
#अन्यथा
	(शून्य)printf("KO no __*LP*__ defined.\n");
#endif
}
