#ضمن <stdio.h>

صحيح
مکھ()
{
#إذا defined(__LLP64__)
	إذا (حجم(چھوٹا) == 2
	    && حجم(صحيح) == 4
	    && حجم(لما صحيح) == 4
	    && حجم(لما لما صحيح) == 8
	    && حجم(فراغ*) == 8) {
		(فراغ)لکھو("Ok\n");
	} وإلا {
		(فراغ)لکھو("KO __LLP64__\n");
	}
#وإلاإذا defined(__LP64__)
	إذا (حجم(چھوٹا) == 2
	    && حجم(صحيح) == 4
	    && حجم(لما صحيح) == 8
	    && حجم(لما لما صحيح) == 8
	    && حجم(فراغ*) == 8) {
		(فراغ)لکھو("Ok\n");
	} وإلا {
		(فراغ)لکھو("KO __LP64__\n");
	}
#وإلاإذا defined(__ILP32__)
	إذا (حجم(چھوٹا) == 2
	    && حجم(صحيح) == 4
	    && حجم(لما صحيح) == 4
	    && حجم(فراغ*) == 4) {
		(فراغ)لکھو("Ok\n");
	} وإلا {
		(فراغ)لکھو("KO __ILP32__\n");
	}
#وإلا
	(فراغ)لکھو("KO no __*LP*__ defined.\n");
#جے_انت
}
