#شامل <stdio.h>

صحیح
مین()
{
#اگر defined(__LLP64__)
	اگر (حجم(مختصر) == 2
	    && حجم(صحیح) == 4
	    && حجم(طویل صحیح) == 4
	    && حجم(طویل طویل صحیح) == 8
	    && حجم(خالی*) == 8) {
		(خالی)لکھو("Ok\n");
	} ورنہ {
		(خالی)لکھو("KO __LLP64__\n");
	}
#وگرنہ_اگر defined(__LP64__)
	اگر (حجم(مختصر) == 2
	    && حجم(صحیح) == 4
	    && حجم(طویل صحیح) == 8
	    && حجم(طویل طویل صحیح) == 8
	    && حجم(خالی*) == 8) {
		(خالی)لکھو("Ok\n");
	} ورنہ {
		(خالی)لکھو("KO __LP64__\n");
	}
#وگرنہ_اگر defined(__ILP32__)
	اگر (حجم(مختصر) == 2
	    && حجم(صحیح) == 4
	    && حجم(طویل صحیح) == 4
	    && حجم(خالی*) == 4) {
		(خالی)لکھو("Ok\n");
	} ورنہ {
		(خالی)لکھو("KO __ILP32__\n");
	}
#ورنہ
	(خالی)لکھو("KO no __*LP*__ defined.\n");
#اگر_ختم
}
