#अन्तर्भाव <stdio.h>

पूर्णाङ्क
main()
{
#यदि defined(__LLP64__)
	यदि (परिमाण(लघु) == 2
	    && परिमाण(पूर्णाङ्क) == 4
	    && परिमाण(दीर्घ पूर्णाङ्क) == 4
	    && परिमाण(दीर्घ दीर्घ पूर्णाङ्क) == 8
	    && परिमाण(शून्य*) == 8) {
		(शून्य)म_लिखो("Ok\n");
	} अन्यथा {
		(शून्य)म_लिखो("KO __LLP64__\n");
	}
#अथवायदि defined(__LP64__)
	यदि (परिमाण(लघु) == 2
	    && परिमाण(पूर्णाङ्क) == 4
	    && परिमाण(दीर्घ पूर्णाङ्क) == 8
	    && परिमाण(दीर्घ दीर्घ पूर्णाङ्क) == 8
	    && परिमाण(शून्य*) == 8) {
		(शून्य)म_लिखो("Ok\n");
	} अन्यथा {
		(शून्य)म_लिखो("KO __LP64__\n");
	}
#अथवायदि defined(__ILP32__)
	यदि (परिमाण(लघु) == 2
	    && परिमाण(पूर्णाङ्क) == 4
	    && परिमाण(दीर्घ पूर्णाङ्क) == 4
	    && परिमाण(शून्य*) == 4) {
		(शून्य)म_लिखो("Ok\n");
	} अन्यथा {
		(शून्य)म_लिखो("KO __ILP32__\n");
	}
#अन्यथा
	(शून्य)म_लिखो("KO no __*LP*__ defined.\n");
#endif
}
