#ضمن <stdio.h>

صحيح
مکيه()
{
#إذا defined(__LLP64__)
	إذا (حجم(ننڍو) == 2
	    && حجم(صحيح) == 4
	    && حجم(ڊگهو صحيح) == 4
	    && حجم(ڊگهو ڊگهو صحيح) == 8
	    && حجم(فراغ*) == 8) {
		(فراغ)لکو("Ok\n");
	} وإلا {
		(فراغ)لکو("KO __LLP64__\n");
	}
#وإلاإذا defined(__LP64__)
	إذا (حجم(ننڍو) == 2
	    && حجم(صحيح) == 4
	    && حجم(ڊگهو صحيح) == 8
	    && حجم(ڊگهو ڊگهو صحيح) == 8
	    && حجم(فراغ*) == 8) {
		(فراغ)لکو("Ok\n");
	} وإلا {
		(فراغ)لکو("KO __LP64__\n");
	}
#وإلاإذا defined(__ILP32__)
	إذا (حجم(ننڍو) == 2
	    && حجم(صحيح) == 4
	    && حجم(ڊگهو صحيح) == 4
	    && حجم(فراغ*) == 4) {
		(فراغ)لکو("Ok\n");
	} وإلا {
		(فراغ)لکو("KO __ILP32__\n");
	}
#وإلا
	(فراغ)لکو("KO no __*LP*__ defined.\n");
#جيڪڏهن_پورو
}
