#ಅನ್ತರ್ಭಾವ <stdio.h>

ಪೂರ್ಣಾಙ್ಕ
main()
{
#ಯದಿ defined(__LLP64__)
	ಯದಿ (ಪರಿಮಾಣ(short) == 2
	    && ಪರಿಮಾಣ(ಪೂರ್ಣಾಙ್ಕ) == 4
	    && ಪರಿಮಾಣ(long ಪೂರ್ಣಾಙ್ಕ) == 4
	    && ಪರಿಮಾಣ(long long ಪೂರ್ಣಾಙ್ಕ) == 8
	    && ಪರಿಮಾಣ(ಶೂನ್ಯ*) == 8) {
		(ಶೂನ್ಯ)printf("Ok\n");
	} ಅನ್ಯಥಾ {
		(ಶೂನ್ಯ)printf("KO __LLP64__\n");
	}
#ನೋಚೇದ್ಯದಿ defined(__LP64__)
	ಯದಿ (ಪರಿಮಾಣ(short) == 2
	    && ಪರಿಮಾಣ(ಪೂರ್ಣಾಙ್ಕ) == 4
	    && ಪರಿಮಾಣ(long ಪೂರ್ಣಾಙ್ಕ) == 8
	    && ಪರಿಮಾಣ(long long ಪೂರ್ಣಾಙ್ಕ) == 8
	    && ಪರಿಮಾಣ(ಶೂನ್ಯ*) == 8) {
		(ಶೂನ್ಯ)printf("Ok\n");
	} ಅನ್ಯಥಾ {
		(ಶೂನ್ಯ)printf("KO __LP64__\n");
	}
#ನೋಚೇದ್ಯದಿ defined(__ILP32__)
	ಯದಿ (ಪರಿಮಾಣ(short) == 2
	    && ಪರಿಮಾಣ(ಪೂರ್ಣಾಙ್ಕ) == 4
	    && ಪರಿಮಾಣ(long ಪೂರ್ಣಾಙ್ಕ) == 4
	    && ಪರಿಮಾಣ(ಶೂನ್ಯ*) == 4) {
		(ಶೂನ್ಯ)printf("Ok\n");
	} ಅನ್ಯಥಾ {
		(ಶೂನ್ಯ)printf("KO __ILP32__\n");
	}
#ಅನ್ಯಥಾ
	(ಶೂನ್ಯ)printf("KO no __*LP*__ defined.\n");
#endif
}
