#ଅନ୍ତର୍ଭାଵ <stdio.h>

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
ମୁଖ୍ୟ()
{
#ଯଦି defined(__LLP64__)
	ଯଦି (ଆକାର(short) == 2
	    && ଆକାର(ପୂର୍ଣ୍ଣସଂଖ୍ୟା) == 4
	    && ଆକାର(long ପୂର୍ଣ୍ଣସଂଖ୍ୟା) == 4
	    && ଆକାର(long long ପୂର୍ଣ୍ଣସଂଖ୍ୟା) == 8
	    && ଆକାର(ଶୂନ୍ୟ*) == 8) {
		(ଶୂନ୍ୟ)printf("Ok\n");
	} ଅନ୍ୟଥା {
		(ଶୂନ୍ୟ)printf("KO __LLP64__\n");
	}
#ନଚେତଯଦି defined(__LP64__)
	ଯଦି (ଆକାର(short) == 2
	    && ଆକାର(ପୂର୍ଣ୍ଣସଂଖ୍ୟା) == 4
	    && ଆକାର(long ପୂର୍ଣ୍ଣସଂଖ୍ୟା) == 8
	    && ଆକାର(long long ପୂର୍ଣ୍ଣସଂଖ୍ୟା) == 8
	    && ଆକାର(ଶୂନ୍ୟ*) == 8) {
		(ଶୂନ୍ୟ)printf("Ok\n");
	} ଅନ୍ୟଥା {
		(ଶୂନ୍ୟ)printf("KO __LP64__\n");
	}
#ନଚେତଯଦି defined(__ILP32__)
	ଯଦି (ଆକାର(short) == 2
	    && ଆକାର(ପୂର୍ଣ୍ଣସଂଖ୍ୟା) == 4
	    && ଆକାର(long ପୂର୍ଣ୍ଣସଂଖ୍ୟା) == 4
	    && ଆକାର(ଶୂନ୍ୟ*) == 4) {
		(ଶୂନ୍ୟ)printf("Ok\n");
	} ଅନ୍ୟଥା {
		(ଶୂନ୍ୟ)printf("KO __ILP32__\n");
	}
#ଅନ୍ୟଥା
	(ଶୂନ୍ୟ)printf("KO no __*LP*__ defined.\n");
#endif
}
