#અન્તર્ભાવ <stdio.h>

પૂર્ણાંક
મુખ્ય()
{
#જો defined(__LLP64__)
	જો (કદ(short) == 2
	    && કદ(પૂર્ણાંક) == 4
	    && કદ(long પૂર્ણાંક) == 4
	    && કદ(long long પૂર્ણાંક) == 8
	    && કદ(શૂન્ય*) == 8) {
		(શૂન્ય)printf("Ok\n");
	} નહીંતર {
		(શૂન્ય)printf("KO __LLP64__\n");
	}
#અથવાજો defined(__LP64__)
	જો (કદ(short) == 2
	    && કદ(પૂર્ણાંક) == 4
	    && કદ(long પૂર્ણાંક) == 8
	    && કદ(long long પૂર્ણાંક) == 8
	    && કદ(શૂન્ય*) == 8) {
		(શૂન્ય)printf("Ok\n");
	} નહીંતર {
		(શૂન્ય)printf("KO __LP64__\n");
	}
#અથવાજો defined(__ILP32__)
	જો (કદ(short) == 2
	    && કદ(પૂર્ણાંક) == 4
	    && કદ(long પૂર્ણાંક) == 4
	    && કદ(શૂન્ય*) == 4) {
		(શૂન્ય)printf("Ok\n");
	} નહીંતર {
		(શૂન્ય)printf("KO __ILP32__\n");
	}
#નહીંતર
	(શૂન્ય)printf("KO no __*LP*__ defined.\n");
#endif
}
