#समावेश <stdio.h>

पूर्णांक
मुख्य()
{
#अगर defined(__LLP64__)
	अगर (माप(लघु) == 2
	    && माप(पूर्णांक) == 4
	    && माप(दीर्घ पूर्णांक) == 4
	    && माप(दीर्घ दीर्घ पूर्णांक) == 8
	    && माप(व्योम*) == 8) {
		(व्योम)म_लिखो("Ok\n");
	} अन्यथा {
		(व्योम)म_लिखो("KO __LLP64__\n");
	}
#या_अगर defined(__LP64__)
	अगर (माप(लघु) == 2
	    && माप(पूर्णांक) == 4
	    && माप(दीर्घ पूर्णांक) == 8
	    && माप(दीर्घ दीर्घ पूर्णांक) == 8
	    && माप(व्योम*) == 8) {
		(व्योम)म_लिखो("Ok\n");
	} अन्यथा {
		(व्योम)म_लिखो("KO __LP64__\n");
	}
#या_अगर defined(__ILP32__)
	अगर (माप(लघु) == 2
	    && माप(पूर्णांक) == 4
	    && माप(दीर्घ पूर्णांक) == 4
	    && माप(व्योम*) == 4) {
		(व्योम)म_लिखो("Ok\n");
	} अन्यथा {
		(व्योम)म_लिखो("KO __ILP32__\n");
	}
#अन्यथा
	(व्योम)म_लिखो("KO no __*LP*__ defined.\n");
#पूर्ण_अगर
}
