#अन्तर्भाव <stdio.h>

पूर्णांक
main()
{
#जर defined(__LLP64__)
	जर (आकार(लघु) == 2
	    && आकार(पूर्णांक) == 4
	    && आकार(दीर्घ पूर्णांक) == 4
	    && आकार(दीर्घ दीर्घ पूर्णांक) == 8
	    && आकार(शून्य*) == 8) {
		(शून्य)म_लिखो("Ok\n");
	} अन्यथा {
		(शून्य)म_लिखो("KO __LLP64__\n");
	}
#किंवाजर defined(__LP64__)
	जर (आकार(लघु) == 2
	    && आकार(पूर्णांक) == 4
	    && आकार(दीर्घ पूर्णांक) == 8
	    && आकार(दीर्घ दीर्घ पूर्णांक) == 8
	    && आकार(शून्य*) == 8) {
		(शून्य)म_लिखो("Ok\n");
	} अन्यथा {
		(शून्य)म_लिखो("KO __LP64__\n");
	}
#किंवाजर defined(__ILP32__)
	जर (आकार(लघु) == 2
	    && आकार(पूर्णांक) == 4
	    && आकार(दीर्घ पूर्णांक) == 4
	    && आकार(शून्य*) == 4) {
		(शून्य)म_लिखो("Ok\n");
	} अन्यथा {
		(शून्य)म_लिखो("KO __ILP32__\n");
	}
#अन्यथा
	(शून्य)म_लिखो("KO no __*LP*__ defined.\n");
#endif
}
