#ضمن <stdio.h>

صحيح
اصلي()
{
#إذا defined(__LLP64__)
	إذا (حجم(لنډ) == 2
	    && حجم(صحيح) == 4
	    && حجم(اوږد صحيح) == 4
	    && حجم(اوږد اوږد صحيح) == 8
	    && حجم(فراغ*) == 8) {
		(فراغ)چاپ_کړه("Ok\n");
	} وإلا {
		(فراغ)چاپ_کړه("KO __LLP64__\n");
	}
#وإلاإذا defined(__LP64__)
	إذا (حجم(لنډ) == 2
	    && حجم(صحيح) == 4
	    && حجم(اوږد صحيح) == 8
	    && حجم(اوږد اوږد صحيح) == 8
	    && حجم(فراغ*) == 8) {
		(فراغ)چاپ_کړه("Ok\n");
	} وإلا {
		(فراغ)چاپ_کړه("KO __LP64__\n");
	}
#وإلاإذا defined(__ILP32__)
	إذا (حجم(لنډ) == 2
	    && حجم(صحيح) == 4
	    && حجم(اوږد صحيح) == 4
	    && حجم(فراغ*) == 4) {
		(فراغ)چاپ_کړه("Ok\n");
	} وإلا {
		(فراغ)چاپ_کړه("KO __ILP32__\n");
	}
#وإلا
	(فراغ)چاپ_کړه("KO no __*LP*__ defined.\n");
#د_که_پای
}
