#ಅನ್ತರ್ಭಾವ <stdio.h>

ಪೂರ್ಣಾಂಕ
ಮುಖ್ಯ()
{
#ಆದರೆ defined(__LLP64__)
	ಆದರೆ (ಗಾತ್ರ(ಗಿಡ್ಡ) == 2
	    && ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ) == 4
	    && ಗಾತ್ರ(ದೀರ್ಘ ಪೂರ್ಣಾಂಕ) == 4
	    && ಗಾತ್ರ(ದೀರ್ಘ ದೀರ್ಘ ಪೂರ್ಣಾಂಕ) == 8
	    && ಗಾತ್ರ(ಶೂನ್ಯ*) == 8) {
		(ಶೂನ್ಯ)ಬರೆ("Ok\n");
	} ಇಲ್ಲದಿದ್ದರೆ {
		(ಶೂನ್ಯ)ಬರೆ("KO __LLP64__\n");
	}
#ಅಥವಾಆದರೆ defined(__LP64__)
	ಆದರೆ (ಗಾತ್ರ(ಗಿಡ್ಡ) == 2
	    && ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ) == 4
	    && ಗಾತ್ರ(ದೀರ್ಘ ಪೂರ್ಣಾಂಕ) == 8
	    && ಗಾತ್ರ(ದೀರ್ಘ ದೀರ್ಘ ಪೂರ್ಣಾಂಕ) == 8
	    && ಗಾತ್ರ(ಶೂನ್ಯ*) == 8) {
		(ಶೂನ್ಯ)ಬರೆ("Ok\n");
	} ಇಲ್ಲದಿದ್ದರೆ {
		(ಶೂನ್ಯ)ಬರೆ("KO __LP64__\n");
	}
#ಅಥವಾಆದರೆ defined(__ILP32__)
	ಆದರೆ (ಗಾತ್ರ(ಗಿಡ್ಡ) == 2
	    && ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ) == 4
	    && ಗಾತ್ರ(ದೀರ್ಘ ಪೂರ್ಣಾಂಕ) == 4
	    && ಗಾತ್ರ(ಶೂನ್ಯ*) == 4) {
		(ಶೂನ್ಯ)ಬರೆ("Ok\n");
	} ಇಲ್ಲದಿದ್ದರೆ {
		(ಶೂನ್ಯ)ಬರೆ("KO __ILP32__\n");
	}
#ಇಲ್ಲದಿದ್ದರೆ
	(ಶೂನ್ಯ)ಬರೆ("KO no __*LP*__ defined.\n");
#ಆದರೆ_ಅಂತ್ಯ
}
