#অন্তর্ভাব <stdio.h>

পূর্ণসংখ্যা
প্রধান()
{
#যদি defined(__LLP64__)
	যদি (আকার(short) == 2
	    && আকার(পূর্ণসংখ্যা) == 4
	    && আকার(long পূর্ণসংখ্যা) == 4
	    && আকার(long long পূর্ণসংখ্যা) == 8
	    && আকার(শূন্য*) == 8) {
		(শূন্য)printf("Ok\n");
	} অন্যথা {
		(শূন্য)printf("KO __LLP64__\n");
	}
#নতুবা_যদি defined(__LP64__)
	যদি (আকার(short) == 2
	    && আকার(পূর্ণসংখ্যা) == 4
	    && আকার(long পূর্ণসংখ্যা) == 8
	    && আকার(long long পূর্ণসংখ্যা) == 8
	    && আকার(শূন্য*) == 8) {
		(শূন্য)printf("Ok\n");
	} অন্যথা {
		(শূন্য)printf("KO __LP64__\n");
	}
#নতুবা_যদি defined(__ILP32__)
	যদি (আকার(short) == 2
	    && আকার(পূর্ণসংখ্যা) == 4
	    && আকার(long পূর্ণসংখ্যা) == 4
	    && আকার(শূন্য*) == 4) {
		(শূন্য)printf("Ok\n");
	} অন্যথা {
		(শূন্য)printf("KO __ILP32__\n");
	}
#অন্যথা
	(শূন্য)printf("KO no __*LP*__ defined.\n");
#endif
}
