#شامل <stdio.h>

صحیح
اصلی()
{
#اگر defined(__LLP64__)
	اگر (اندازه(short) == 2
	    && اندازه(صحیح) == 4
	    && اندازه(long صحیح) == 4
	    && اندازه(long long صحیح) == 8
	    && اندازه(تهی*) == 8) {
		(تهی)printf("Ok\n");
	} وگرنه {
		(تهی)printf("KO __LLP64__\n");
	}
#وگرنهاگر defined(__LP64__)
	اگر (اندازه(short) == 2
	    && اندازه(صحیح) == 4
	    && اندازه(long صحیح) == 8
	    && اندازه(long long صحیح) == 8
	    && اندازه(تهی*) == 8) {
		(تهی)printf("Ok\n");
	} وگرنه {
		(تهی)printf("KO __LP64__\n");
	}
#وگرنهاگر defined(__ILP32__)
	اگر (اندازه(short) == 2
	    && اندازه(صحیح) == 4
	    && اندازه(long صحیح) == 4
	    && اندازه(تهی*) == 4) {
		(تهی)printf("Ok\n");
	} وگرنه {
		(تهی)printf("KO __ILP32__\n");
	}
#وگرنه
	(تهی)printf("KO no __*LP*__ defined.\n");
#endif
}
