#অন্তর্ভাব <stdio.h>

পূর্ণাঙ্ক
main()
{
#যদি defined(__LLP64__)
	যদি (পরিমাণ(short) == 2
	    && পরিমাণ(পূর্ণাঙ্ক) == 4
	    && পরিমাণ(long পূর্ণাঙ্ক) == 4
	    && পরিমাণ(long long পূর্ণাঙ্ক) == 8
	    && পরিমাণ(শূন্য*) == 8) {
		(শূন্য)printf("Ok\n");
	} অন্যথা {
		(শূন্য)printf("KO __LLP64__\n");
	}
#নোচেদ্যদি defined(__LP64__)
	যদি (পরিমাণ(short) == 2
	    && পরিমাণ(পূর্ণাঙ্ক) == 4
	    && পরিমাণ(long পূর্ণাঙ্ক) == 8
	    && পরিমাণ(long long পূর্ণাঙ্ক) == 8
	    && পরিমাণ(শূন্য*) == 8) {
		(শূন্য)printf("Ok\n");
	} অন্যথা {
		(শূন্য)printf("KO __LP64__\n");
	}
#নোচেদ্যদি defined(__ILP32__)
	যদি (পরিমাণ(short) == 2
	    && পরিমাণ(পূর্ণাঙ্ক) == 4
	    && পরিমাণ(long পূর্ণাঙ্ক) == 4
	    && পরিমাণ(শূন্য*) == 4) {
		(শূন্য)printf("Ok\n");
	} অন্যথা {
		(শূন্য)printf("KO __ILP32__\n");
	}
#অন্যথা
	(শূন্য)printf("KO no __*LP*__ defined.\n");
#endif
}
