#అన్తర్భావ <stdio.h>

పూర్ణాంకం
ప్రధాన()
{
#ఒకవేళ defined(__LLP64__)
	ఒకవేళ (పరిమాణం(పొట్టి) == 2
	    && పరిమాణం(పూర్ణాంకం) == 4
	    && పరిమాణం(దీర్ఘ పూర్ణాంకం) == 4
	    && పరిమాణం(దీర్ఘ దీర్ఘ పూర్ణాంకం) == 8
	    && పరిమాణం(శూన్య*) == 8) {
		(శూన్య)రాయి("Ok\n");
	} లేకపోతే {
		(శూన్య)రాయి("KO __LLP64__\n");
	}
#లేదావేళ defined(__LP64__)
	ఒకవేళ (పరిమాణం(పొట్టి) == 2
	    && పరిమాణం(పూర్ణాంకం) == 4
	    && పరిమాణం(దీర్ఘ పూర్ణాంకం) == 8
	    && పరిమాణం(దీర్ఘ దీర్ఘ పూర్ణాంకం) == 8
	    && పరిమాణం(శూన్య*) == 8) {
		(శూన్య)రాయి("Ok\n");
	} లేకపోతే {
		(శూన్య)రాయి("KO __LP64__\n");
	}
#లేదావేళ defined(__ILP32__)
	ఒకవేళ (పరిమాణం(పొట్టి) == 2
	    && పరిమాణం(పూర్ణాంకం) == 4
	    && పరిమాణం(దీర్ఘ పూర్ణాంకం) == 4
	    && పరిమాణం(శూన్య*) == 4) {
		(శూన్య)రాయి("Ok\n");
	} లేకపోతే {
		(శూన్య)రాయి("KO __ILP32__\n");
	}
#లేకపోతే
	(శూన్య)రాయి("KO no __*LP*__ defined.\n");
#అయితే_ముగింపు
}
