#அந்தர்பாவ <stdio.h>

முழு
முதன்மை()
{
#எனில் defined(__LLP64__)
	எனில் (அளவு(short) == 2
	    && அளவு(முழு) == 4
	    && அளவு(long முழு) == 4
	    && அளவு(long long முழு) == 8
	    && அளவு(வெறுமை*) == 8) {
		(வெறுமை)printf("Ok\n");
	} இல்லையெனில் {
		(வெறுமை)printf("KO __LLP64__\n");
	}
#அல்லதெனில் defined(__LP64__)
	எனில் (அளவு(short) == 2
	    && அளவு(முழு) == 4
	    && அளவு(long முழு) == 8
	    && அளவு(long long முழு) == 8
	    && அளவு(வெறுமை*) == 8) {
		(வெறுமை)printf("Ok\n");
	} இல்லையெனில் {
		(வெறுமை)printf("KO __LP64__\n");
	}
#அல்லதெனில் defined(__ILP32__)
	எனில் (அளவு(short) == 2
	    && அளவு(முழு) == 4
	    && அளவு(long முழு) == 4
	    && அளவு(வெறுமை*) == 4) {
		(வெறுமை)printf("Ok\n");
	} இல்லையெனில் {
		(வெறுமை)printf("KO __ILP32__\n");
	}
#இல்லையெனில்
	(வெறுமை)printf("KO no __*LP*__ defined.\n");
#endif
}
