#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

ਪੂਰਨ
ਮੁੱਖ()
{
#ਜੇ defined(__LLP64__)
	ਜੇ (ਆਕਾਰ(ਛੋਟਾ) == 2
	    && ਆਕਾਰ(ਪੂਰਨ) == 4
	    && ਆਕਾਰ(ਲੰਮਾ ਪੂਰਨ) == 4
	    && ਆਕਾਰ(ਲੰਮਾ ਲੰਮਾ ਪੂਰਨ) == 8
	    && ਆਕਾਰ(ਖਾਲੀ*) == 8) {
		(ਖਾਲੀ)ਲਿਖੋ("Ok\n");
	} ਨਹੀਂਤਾਂ {
		(ਖਾਲੀ)ਲਿਖੋ("KO __LLP64__\n");
	}
#ਜਾਂਜੇ defined(__LP64__)
	ਜੇ (ਆਕਾਰ(ਛੋਟਾ) == 2
	    && ਆਕਾਰ(ਪੂਰਨ) == 4
	    && ਆਕਾਰ(ਲੰਮਾ ਪੂਰਨ) == 8
	    && ਆਕਾਰ(ਲੰਮਾ ਲੰਮਾ ਪੂਰਨ) == 8
	    && ਆਕਾਰ(ਖਾਲੀ*) == 8) {
		(ਖਾਲੀ)ਲਿਖੋ("Ok\n");
	} ਨਹੀਂਤਾਂ {
		(ਖਾਲੀ)ਲਿਖੋ("KO __LP64__\n");
	}
#ਜਾਂਜੇ defined(__ILP32__)
	ਜੇ (ਆਕਾਰ(ਛੋਟਾ) == 2
	    && ਆਕਾਰ(ਪੂਰਨ) == 4
	    && ਆਕਾਰ(ਲੰਮਾ ਪੂਰਨ) == 4
	    && ਆਕਾਰ(ਖਾਲੀ*) == 4) {
		(ਖਾਲੀ)ਲਿਖੋ("Ok\n");
	} ਨਹੀਂਤਾਂ {
		(ਖਾਲੀ)ਲਿਖੋ("KO __ILP32__\n");
	}
#ਨਹੀਂਤਾਂ
	(ਖਾਲੀ)ਲਿਖੋ("KO no __*LP*__ defined.\n");
#ਜੇ_ਅੰਤ
}
