#समावेश <stdio.h>

स्थिर पूर्णांक a = 0;

काष्ठा a {
	पूर्णांक a;
};

काष्ठा b {
	पूर्णांक a;
};

पूर्णांक a_f()
{
	वापस 20;
}

पूर्णांक b_f()
{
	वापस 10;
}

प्रकार पूर्णांक (*fptr)(पूर्णांक);
प्रकार व्योम (*vfptr)(पूर्णांक);
पूर्णांक foo(पूर्णांक i)
{
  वापस i;
}
व्योम void_foo(पूर्णांक i) {}

प्रकार पूर्णांक int_type1;

प्रकार पूर्णांक T[4];
पूर्णांक f(T t)
{
	वापस _Generic(t, __typeof__( ((व्योम)0, (T){0}) ) : 1 );
}

#घोषणा gen_sw(a) _Generic(a, स्थिर अक्षर *: 1, शेष: 8, पूर्णांक: 123);

पूर्णांक मुख्य()
{
	पूर्णांक i = 0;
	चिन्हित दीर्घ पूर्णांक l = 2;
	काष्ठा b titi;
	स्थिर पूर्णांक * स्थिर ptr;
	स्थिर अक्षर *ti;
	int_type1 i2;
	T t;

	i = _Generic(a, पूर्णांक: a_f, स्थिर पूर्णांक: b_f)();
	म_लिखो("%d\n", i);
	i = _Generic(a, पूर्णांक: a_f() / 2, स्थिर पूर्णांक: b_f() / 2);
	म_लिखो("%d\n", i);
	i = _Generic(ptr, पूर्णांक *:1, पूर्णांक * स्थिर:2, शेष:20);
	म_लिखो("%d\n", i);
	i = gen_sw(a);
	म_लिखो("%d\n", i);
	i = _Generic(titi, काष्ठा a:1, काष्ठा b:2, शेष:20);
	म_लिखो("%d\n", i);
	i = _Generic(i2, अक्षर: 1, पूर्णांक : 0);
	म_लिखो("%d\n", i);
	i = _Generic(a, अक्षर:1, पूर्णांक[4]:2, शेष:5);
	म_लिखो("%d\n", i);
	i = _Generic(17, पूर्णांक :1, पूर्णांक **:2);
	म_लिखो("%d\n", i);
	i = _Generic(17L, पूर्णांक :1, दीर्घ :2, दीर्घ दीर्घ : 3);
	म_लिखो("%d\n", i);
	i = _Generic("17, io", अक्षर *: 3, स्थिर अक्षर *: 1);
	म_लिखो("%d\n", i);
	i = _Generic(ti, स्थिर अचिन्हित अक्षर *:1, स्थिर अक्षर *:4, अक्षर *:3,
		     स्थिर चिन्हित अक्षर *:2);
	म_लिखो("%d\n", i);
	म_लिखो("%s\n", _Generic(i + 2L, दीर्घ: "long", पूर्णांक: "int",
				दीर्घ दीर्घ: "long long"));
	i = _Generic(l, दीर्घ: 1, पूर्णांक: 2);
	म_लिखो("%d\n", i);
	i = _Generic(foo, fptr: 3, पूर्णांक: 4, vfptr: 5);
	म_लिखो("%d\n", i);
	i = _Generic(void_foo, fptr: 3, पूर्णांक: 4, vfptr: 5);
	म_लिखो("%d\n", i);

	(व्योम)_Generic((पूर्णांक(*)[2]){0}, पूर्णांक(*)[2]:0, पूर्णांक(*)[4]:0); //shouldn't match twice

	//should accept ({ }) in the controlling expr of _Generic even in const_wanted contexts
	काष्ठा { _Bool x_0: _Generic(({0;}),शेष:1); } my_x;

	_Generic((__typeof((भग्न स्थिर)((भग्न स्थिर){42}))*){0}, भग्न*: 0); //casts lose top-level qualifiers
	पूर्णांक स्थिर x = 42; __typeof((__typeof(x))x) *xp = 0; (व्योम)_Generic(xp, पूर्णांक*: 0); //casts lose top-level qualifiers

	//TEST TERNARY:
	//Same type
	_Generic( 0?(दीर्घ*)0:(दीर्घ*)0,  दीर्घ*: (व्योम)0);
	//combining of qualifiers
	_Generic( 0?(दीर्घ अस्थिर*)0:(दीर्घ स्थिर*)0,  दीर्घ स्थिर अस्थिर*: (व्योम)0);
	//nul-ptr constant selects other type
	_Generic( 0?(दीर्घ*)0:0,			दीर्घ*: (व्योम)0);
	_Generic( 0?(दीर्घ*)0:(व्योम*)0, दीर्घ*: (व्योम)0);

	//void ptrs get chosen preferentially; qualifs still combine
	_Generic( 0?(पूर्णांक अस्थिर*)0: (व्योम स्थिर*)1, व्योम अस्थिर स्थिर*: (व्योम)0);
        //but this is no null-ptr constant, so fallback to void-choice
        i = 0;
        _Generic( 1?(व्योम*)(i*0LL):&i, व्योम*:0);
	//like gcc but not clang, don't treat (void* const as the null-ptr constant)
	_Generic( 0?(पूर्णांक अस्थिर*)0: (व्योम स्थिर*)0, व्योम अस्थिर स्थिर*: (व्योम)0);

	//ptrs to incomplete types get completed
	(व्योम)(माप(काष्ठा { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[4])0 : (पूर्णांक (*)[])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(व्योम)0); }));
	(व्योम)(माप(काष्ठा { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[])0 : (पूर्णांक (*)[4])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(व्योम)0); }));

	{
	  /* completion shouldn't affect the type of decl */
		अक्षर **argv;
		_Generic(argv, अक्षर**: (व्योम)0);
		_Generic(0?(अक्षर स्थिर*)0:argv[0], अक्षर स्थिर*: (व्योम)0);
		_Generic(argv, अक्षर**: (व्योम)0);
	}
	{
	  बाह्य पूर्णांक (*ar)[];
	  (व्योम)(माप(काष्ठा { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[4])0 : (पूर्णांक (*)[])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(व्योम)0); }));
	  (व्योम)(माप(काष्ठा { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[])0 : (पूर्णांक (*)[4])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(व्योम)0); }));
	  (व्योम)(माप(काष्ठा { पूर्णांक x:_Generic( 0?ar : (पूर्णांक (*)[4])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(व्योम)0); }));
	  (व्योम)(माप(काष्ठा { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[4])0 : ar, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(व्योम)0); }));
	  (व्योम)(माप(काष्ठा { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[5])0 : ar, पूर्णांक (*)[5]:+1, पूर्णांक (*)[4]:(व्योम)0); }));
	}

	म_लिखो ("%d\n", f(t));

	वापस 0;
}
