#అన్తర్భావ <stdio.h>

స్థిరరాశి పూర్ణాంకం a = 0;

నిర్మాణం a {
	పూర్ణాంకం a;
};

నిర్మాణం b {
	పూర్ణాంకం a;
};

పూర్ణాంకం a_f()
{
	తిరిగి 20;
}

పూర్ణాంకం b_f()
{
	తిరిగి 10;
}

రకనిర్వచనం పూర్ణాంకం (*fptr)(పూర్ణాంకం);
రకనిర్వచనం శూన్య (*vfptr)(పూర్ణాంకం);
పూర్ణాంకం foo(పూర్ణాంకం i)
{
  తిరిగి i;
}
శూన్య void_foo(పూర్ణాంకం i) {}

రకనిర్వచనం పూర్ణాంకం int_type1;

రకనిర్వచనం పూర్ణాంకం T[4];
పూర్ణాంకం f(T t)
{
	తిరిగి _Generic(t, __typeof__( ((శూన్య)0, (T){0}) ) : 1 );
}

#నిర్వచించు gen_sw(a) _Generic(a, స్థిరరాశి అక్షరం *: 1, అప్రమేయ: 8, పూర్ణాంకం: 123);

పూర్ణాంకం ప్రధాన()
{
	పూర్ణాంకం i = 0;
	గుర్తుగల దీర్ఘ పూర్ణాంకం l = 2;
	నిర్మాణం b titi;
	స్థిరరాశి పూర్ణాంకం * స్థిరరాశి ptr;
	స్థిరరాశి అక్షరం *ti;
	int_type1 i2;
	T t;

	i = _Generic(a, పూర్ణాంకం: a_f, స్థిరరాశి పూర్ణాంకం: b_f)();
	రాయి("%d\n", i);
	i = _Generic(a, పూర్ణాంకం: a_f() / 2, స్థిరరాశి పూర్ణాంకం: b_f() / 2);
	రాయి("%d\n", i);
	i = _Generic(ptr, పూర్ణాంకం *:1, పూర్ణాంకం * స్థిరరాశి:2, అప్రమేయ:20);
	రాయి("%d\n", i);
	i = gen_sw(a);
	రాయి("%d\n", i);
	i = _Generic(titi, నిర్మాణం a:1, నిర్మాణం b:2, అప్రమేయ:20);
	రాయి("%d\n", i);
	i = _Generic(i2, అక్షరం: 1, పూర్ణాంకం : 0);
	రాయి("%d\n", i);
	i = _Generic(a, అక్షరం:1, పూర్ణాంకం[4]:2, అప్రమేయ:5);
	రాయి("%d\n", i);
	i = _Generic(17, పూర్ణాంకం :1, పూర్ణాంకం **:2);
	రాయి("%d\n", i);
	i = _Generic(17L, పూర్ణాంకం :1, దీర్ఘ :2, దీర్ఘ దీర్ఘ : 3);
	రాయి("%d\n", i);
	i = _Generic("17, io", అక్షరం *: 3, స్థిరరాశి అక్షరం *: 1);
	రాయి("%d\n", i);
	i = _Generic(ti, స్థిరరాశి గుర్తులేని అక్షరం *:1, స్థిరరాశి అక్షరం *:4, అక్షరం *:3,
		     స్థిరరాశి గుర్తుగల అక్షరం *:2);
	రాయి("%d\n", i);
	రాయి("%s\n", _Generic(i + 2L, దీర్ఘ: "long", పూర్ణాంకం: "int",
				దీర్ఘ దీర్ఘ: "long long"));
	i = _Generic(l, దీర్ఘ: 1, పూర్ణాంకం: 2);
	రాయి("%d\n", i);
	i = _Generic(foo, fptr: 3, పూర్ణాంకం: 4, vfptr: 5);
	రాయి("%d\n", i);
	i = _Generic(void_foo, fptr: 3, పూర్ణాంకం: 4, vfptr: 5);
	రాయి("%d\n", i);

	(శూన్య)_Generic((పూర్ణాంకం(*)[2]){0}, పూర్ణాంకం(*)[2]:0, పూర్ణాంకం(*)[4]:0); //shouldn't match twice

	//should accept ({ }) in the controlling expr of _Generic even in const_wanted contexts
	నిర్మాణం { _Bool x_0: _Generic(({0;}),అప్రమేయ:1); } my_x;

	_Generic((__typeof((దశాంశం స్థిరరాశి)((దశాంశం స్థిరరాశి){42}))*){0}, దశాంశం*: 0); //casts lose top-level qualifiers
	పూర్ణాంకం స్థిరరాశి x = 42; __typeof((__typeof(x))x) *xp = 0; (శూన్య)_Generic(xp, పూర్ణాంకం*: 0); //casts lose top-level qualifiers

	//TEST TERNARY:
	//Same type
	_Generic( 0?(దీర్ఘ*)0:(దీర్ఘ*)0,  దీర్ఘ*: (శూన్య)0);
	//combining of qualifiers
	_Generic( 0?(దీర్ఘ అస్థిర*)0:(దీర్ఘ స్థిరరాశి*)0,  దీర్ఘ స్థిరరాశి అస్థిర*: (శూన్య)0);
	//nul-ptr constant selects other type
	_Generic( 0?(దీర్ఘ*)0:0,			దీర్ఘ*: (శూన్య)0);
	_Generic( 0?(దీర్ఘ*)0:(శూన్య*)0, దీర్ఘ*: (శూన్య)0);

	//void ptrs get chosen preferentially; qualifs still combine
	_Generic( 0?(పూర్ణాంకం అస్థిర*)0: (శూన్య స్థిరరాశి*)1, శూన్య అస్థిర స్థిరరాశి*: (శూన్య)0);
        //but this is no null-ptr constant, so fallback to void-choice
        i = 0;
        _Generic( 1?(శూన్య*)(i*0LL):&i, శూన్య*:0);
	//like gcc but not clang, don't treat (void* const as the null-ptr constant)
	_Generic( 0?(పూర్ణాంకం అస్థిర*)0: (శూన్య స్థిరరాశి*)0, శూన్య అస్థిర స్థిరరాశి*: (శూన్య)0);

	//ptrs to incomplete types get completed
	(శూన్య)(పరిమాణం(నిర్మాణం { పూర్ణాంకం x:_Generic( 0?(పూర్ణాంకం (*)[4])0 : (పూర్ణాంకం (*)[])0, పూర్ణాంకం (*)[4]:+1, పూర్ణాంకం (*)[5]:(శూన్య)0); }));
	(శూన్య)(పరిమాణం(నిర్మాణం { పూర్ణాంకం x:_Generic( 0?(పూర్ణాంకం (*)[])0 : (పూర్ణాంకం (*)[4])0, పూర్ణాంకం (*)[4]:+1, పూర్ణాంకం (*)[5]:(శూన్య)0); }));

	{
	  /* completion shouldn't affect the type of decl */
		అక్షరం **argv;
		_Generic(argv, అక్షరం**: (శూన్య)0);
		_Generic(0?(అక్షరం స్థిరరాశి*)0:argv[0], అక్షరం స్థిరరాశి*: (శూన్య)0);
		_Generic(argv, అక్షరం**: (శూన్య)0);
	}
	{
	  బాహ్య పూర్ణాంకం (*ar)[];
	  (శూన్య)(పరిమాణం(నిర్మాణం { పూర్ణాంకం x:_Generic( 0?(పూర్ణాంకం (*)[4])0 : (పూర్ణాంకం (*)[])0, పూర్ణాంకం (*)[4]:+1, పూర్ణాంకం (*)[5]:(శూన్య)0); }));
	  (శూన్య)(పరిమాణం(నిర్మాణం { పూర్ణాంకం x:_Generic( 0?(పూర్ణాంకం (*)[])0 : (పూర్ణాంకం (*)[4])0, పూర్ణాంకం (*)[4]:+1, పూర్ణాంకం (*)[5]:(శూన్య)0); }));
	  (శూన్య)(పరిమాణం(నిర్మాణం { పూర్ణాంకం x:_Generic( 0?ar : (పూర్ణాంకం (*)[4])0, పూర్ణాంకం (*)[4]:+1, పూర్ణాంకం (*)[5]:(శూన్య)0); }));
	  (శూన్య)(పరిమాణం(నిర్మాణం { పూర్ణాంకం x:_Generic( 0?(పూర్ణాంకం (*)[4])0 : ar, పూర్ణాంకం (*)[4]:+1, పూర్ణాంకం (*)[5]:(శూన్య)0); }));
	  (శూన్య)(పరిమాణం(నిర్మాణం { పూర్ణాంకం x:_Generic( 0?(పూర్ణాంకం (*)[5])0 : ar, పూర్ణాంకం (*)[5]:+1, పూర్ణాంకం (*)[4]:(శూన్య)0); }));
	}

	రాయి ("%d\n", f(t));

	తిరిగి 0;
}
