#ಅನ್ತರ್ಭಾವ <stdio.h>

ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ a = 0;

ರಚನೆ a {
	ಪೂರ್ಣಾಂಕ a;
};

ರಚನೆ b {
	ಪೂರ್ಣಾಂಕ a;
};

ಪೂರ್ಣಾಂಕ a_f()
{
	ಹಿಂತಿರುಗಿ 20;
}

ಪೂರ್ಣಾಂಕ b_f()
{
	ಹಿಂತಿರುಗಿ 10;
}

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ (*fptr)(ಪೂರ್ಣಾಂಕ);
ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಶೂನ್ಯ (*vfptr)(ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ foo(ಪೂರ್ಣಾಂಕ i)
{
  ಹಿಂತಿರುಗಿ i;
}
ಶೂನ್ಯ void_foo(ಪೂರ್ಣಾಂಕ i) {}

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ int_type1;

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಪೂರ್ಣಾಂಕ T[4];
ಪೂರ್ಣಾಂಕ f(T t)
{
	ಹಿಂತಿರುಗಿ _Generic(t, __typeof__( ((ಶೂನ್ಯ)0, (T){0}) ) : 1 );
}

#ವ್ಯಾಖ್ಯಾನಿಸು gen_sw(a) _Generic(a, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *: 1, ಪೂರ್ವನಿಯೋಜಿತ: 8, ಪೂರ್ಣಾಂಕ: 123);

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
	ಪೂರ್ಣಾಂಕ i = 0;
	ಚಿಹ್ನೆಯುಳ್ಳ ದೀರ್ಘ ಪೂರ್ಣಾಂಕ l = 2;
	ರಚನೆ b titi;
	ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ * ಸ್ಥಿರಾಂಕ ptr;
	ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *ti;
	int_type1 i2;
	T t;

	i = _Generic(a, ಪೂರ್ಣಾಂಕ: a_f, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ: b_f)();
	ಬರೆ("%d\n", i);
	i = _Generic(a, ಪೂರ್ಣಾಂಕ: a_f() / 2, ಸ್ಥಿರಾಂಕ ಪೂರ್ಣಾಂಕ: b_f() / 2);
	ಬರೆ("%d\n", i);
	i = _Generic(ptr, ಪೂರ್ಣಾಂಕ *:1, ಪೂರ್ಣಾಂಕ * ಸ್ಥಿರಾಂಕ:2, ಪೂರ್ವನಿಯೋಜಿತ:20);
	ಬರೆ("%d\n", i);
	i = gen_sw(a);
	ಬರೆ("%d\n", i);
	i = _Generic(titi, ರಚನೆ a:1, ರಚನೆ b:2, ಪೂರ್ವನಿಯೋಜಿತ:20);
	ಬರೆ("%d\n", i);
	i = _Generic(i2, ಅಕ್ಷರ: 1, ಪೂರ್ಣಾಂಕ : 0);
	ಬರೆ("%d\n", i);
	i = _Generic(a, ಅಕ್ಷರ:1, ಪೂರ್ಣಾಂಕ[4]:2, ಪೂರ್ವನಿಯೋಜಿತ:5);
	ಬರೆ("%d\n", i);
	i = _Generic(17, ಪೂರ್ಣಾಂಕ :1, ಪೂರ್ಣಾಂಕ **:2);
	ಬರೆ("%d\n", i);
	i = _Generic(17L, ಪೂರ್ಣಾಂಕ :1, ದೀರ್ಘ :2, ದೀರ್ಘ ದೀರ್ಘ : 3);
	ಬರೆ("%d\n", i);
	i = _Generic("17, io", ಅಕ್ಷರ *: 3, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *: 1);
	ಬರೆ("%d\n", i);
	i = _Generic(ti, ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *:1, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *:4, ಅಕ್ಷರ *:3,
		     ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆಯುಳ್ಳ ಅಕ್ಷರ *:2);
	ಬರೆ("%d\n", i);
	ಬರೆ("%s\n", _Generic(i + 2L, ದೀರ್ಘ: "long", ಪೂರ್ಣಾಂಕ: "int",
				ದೀರ್ಘ ದೀರ್ಘ: "long long"));
	i = _Generic(l, ದೀರ್ಘ: 1, ಪೂರ್ಣಾಂಕ: 2);
	ಬರೆ("%d\n", i);
	i = _Generic(foo, fptr: 3, ಪೂರ್ಣಾಂಕ: 4, vfptr: 5);
	ಬರೆ("%d\n", i);
	i = _Generic(void_foo, fptr: 3, ಪೂರ್ಣಾಂಕ: 4, vfptr: 5);
	ಬರೆ("%d\n", i);

	(ಶೂನ್ಯ)_Generic((ಪೂರ್ಣಾಂಕ(*)[2]){0}, ಪೂರ್ಣಾಂಕ(*)[2]:0, ಪೂರ್ಣಾಂಕ(*)[4]:0); //shouldn't match twice

	//should accept ({ }) in the controlling expr of _Generic even in const_wanted contexts
	ರಚನೆ { _Bool x_0: _Generic(({0;}),ಪೂರ್ವನಿಯೋಜಿತ:1); } my_x;

	_Generic((__typeof((ದಶಮಾಂಶ ಸ್ಥಿರಾಂಕ)((ದಶಮಾಂಶ ಸ್ಥಿರಾಂಕ){42}))*){0}, ದಶಮಾಂಶ*: 0); //casts lose top-level qualifiers
	ಪೂರ್ಣಾಂಕ ಸ್ಥಿರಾಂಕ x = 42; __typeof((__typeof(x))x) *xp = 0; (ಶೂನ್ಯ)_Generic(xp, ಪೂರ್ಣಾಂಕ*: 0); //casts lose top-level qualifiers

	//TEST TERNARY:
	//Same type
	_Generic( 0?(ದೀರ್ಘ*)0:(ದೀರ್ಘ*)0,  ದೀರ್ಘ*: (ಶೂನ್ಯ)0);
	//combining of qualifiers
	_Generic( 0?(ದೀರ್ಘ ಅಸ್ಥಿರ*)0:(ದೀರ್ಘ ಸ್ಥಿರಾಂಕ*)0,  ದೀರ್ಘ ಸ್ಥಿರಾಂಕ ಅಸ್ಥಿರ*: (ಶೂನ್ಯ)0);
	//nul-ptr constant selects other type
	_Generic( 0?(ದೀರ್ಘ*)0:0,			ದೀರ್ಘ*: (ಶೂನ್ಯ)0);
	_Generic( 0?(ದೀರ್ಘ*)0:(ಶೂನ್ಯ*)0, ದೀರ್ಘ*: (ಶೂನ್ಯ)0);

	//void ptrs get chosen preferentially; qualifs still combine
	_Generic( 0?(ಪೂರ್ಣಾಂಕ ಅಸ್ಥಿರ*)0: (ಶೂನ್ಯ ಸ್ಥಿರಾಂಕ*)1, ಶೂನ್ಯ ಅಸ್ಥಿರ ಸ್ಥಿರಾಂಕ*: (ಶೂನ್ಯ)0);
        //but this is no null-ptr constant, so fallback to void-choice
        i = 0;
        _Generic( 1?(ಶೂನ್ಯ*)(i*0LL):&i, ಶೂನ್ಯ*:0);
	//like gcc but not clang, don't treat (void* const as the null-ptr constant)
	_Generic( 0?(ಪೂರ್ಣಾಂಕ ಅಸ್ಥಿರ*)0: (ಶೂನ್ಯ ಸ್ಥಿರಾಂಕ*)0, ಶೂನ್ಯ ಅಸ್ಥಿರ ಸ್ಥಿರಾಂಕ*: (ಶೂನ್ಯ)0);

	//ptrs to incomplete types get completed
	(ಶೂನ್ಯ)(ಗಾತ್ರ(ರಚನೆ { ಪೂರ್ಣಾಂಕ x:_Generic( 0?(ಪೂರ್ಣಾಂಕ (*)[4])0 : (ಪೂರ್ಣಾಂಕ (*)[])0, ಪೂರ್ಣಾಂಕ (*)[4]:+1, ಪೂರ್ಣಾಂಕ (*)[5]:(ಶೂನ್ಯ)0); }));
	(ಶೂನ್ಯ)(ಗಾತ್ರ(ರಚನೆ { ಪೂರ್ಣಾಂಕ x:_Generic( 0?(ಪೂರ್ಣಾಂಕ (*)[])0 : (ಪೂರ್ಣಾಂಕ (*)[4])0, ಪೂರ್ಣಾಂಕ (*)[4]:+1, ಪೂರ್ಣಾಂಕ (*)[5]:(ಶೂನ್ಯ)0); }));

	{
	  /* completion shouldn't affect the type of decl */
		ಅಕ್ಷರ **argv;
		_Generic(argv, ಅಕ್ಷರ**: (ಶೂನ್ಯ)0);
		_Generic(0?(ಅಕ್ಷರ ಸ್ಥಿರಾಂಕ*)0:argv[0], ಅಕ್ಷರ ಸ್ಥಿರಾಂಕ*: (ಶೂನ್ಯ)0);
		_Generic(argv, ಅಕ್ಷರ**: (ಶೂನ್ಯ)0);
	}
	{
	  ಬಾಹ್ಯ ಪೂರ್ಣಾಂಕ (*ar)[];
	  (ಶೂನ್ಯ)(ಗಾತ್ರ(ರಚನೆ { ಪೂರ್ಣಾಂಕ x:_Generic( 0?(ಪೂರ್ಣಾಂಕ (*)[4])0 : (ಪೂರ್ಣಾಂಕ (*)[])0, ಪೂರ್ಣಾಂಕ (*)[4]:+1, ಪೂರ್ಣಾಂಕ (*)[5]:(ಶೂನ್ಯ)0); }));
	  (ಶೂನ್ಯ)(ಗಾತ್ರ(ರಚನೆ { ಪೂರ್ಣಾಂಕ x:_Generic( 0?(ಪೂರ್ಣಾಂಕ (*)[])0 : (ಪೂರ್ಣಾಂಕ (*)[4])0, ಪೂರ್ಣಾಂಕ (*)[4]:+1, ಪೂರ್ಣಾಂಕ (*)[5]:(ಶೂನ್ಯ)0); }));
	  (ಶೂನ್ಯ)(ಗಾತ್ರ(ರಚನೆ { ಪೂರ್ಣಾಂಕ x:_Generic( 0?ar : (ಪೂರ್ಣಾಂಕ (*)[4])0, ಪೂರ್ಣಾಂಕ (*)[4]:+1, ಪೂರ್ಣಾಂಕ (*)[5]:(ಶೂನ್ಯ)0); }));
	  (ಶೂನ್ಯ)(ಗಾತ್ರ(ರಚನೆ { ಪೂರ್ಣಾಂಕ x:_Generic( 0?(ಪೂರ್ಣಾಂಕ (*)[4])0 : ar, ಪೂರ್ಣಾಂಕ (*)[4]:+1, ಪೂರ್ಣಾಂಕ (*)[5]:(ಶೂನ್ಯ)0); }));
	  (ಶೂನ್ಯ)(ಗಾತ್ರ(ರಚನೆ { ಪೂರ್ಣಾಂಕ x:_Generic( 0?(ಪೂರ್ಣಾಂಕ (*)[5])0 : ar, ಪೂರ್ಣಾಂಕ (*)[5]:+1, ಪೂರ್ಣಾಂಕ (*)[4]:(ಶೂನ್ಯ)0); }));
	}

	ಬರೆ ("%d\n", f(t));

	ಹಿಂತಿರುಗಿ 0;
}
