#अन्तर्भाव <stdio.h>

स्थिरांक पूर्णांक a = 0;

संरचना a {
	पूर्णांक a;
};

संरचना b {
	पूर्णांक a;
};

पूर्णांक a_f()
{
	परत 20;
}

पूर्णांक b_f()
{
	परत 10;
}

प्रकारव्याख्या पूर्णांक (*fptr)(पूर्णांक);
प्रकारव्याख्या शून्य (*vfptr)(पूर्णांक);
पूर्णांक foo(पूर्णांक i)
{
  परत i;
}
शून्य void_foo(पूर्णांक i) {}

प्रकारव्याख्या पूर्णांक int_type1;

प्रकारव्याख्या पूर्णांक T[4];
पूर्णांक f(T t)
{
	परत _Generic(t, __typeof__( ((शून्य)0, (T){0}) ) : 1 );
}

#define gen_sw(a) _Generic(a, स्थिरांक अक्षर *: 1, पूर्वनिर्धारित: 8, पूर्णांक: 123);

पूर्णांक main()
{
	पूर्णांक i = 0;
	चिन्हित दीर्घ पूर्णांक l = 2;
	संरचना b titi;
	स्थिरांक पूर्णांक * स्थिरांक ptr;
	स्थिरांक अक्षर *ti;
	int_type1 i2;
	T t;

	i = _Generic(a, पूर्णांक: a_f, स्थिरांक पूर्णांक: b_f)();
	म_लिखो("%d\n", i);
	i = _Generic(a, पूर्णांक: a_f() / 2, स्थिरांक पूर्णांक: b_f() / 2);
	म_लिखो("%d\n", i);
	i = _Generic(ptr, पूर्णांक *:1, पूर्णांक * स्थिरांक:2, पूर्वनिर्धारित:20);
	म_लिखो("%d\n", i);
	i = gen_sw(a);
	म_लिखो("%d\n", i);
	i = _Generic(titi, संरचना a:1, संरचना b:2, पूर्वनिर्धारित:20);
	म_लिखो("%d\n", i);
	i = _Generic(i2, अक्षर: 1, पूर्णांक : 0);
	म_लिखो("%d\n", i);
	i = _Generic(a, अक्षर:1, पूर्णांक[4]:2, पूर्वनिर्धारित:5);
	म_लिखो("%d\n", i);
	i = _Generic(17, पूर्णांक :1, पूर्णांक **:2);
	म_लिखो("%d\n", i);
	i = _Generic(17L, पूर्णांक :1, दीर्घ :2, दीर्घ दीर्घ : 3);
	म_लिखो("%d\n", i);
	i = _Generic("17, io", अक्षर *: 3, स्थिरांक अक्षर *: 1);
	म_लिखो("%d\n", i);
	i = _Generic(ti, स्थिरांक अचिन्हित अक्षर *:1, स्थिरांक अक्षर *:4, अक्षर *:3,
		     स्थिरांक चिन्हित अक्षर *:2);
	म_लिखो("%d\n", i);
	म_लिखो("%s\n", _Generic(i + 2L, दीर्घ: "long", पूर्णांक: "int",
				दीर्घ दीर्घ: "long long"));
	i = _Generic(l, दीर्घ: 1, पूर्णांक: 2);
	म_लिखो("%d\n", i);
	i = _Generic(foo, fptr: 3, पूर्णांक: 4, vfptr: 5);
	म_लिखो("%d\n", i);
	i = _Generic(void_foo, fptr: 3, पूर्णांक: 4, vfptr: 5);
	म_लिखो("%d\n", i);

	(शून्य)_Generic((पूर्णांक(*)[2]){0}, पूर्णांक(*)[2]:0, पूर्णांक(*)[4]:0); //shouldn't match twice

	//should accept ({ }) in the controlling expr of _Generic even in const_wanted contexts
	संरचना { _Bool x_0: _Generic(({0;}),पूर्वनिर्धारित:1); } my_x;

	_Generic((__typeof((दशांश स्थिरांक)((दशांश स्थिरांक){42}))*){0}, दशांश*: 0); //casts lose top-level qualifiers
	पूर्णांक स्थिरांक x = 42; __typeof((__typeof(x))x) *xp = 0; (शून्य)_Generic(xp, पूर्णांक*: 0); //casts lose top-level qualifiers

	//TEST TERNARY:
	//Same type
	_Generic( 0?(दीर्घ*)0:(दीर्घ*)0,  दीर्घ*: (शून्य)0);
	//combining of qualifiers
	_Generic( 0?(दीर्घ अस्थिर*)0:(दीर्घ स्थिरांक*)0,  दीर्घ स्थिरांक अस्थिर*: (शून्य)0);
	//nul-ptr constant selects other type
	_Generic( 0?(दीर्घ*)0:0,			दीर्घ*: (शून्य)0);
	_Generic( 0?(दीर्घ*)0:(शून्य*)0, दीर्घ*: (शून्य)0);

	//void ptrs get chosen preferentially; qualifs still combine
	_Generic( 0?(पूर्णांक अस्थिर*)0: (शून्य स्थिरांक*)1, शून्य अस्थिर स्थिरांक*: (शून्य)0);
        //but this is no null-ptr constant, so fallback to void-choice
        i = 0;
        _Generic( 1?(शून्य*)(i*0LL):&i, शून्य*:0);
	//like gcc but not clang, don't treat (void* const as the null-ptr constant)
	_Generic( 0?(पूर्णांक अस्थिर*)0: (शून्य स्थिरांक*)0, शून्य अस्थिर स्थिरांक*: (शून्य)0);

	//ptrs to incomplete types get completed
	(शून्य)(आकार(संरचना { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[4])0 : (पूर्णांक (*)[])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(शून्य)0); }));
	(शून्य)(आकार(संरचना { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[])0 : (पूर्णांक (*)[4])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(शून्य)0); }));

	{
	  /* completion shouldn't affect the type of decl */
		अक्षर **argv;
		_Generic(argv, अक्षर**: (शून्य)0);
		_Generic(0?(अक्षर स्थिरांक*)0:argv[0], अक्षर स्थिरांक*: (शून्य)0);
		_Generic(argv, अक्षर**: (शून्य)0);
	}
	{
	  बाह्य पूर्णांक (*ar)[];
	  (शून्य)(आकार(संरचना { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[4])0 : (पूर्णांक (*)[])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(शून्य)0); }));
	  (शून्य)(आकार(संरचना { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[])0 : (पूर्णांक (*)[4])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(शून्य)0); }));
	  (शून्य)(आकार(संरचना { पूर्णांक x:_Generic( 0?ar : (पूर्णांक (*)[4])0, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(शून्य)0); }));
	  (शून्य)(आकार(संरचना { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[4])0 : ar, पूर्णांक (*)[4]:+1, पूर्णांक (*)[5]:(शून्य)0); }));
	  (शून्य)(आकार(संरचना { पूर्णांक x:_Generic( 0?(पूर्णांक (*)[5])0 : ar, पूर्णांक (*)[5]:+1, पूर्णांक (*)[4]:(शून्य)0); }));
	}

	म_लिखो ("%d\n", f(t));

	परत 0;
}
