/* ----------------------------------------------------------------------- */
#अगर TEST == 1
{
    काष्ठा M P A __s
    {
        अचिन्हित x : 12;
        अचिन्हित अक्षर y : 7;
        अचिन्हित z : 28;
        अचिन्हित a: 4;
        अचिन्हित b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#या_अगर TEST == 2
{
    काष्ठा M P __s
    {
        पूर्णांक x: 12;
        अक्षर y: 6;
        दीर्घ दीर्घ z:63;
        A अक्षर a:4;
        दीर्घ दीर्घ b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#या_अगर TEST == 3
{
    काष्ठा M P __s
    {
        अचिन्हित x:5, y:5, :0, z:5; अक्षर a:5; A लघु b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#या_अगर TEST == 4
{
    काष्ठा M P __s {
        पूर्णांक x : 3;
        पूर्णांक : 2;
        पूर्णांक y : 1;
        पूर्णांक : 0;
        पूर्णांक z : 5;
        पूर्णांक a : 7;
        अचिन्हित पूर्णांक b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#या_अगर TEST == 5
{
    काष्ठा M P __s {
        दीर्घ दीर्घ x : 45;
        दीर्घ दीर्घ : 2;
        दीर्घ दीर्घ y : 30;
        अचिन्हित दीर्घ दीर्घ z : 38;
        अक्षर a; लघु b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#या_अगर TEST == 6
{
    काष्ठा M P __s {
	पूर्णांक a;
	चिन्हित अक्षर b;
	पूर्णांक x : 12, y : 4, : 0, : 4, z : 3;
	अक्षर d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#या_अगर TEST == 7
{
#अगर_घोषित _WIN32
    प्रकार दीर्घ दीर्घ पूर्णांक ll;
#अन्यथा
    प्रकार दीर्घ पूर्णांक ll;
#पूर्ण_अगर
    काष्ठा M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#या_अगर defined PACK

#अगर PACK
# pragma pack(धकेलो,1)
# define P //_P
#अन्यथा
# define P
#पूर्ण_अगर

म_लिखो("\n\n" + 2*शीर्ष);
#घोषणा TEST 1
#समावेश SELF
शीर्ष = 0;
#घोषणा TEST 2
#समावेश SELF
#घोषणा TEST 3
#समावेश SELF
#घोषणा TEST 4
#समावेश SELF
#घोषणा TEST 5
#समावेश SELF
#घोषणा TEST 6
#समावेश SELF
#घोषणा TEST 7
#समावेश SELF

#अगर PACK
# pragma pack(निकालो)
#पूर्ण_अगर

#अघोषित P
#अघोषित PACK

/* ----------------------------------------------------------------------- */
#या_अगर defined ALIGN

#अगर ALIGN
# define A _A(16)
#अन्यथा
# define A
#पूर्ण_अगर

#घोषणा PACK 0
#समावेश SELF
#घोषणा PACK 1
#समावेश SELF

#अघोषित A
#अघोषित ALIGN

/* ----------------------------------------------------------------------- */
#या_अगर defined MS_BF

#अगर MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#अन्यथा
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#पूर्ण_अगर
#अगर_अघोषित M
# define M
#पूर्ण_अगर

#घोषणा ALIGN 0
#समावेश SELF
#घोषणा ALIGN 1
#समावेश SELF

#अघोषित M
#अघोषित MS_BF

/* ----------------------------------------------------------------------- */
#अन्यथा

#समावेश <stdio.h>
#समावेश <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#अघोषित __attribute__

व्योम dump(व्योम *p, पूर्णांक s)
{
    पूर्णांक i;
    क्रम (i = s; --i >= 0;)
        म_लिखो("%02X", ((अचिन्हित अक्षर*)p)[i]);
    म_लिखो("\n");
}

#घोषणा pv(m) \
    म_लिखो(माप (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#घोषणा TEST_STRUCT(v1,v2,v3,v4,v5) { \
        काष्ठा __s _s, *s = & _s; \
        म_लिखो("\n---- TEST %d%s%s%s ----\n" + शीर्ष, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        स_रखो(s, 0, माप *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        म_लिखो("bits in use : "), dump(s, माप *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        म_लिखो("bits as set : "), dump(s, माप *s); \
        म_लिखो("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), म_लिखो("\n"); \
        म_लिखो("align/size  : %d %d\n", alignof(काष्ठा __s),माप(काष्ठा __s)); \
    }

#अगर_घोषित _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#अन्यथा
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#पूर्ण_अगर

#अगर_अघोषित MS_BITFIELDS
# define MS_BITFIELDS 0
#पूर्ण_अगर

#घोषणा SELF "95_bitfields.c"

पूर्णांक शीर्ष = 1;

पूर्णांक मुख्य()
{
#घोषणा MS_BF MS_BITFIELDS
#समावेश SELF
    वापस 0;
}

/* ----------------------------------------------------------------------- */
#पूर्ण_अगर
#अघोषित TEST
