/* ----------------------------------------------------------------------- */
#ਜੇ TEST == 1
{
    ਬਣਤਰ M P A __s
    {
        ਬਿਨਾਨਿਸ਼ਾਨੀ x : 12;
        ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ y : 7;
        ਬਿਨਾਨਿਸ਼ਾਨੀ z : 28;
        ਬਿਨਾਨਿਸ਼ਾਨੀ a: 4;
        ਬਿਨਾਨਿਸ਼ਾਨੀ b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ TEST == 2
{
    ਬਣਤਰ M P __s
    {
        ਪੂਰਨ x: 12;
        ਅੱਖਰ y: 6;
        ਲੰਮਾ ਲੰਮਾ z:63;
        A ਅੱਖਰ a:4;
        ਲੰਮਾ ਲੰਮਾ b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ TEST == 3
{
    ਬਣਤਰ M P __s
    {
        ਬਿਨਾਨਿਸ਼ਾਨੀ x:5, y:5, :0, z:5; ਅੱਖਰ a:5; A ਛੋਟਾ b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ TEST == 4
{
    ਬਣਤਰ M P __s {
        ਪੂਰਨ x : 3;
        ਪੂਰਨ : 2;
        ਪੂਰਨ y : 1;
        ਪੂਰਨ : 0;
        ਪੂਰਨ z : 5;
        ਪੂਰਨ a : 7;
        ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ TEST == 5
{
    ਬਣਤਰ M P __s {
        ਲੰਮਾ ਲੰਮਾ x : 45;
        ਲੰਮਾ ਲੰਮਾ : 2;
        ਲੰਮਾ ਲੰਮਾ y : 30;
        ਬਿਨਾਨਿਸ਼ਾਨੀ ਲੰਮਾ ਲੰਮਾ z : 38;
        ਅੱਖਰ a; ਛੋਟਾ b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ TEST == 6
{
    ਬਣਤਰ M P __s {
	ਪੂਰਨ a;
	ਨਿਸ਼ਾਨੀਵਾਲਾ ਅੱਖਰ b;
	ਪੂਰਨ x : 12, y : 4, : 0, : 4, z : 3;
	ਅੱਖਰ d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ TEST == 7
{
#ਜੇ_ਪਰਿਭਾਸ਼ਿਤ _WIN32
    ਕਿਸਮਪਰਿਭਾਸ਼ਾ ਲੰਮਾ ਲੰਮਾ ਪੂਰਨ ll;
#ਨਹੀਂਤਾਂ
    ਕਿਸਮਪਰਿਭਾਸ਼ਾ ਲੰਮਾ ਪੂਰਨ ll;
#ਜੇ_ਅੰਤ
    ਬਣਤਰ M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ defined PACK

#ਜੇ PACK
# pragma pack(ਧੱਕੋ,1)
# define P //_P
#ਨਹੀਂਤਾਂ
# define P
#ਜੇ_ਅੰਤ

ਲਿਖੋ("\n\n" + 2*ਸਿਖਰ);
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ TEST 1
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
ਸਿਖਰ = 0;
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ TEST 2
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ TEST 3
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ TEST 4
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ TEST 5
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ TEST 6
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ TEST 7
#ਅਨ੍ਤਰ੍ਭਾਵ SELF

#ਜੇ PACK
# pragma pack(ਕੱਢੋ)
#ਜੇ_ਅੰਤ

#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ P
#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ PACK

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ defined ALIGN

#ਜੇ ALIGN
# define A _A(16)
#ਨਹੀਂਤਾਂ
# define A
#ਜੇ_ਅੰਤ

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ PACK 0
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ PACK 1
#ਅਨ੍ਤਰ੍ਭਾਵ SELF

#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ A
#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ ALIGN

/* ----------------------------------------------------------------------- */
#ਜਾਂਜੇ defined MS_BF

#ਜੇ MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#ਨਹੀਂਤਾਂ
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#ਜੇ_ਅੰਤ
#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ M
# define M
#ਜੇ_ਅੰਤ

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ ALIGN 0
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ ALIGN 1
#ਅਨ੍ਤਰ੍ਭਾਵ SELF

#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ M
#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ MS_BF

/* ----------------------------------------------------------------------- */
#ਨਹੀਂਤਾਂ

#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ __attribute__

ਖਾਲੀ dump(ਖਾਲੀ *p, ਪੂਰਨ s)
{
    ਪੂਰਨ i;
    ਲਈ (i = s; --i >= 0;)
        ਲਿਖੋ("%02X", ((ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ*)p)[i]);
    ਲਿਖੋ("\n");
}

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ pv(m) \
    ਲਿਖੋ(ਆਕਾਰ (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ TEST_STRUCT(v1,v2,v3,v4,v5) { \
        ਬਣਤਰ __s _s, *s = & _s; \
        ਲਿਖੋ("\n---- TEST %d%s%s%s ----\n" + ਸਿਖਰ, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        memset(s, 0, ਆਕਾਰ *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        ਲਿਖੋ("bits in use : "), dump(s, ਆਕਾਰ *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        ਲਿਖੋ("bits as set : "), dump(s, ਆਕਾਰ *s); \
        ਲਿਖੋ("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), ਲਿਖੋ("\n"); \
        ਲਿਖੋ("align/size  : %d %d\n", alignof(ਬਣਤਰ __s),ਆਕਾਰ(ਬਣਤਰ __s)); \
    }

#ਜੇ_ਪਰਿਭਾਸ਼ਿਤ _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#ਨਹੀਂਤਾਂ
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#ਜੇ_ਅੰਤ

#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ MS_BITFIELDS
# define MS_BITFIELDS 0
#ਜੇ_ਅੰਤ

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ SELF "95_bitfields.c"

ਪੂਰਨ ਸਿਖਰ = 1;

ਪੂਰਨ ਮੁੱਖ()
{
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ MS_BF MS_BITFIELDS
#ਅਨ੍ਤਰ੍ਭਾਵ SELF
    ਵਾਪਸ 0;
}

/* ----------------------------------------------------------------------- */
#ਜੇ_ਅੰਤ
#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ TEST
