/* ----------------------------------------------------------------------- */
#إذا TEST == 1
{
    بنية M P A __s
    {
        بینښه x : 12;
        بینښه حرف y : 7;
        بینښه z : 28;
        بینښه a: 4;
        بینښه b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 2
{
    بنية M P __s
    {
        صحيح x: 12;
        حرف y: 6;
        اوږد اوږد z:63;
        A حرف a:4;
        اوږد اوږد b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 3
{
    بنية M P __s
    {
        بینښه x:5, y:5, :0, z:5; حرف a:5; A لنډ b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 4
{
    بنية M P __s {
        صحيح x : 3;
        صحيح : 2;
        صحيح y : 1;
        صحيح : 0;
        صحيح z : 5;
        صحيح a : 7;
        بینښه صحيح b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 5
{
    بنية M P __s {
        اوږد اوږد x : 45;
        اوږد اوږد : 2;
        اوږد اوږد y : 30;
        بینښه اوږد اوږد z : 38;
        حرف a; لنډ b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 6
{
    بنية M P __s {
	صحيح a;
	نښهدار حرف b;
	صحيح x : 12, y : 4, : 0, : 4, z : 3;
	حرف d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 7
{
#که_تعریف_شوی _WIN32
    تعريفنوع اوږد اوږد صحيح ll;
#وإلا
    تعريفنوع اوږد صحيح ll;
#د_که_پای
    بنية M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا defined PACK

#إذا PACK
# pragma pack(ټېل,1)
# define P //_P
#وإلا
# define P
#د_که_پای

چاپ_کړه("\n\n" + 2*سر);
#تعریف_کړه TEST 1
#ضمن SELF
سر = 0;
#تعریف_کړه TEST 2
#ضمن SELF
#تعریف_کړه TEST 3
#ضمن SELF
#تعریف_کړه TEST 4
#ضمن SELF
#تعریف_کړه TEST 5
#ضمن SELF
#تعریف_کړه TEST 6
#ضمن SELF
#تعریف_کړه TEST 7
#ضمن SELF

#إذا PACK
# pragma pack(راوباسه)
#د_که_پای

#تعریف_لغوه P
#تعریف_لغوه PACK

/* ----------------------------------------------------------------------- */
#وإلاإذا defined ALIGN

#إذا ALIGN
# define A _A(16)
#وإلا
# define A
#د_که_پای

#تعریف_کړه PACK 0
#ضمن SELF
#تعریف_کړه PACK 1
#ضمن SELF

#تعریف_لغوه A
#تعریف_لغوه ALIGN

/* ----------------------------------------------------------------------- */
#وإلاإذا defined MS_BF

#إذا MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#وإلا
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#د_که_پای
#که_نه_تعریف_شوی M
# define M
#د_که_پای

#تعریف_کړه ALIGN 0
#ضمن SELF
#تعریف_کړه ALIGN 1
#ضمن SELF

#تعریف_لغوه M
#تعریف_لغوه MS_BF

/* ----------------------------------------------------------------------- */
#وإلا

#ضمن <stdio.h>
#ضمن <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#تعریف_لغوه __attribute__

فراغ dump(فراغ *p, صحيح s)
{
    صحيح i;
    لكل (i = s; --i >= 0;)
        چاپ_کړه("%02X", ((بینښه حرف*)p)[i]);
    چاپ_کړه("\n");
}

#تعریف_کړه pv(m) \
    چاپ_کړه(حجم (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#تعریف_کړه TEST_STRUCT(v1,v2,v3,v4,v5) { \
        بنية __s _s, *s = & _s; \
        چاپ_کړه("\n---- TEST %d%s%s%s ----\n" + سر, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        memset(s, 0, حجم *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        چاپ_کړه("bits in use : "), dump(s, حجم *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        چاپ_کړه("bits as set : "), dump(s, حجم *s); \
        چاپ_کړه("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), چاپ_کړه("\n"); \
        چاپ_کړه("align/size  : %d %d\n", alignof(بنية __s),حجم(بنية __s)); \
    }

#که_تعریف_شوی _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#وإلا
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#د_که_پای

#که_نه_تعریف_شوی MS_BITFIELDS
# define MS_BITFIELDS 0
#د_که_پای

#تعریف_کړه SELF "95_bitfields.c"

صحيح سر = 1;

صحيح اصلي()
{
#تعریف_کړه MS_BF MS_BITFIELDS
#ضمن SELF
    أرجع 0;
}

/* ----------------------------------------------------------------------- */
#د_که_پای
#تعریف_لغوه TEST
