/* ----------------------------------------------------------------------- */
#اگر TEST == 1
{
    ساخت M P A __s
    {
        غیرعلامتی x : 12;
        غیرعلامتی حرف y : 7;
        غیرعلامتی z : 28;
        غیرعلامتی a: 4;
        غیرعلامتی b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر TEST == 2
{
    ساخت M P __s
    {
        صحیح x: 12;
        حرف y: 6;
        طویل طویل z:63;
        A حرف a:4;
        طویل طویل b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر TEST == 3
{
    ساخت M P __s
    {
        غیرعلامتی x:5, y:5, :0, z:5; حرف a:5; A مختصر b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر TEST == 4
{
    ساخت M P __s {
        صحیح x : 3;
        صحیح : 2;
        صحیح y : 1;
        صحیح : 0;
        صحیح z : 5;
        صحیح a : 7;
        غیرعلامتی صحیح b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر TEST == 5
{
    ساخت M P __s {
        طویل طویل x : 45;
        طویل طویل : 2;
        طویل طویل y : 30;
        غیرعلامتی طویل طویل z : 38;
        حرف a; مختصر b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر TEST == 6
{
    ساخت M P __s {
	صحیح a;
	علامتی حرف b;
	صحیح x : 12, y : 4, : 0, : 4, z : 3;
	حرف d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر TEST == 7
{
#اگر_تعریف_شدہ _WIN32
    قسمتعریف طویل طویل صحیح ll;
#ورنہ
    قسمتعریف طویل صحیح ll;
#اگر_ختم
    ساخت M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر defined PACK

#اگر PACK
# pragma pack(ڈالو,1)
# define P //_P
#ورنہ
# define P
#اگر_ختم

لکھو("\n\n" + 2*چوٹی);
#تعریف_کرو TEST 1
#شامل SELF
چوٹی = 0;
#تعریف_کرو TEST 2
#شامل SELF
#تعریف_کرو TEST 3
#شامل SELF
#تعریف_کرو TEST 4
#شامل SELF
#تعریف_کرو TEST 5
#شامل SELF
#تعریف_کرو TEST 6
#شامل SELF
#تعریف_کرو TEST 7
#شامل SELF

#اگر PACK
# pragma pack(نکالو)
#اگر_ختم

#تعریف_منسوخ P
#تعریف_منسوخ PACK

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر defined ALIGN

#اگر ALIGN
# define A _A(16)
#ورنہ
# define A
#اگر_ختم

#تعریف_کرو PACK 0
#شامل SELF
#تعریف_کرو PACK 1
#شامل SELF

#تعریف_منسوخ A
#تعریف_منسوخ ALIGN

/* ----------------------------------------------------------------------- */
#وگرنہ_اگر defined MS_BF

#اگر MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#ورنہ
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#اگر_ختم
#اگر_غیر_تعریف_شدہ M
# define M
#اگر_ختم

#تعریف_کرو ALIGN 0
#شامل SELF
#تعریف_کرو ALIGN 1
#شامل SELF

#تعریف_منسوخ M
#تعریف_منسوخ MS_BF

/* ----------------------------------------------------------------------- */
#ورنہ

#شامل <stdio.h>
#شامل <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#تعریف_منسوخ __attribute__

خالی dump(خالی *p, صحیح s)
{
    صحیح i;
    برائے (i = s; --i >= 0;)
        لکھو("%02X", ((غیرعلامتی حرف*)p)[i]);
    لکھو("\n");
}

#تعریف_کرو pv(m) \
    لکھو(حجم (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#تعریف_کرو TEST_STRUCT(v1,v2,v3,v4,v5) { \
        ساخت __s _s, *s = & _s; \
        لکھو("\n---- TEST %d%s%s%s ----\n" + چوٹی, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        memset(s, 0, حجم *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        لکھو("bits in use : "), dump(s, حجم *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        لکھو("bits as set : "), dump(s, حجم *s); \
        لکھو("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), لکھو("\n"); \
        لکھو("align/size  : %d %d\n", alignof(ساخت __s),حجم(ساخت __s)); \
    }

#اگر_تعریف_شدہ _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#ورنہ
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#اگر_ختم

#اگر_غیر_تعریف_شدہ MS_BITFIELDS
# define MS_BITFIELDS 0
#اگر_ختم

#تعریف_کرو SELF "95_bitfields.c"

صحیح چوٹی = 1;

صحیح مین()
{
#تعریف_کرو MS_BF MS_BITFIELDS
#شامل SELF
    واپس 0;
}

/* ----------------------------------------------------------------------- */
#اگر_ختم
#تعریف_منسوخ TEST
