/* ----------------------------------------------------------------------- */
#ಆದರೆ TEST == 1
{
    ರಚನೆ M P A __s
    {
        ಚಿಹ್ನೆರಹಿತ x : 12;
        ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ y : 7;
        ಚಿಹ್ನೆರಹಿತ z : 28;
        ಚಿಹ್ನೆರಹಿತ a: 4;
        ಚಿಹ್ನೆರಹಿತ b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ TEST == 2
{
    ರಚನೆ M P __s
    {
        ಪೂರ್ಣಾಂಕ x: 12;
        ಅಕ್ಷರ y: 6;
        ದೀರ್ಘ ದೀರ್ಘ z:63;
        A ಅಕ್ಷರ a:4;
        ದೀರ್ಘ ದೀರ್ಘ b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ TEST == 3
{
    ರಚನೆ M P __s
    {
        ಚಿಹ್ನೆರಹಿತ x:5, y:5, :0, z:5; ಅಕ್ಷರ a:5; A ಗಿಡ್ಡ b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ TEST == 4
{
    ರಚನೆ M P __s {
        ಪೂರ್ಣಾಂಕ x : 3;
        ಪೂರ್ಣಾಂಕ : 2;
        ಪೂರ್ಣಾಂಕ y : 1;
        ಪೂರ್ಣಾಂಕ : 0;
        ಪೂರ್ಣಾಂಕ z : 5;
        ಪೂರ್ಣಾಂಕ a : 7;
        ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ TEST == 5
{
    ರಚನೆ M P __s {
        ದೀರ್ಘ ದೀರ್ಘ x : 45;
        ದೀರ್ಘ ದೀರ್ಘ : 2;
        ದೀರ್ಘ ದೀರ್ಘ y : 30;
        ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ z : 38;
        ಅಕ್ಷರ a; ಗಿಡ್ಡ b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ TEST == 6
{
    ರಚನೆ M P __s {
	ಪೂರ್ಣಾಂಕ a;
	ಚಿಹ್ನೆಯುಳ್ಳ ಅಕ್ಷರ b;
	ಪೂರ್ಣಾಂಕ x : 12, y : 4, : 0, : 4, z : 3;
	ಅಕ್ಷರ d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ TEST == 7
{
#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ _WIN32
    ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ದೀರ್ಘ ದೀರ್ಘ ಪೂರ್ಣಾಂಕ ll;
#ಇಲ್ಲದಿದ್ದರೆ
    ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ದೀರ್ಘ ಪೂರ್ಣಾಂಕ ll;
#ಆದರೆ_ಅಂತ್ಯ
    ರಚನೆ M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ defined PACK

#ಆದರೆ PACK
# pragma pack(ತಳ್ಳು,1)
# define P //_P
#ಇಲ್ಲದಿದ್ದರೆ
# define P
#ಆದರೆ_ಅಂತ್ಯ

ಬರೆ("\n\n" + 2*ತುದಿ);
#ವ್ಯಾಖ್ಯಾನಿಸು TEST 1
#ಅನ್ತರ್ಭಾವ SELF
ತುದಿ = 0;
#ವ್ಯಾಖ್ಯಾನಿಸು TEST 2
#ಅನ್ತರ್ಭಾವ SELF
#ವ್ಯಾಖ್ಯಾನಿಸು TEST 3
#ಅನ್ತರ್ಭಾವ SELF
#ವ್ಯಾಖ್ಯಾನಿಸು TEST 4
#ಅನ್ತರ್ಭಾವ SELF
#ವ್ಯಾಖ್ಯಾನಿಸು TEST 5
#ಅನ್ತರ್ಭಾವ SELF
#ವ್ಯಾಖ್ಯಾನಿಸು TEST 6
#ಅನ್ತರ್ಭಾವ SELF
#ವ್ಯಾಖ್ಯಾನಿಸು TEST 7
#ಅನ್ತರ್ಭಾವ SELF

#ಆದರೆ PACK
# pragma pack(ತೆಗೆ)
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು P
#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು PACK

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ defined ALIGN

#ಆದರೆ ALIGN
# define A _A(16)
#ಇಲ್ಲದಿದ್ದರೆ
# define A
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿಸು PACK 0
#ಅನ್ತರ್ಭಾವ SELF
#ವ್ಯಾಖ್ಯಾನಿಸು PACK 1
#ಅನ್ತರ್ಭಾವ SELF

#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು A
#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು ALIGN

/* ----------------------------------------------------------------------- */
#ಅಥವಾಆದರೆ defined MS_BF

#ಆದರೆ MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#ಇಲ್ಲದಿದ್ದರೆ
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#ಆದರೆ_ಅಂತ್ಯ
#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ M
# define M
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿಸು ALIGN 0
#ಅನ್ತರ್ಭಾವ SELF
#ವ್ಯಾಖ್ಯಾನಿಸು ALIGN 1
#ಅನ್ತರ್ಭಾವ SELF

#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು M
#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು MS_BF

/* ----------------------------------------------------------------------- */
#ಇಲ್ಲದಿದ್ದರೆ

#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು __attribute__

ಶೂನ್ಯ dump(ಶೂನ್ಯ *p, ಪೂರ್ಣಾಂಕ s)
{
    ಪೂರ್ಣಾಂಕ i;
    ಗಾಗಿ (i = s; --i >= 0;)
        ಬರೆ("%02X", ((ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ*)p)[i]);
    ಬರೆ("\n");
}

#ವ್ಯಾಖ್ಯಾನಿಸು pv(m) \
    ಬರೆ(ಗಾತ್ರ (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#ವ್ಯಾಖ್ಯಾನಿಸು TEST_STRUCT(v1,v2,v3,v4,v5) { \
        ರಚನೆ __s _s, *s = & _s; \
        ಬರೆ("\n---- TEST %d%s%s%s ----\n" + ತುದಿ, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        memset(s, 0, ಗಾತ್ರ *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        ಬರೆ("bits in use : "), dump(s, ಗಾತ್ರ *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        ಬರೆ("bits as set : "), dump(s, ಗಾತ್ರ *s); \
        ಬರೆ("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), ಬರೆ("\n"); \
        ಬರೆ("align/size  : %d %d\n", alignof(ರಚನೆ __s),ಗಾತ್ರ(ರಚನೆ __s)); \
    }

#ವ್ಯಾಖ್ಯಾನಿತವಾದರೆ _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#ಇಲ್ಲದಿದ್ದರೆ
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ MS_BITFIELDS
# define MS_BITFIELDS 0
#ಆದರೆ_ಅಂತ್ಯ

#ವ್ಯಾಖ್ಯಾನಿಸು SELF "95_bitfields.c"

ಪೂರ್ಣಾಂಕ ತುದಿ = 1;

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
#ವ್ಯಾಖ್ಯಾನಿಸು MS_BF MS_BITFIELDS
#ಅನ್ತರ್ಭಾವ SELF
    ಹಿಂತಿರುಗಿ 0;
}

/* ----------------------------------------------------------------------- */
#ಆದರೆ_ಅಂತ್ಯ
#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು TEST
