/* ----------------------------------------------------------------------- */
#ఒకవేళ TEST == 1
{
    నిర్మాణం M P A __s
    {
        గుర్తులేని x : 12;
        గుర్తులేని అక్షరం y : 7;
        గుర్తులేని z : 28;
        గుర్తులేని a: 4;
        గుర్తులేని b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#లేదావేళ TEST == 2
{
    నిర్మాణం M P __s
    {
        పూర్ణాంకం x: 12;
        అక్షరం y: 6;
        దీర్ఘ దీర్ఘ z:63;
        A అక్షరం a:4;
        దీర్ఘ దీర్ఘ b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#లేదావేళ TEST == 3
{
    నిర్మాణం M P __s
    {
        గుర్తులేని x:5, y:5, :0, z:5; అక్షరం a:5; A పొట్టి b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#లేదావేళ TEST == 4
{
    నిర్మాణం M P __s {
        పూర్ణాంకం x : 3;
        పూర్ణాంకం : 2;
        పూర్ణాంకం y : 1;
        పూర్ణాంకం : 0;
        పూర్ణాంకం z : 5;
        పూర్ణాంకం a : 7;
        గుర్తులేని పూర్ణాంకం b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#లేదావేళ TEST == 5
{
    నిర్మాణం M P __s {
        దీర్ఘ దీర్ఘ x : 45;
        దీర్ఘ దీర్ఘ : 2;
        దీర్ఘ దీర్ఘ y : 30;
        గుర్తులేని దీర్ఘ దీర్ఘ z : 38;
        అక్షరం a; పొట్టి b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#లేదావేళ TEST == 6
{
    నిర్మాణం M P __s {
	పూర్ణాంకం a;
	గుర్తుగల అక్షరం b;
	పూర్ణాంకం x : 12, y : 4, : 0, : 4, z : 3;
	అక్షరం d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#లేదావేళ TEST == 7
{
#నిర్వచితమైతే _WIN32
    రకనిర్వచనం దీర్ఘ దీర్ఘ పూర్ణాంకం ll;
#లేకపోతే
    రకనిర్వచనం దీర్ఘ పూర్ణాంకం ll;
#అయితే_ముగింపు
    నిర్మాణం M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#లేదావేళ defined PACK

#ఒకవేళ PACK
# pragma pack(నెట్టు,1)
# define P //_P
#లేకపోతే
# define P
#అయితే_ముగింపు

రాయి("\n\n" + 2*శిఖరం);
#నిర్వచించు TEST 1
#అన్తర్భావ SELF
శిఖరం = 0;
#నిర్వచించు TEST 2
#అన్తర్భావ SELF
#నిర్వచించు TEST 3
#అన్తర్భావ SELF
#నిర్వచించు TEST 4
#అన్తర్భావ SELF
#నిర్వచించు TEST 5
#అన్తర్భావ SELF
#నిర్వచించు TEST 6
#అన్తర్భావ SELF
#నిర్వచించు TEST 7
#అన్తర్భావ SELF

#ఒకవేళ PACK
# pragma pack(తీయి)
#అయితే_ముగింపు

#నిర్వచనం_రద్దు P
#నిర్వచనం_రద్దు PACK

/* ----------------------------------------------------------------------- */
#లేదావేళ defined ALIGN

#ఒకవేళ ALIGN
# define A _A(16)
#లేకపోతే
# define A
#అయితే_ముగింపు

#నిర్వచించు PACK 0
#అన్తర్భావ SELF
#నిర్వచించు PACK 1
#అన్తర్భావ SELF

#నిర్వచనం_రద్దు A
#నిర్వచనం_రద్దు ALIGN

/* ----------------------------------------------------------------------- */
#లేదావేళ defined MS_BF

#ఒకవేళ MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#లేకపోతే
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#అయితే_ముగింపు
#నిర్వచితం_కాకపోతే M
# define M
#అయితే_ముగింపు

#నిర్వచించు ALIGN 0
#అన్తర్భావ SELF
#నిర్వచించు ALIGN 1
#అన్తర్భావ SELF

#నిర్వచనం_రద్దు M
#నిర్వచనం_రద్దు MS_BF

/* ----------------------------------------------------------------------- */
#లేకపోతే

#అన్తర్భావ <stdio.h>
#అన్తర్భావ <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#నిర్వచనం_రద్దు __attribute__

శూన్య dump(శూన్య *p, పూర్ణాంకం s)
{
    పూర్ణాంకం i;
    కొరకు (i = s; --i >= 0;)
        రాయి("%02X", ((గుర్తులేని అక్షరం*)p)[i]);
    రాయి("\n");
}

#నిర్వచించు pv(m) \
    రాయి(పరిమాణం (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#నిర్వచించు TEST_STRUCT(v1,v2,v3,v4,v5) { \
        నిర్మాణం __s _s, *s = & _s; \
        రాయి("\n---- TEST %d%s%s%s ----\n" + శిఖరం, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        memset(s, 0, పరిమాణం *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        రాయి("bits in use : "), dump(s, పరిమాణం *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        రాయి("bits as set : "), dump(s, పరిమాణం *s); \
        రాయి("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), రాయి("\n"); \
        రాయి("align/size  : %d %d\n", alignof(నిర్మాణం __s),పరిమాణం(నిర్మాణం __s)); \
    }

#నిర్వచితమైతే _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#లేకపోతే
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#అయితే_ముగింపు

#నిర్వచితం_కాకపోతే MS_BITFIELDS
# define MS_BITFIELDS 0
#అయితే_ముగింపు

#నిర్వచించు SELF "95_bitfields.c"

పూర్ణాంకం శిఖరం = 1;

పూర్ణాంకం ప్రధాన()
{
#నిర్వచించు MS_BF MS_BITFIELDS
#అన్తర్భావ SELF
    తిరిగి 0;
}

/* ----------------------------------------------------------------------- */
#అయితే_ముగింపు
#నిర్వచనం_రద్దు TEST
