/* ----------------------------------------------------------------------- */
#إذا TEST == 1
{
    بنية M P A __s
    {
        بنانشان x : 12;
        بنانشان حرف y : 7;
        بنانشان z : 28;
        بنانشان a: 4;
        بنانشان b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 2
{
    بنية M P __s
    {
        صحيح x: 12;
        حرف y: 6;
        ڊگهو ڊگهو z:63;
        A حرف a:4;
        ڊگهو ڊگهو b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 3
{
    بنية M P __s
    {
        بنانشان x:5, y:5, :0, z:5; حرف a:5; A ننڍو b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 4
{
    بنية M P __s {
        صحيح x : 3;
        صحيح : 2;
        صحيح y : 1;
        صحيح : 0;
        صحيح z : 5;
        صحيح a : 7;
        بنانشان صحيح b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 5
{
    بنية M P __s {
        ڊگهو ڊگهو x : 45;
        ڊگهو ڊگهو : 2;
        ڊگهو ڊگهو y : 30;
        بنانشان ڊگهو ڊگهو z : 38;
        حرف a; ننڍو b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 6
{
    بنية M P __s {
	صحيح a;
	نشانوارو حرف b;
	صحيح x : 12, y : 4, : 0, : 4, z : 3;
	حرف d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 7
{
#جيڪڏهن_وصف_ٿيل _WIN32
    تعريفنوع ڊگهو ڊگهو صحيح ll;
#وإلا
    تعريفنوع ڊگهو صحيح ll;
#جيڪڏهن_پورو
    بنية M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا defined PACK

#إذا PACK
# pragma pack(ڌڪو,1)
# define P //_P
#وإلا
# define P
#جيڪڏهن_پورو

لکو("\n\n" + 2*چوٽي);
#وصف_ڪريو TEST 1
#ضمن SELF
چوٽي = 0;
#وصف_ڪريو TEST 2
#ضمن SELF
#وصف_ڪريو TEST 3
#ضمن SELF
#وصف_ڪريو TEST 4
#ضمن SELF
#وصف_ڪريو TEST 5
#ضمن SELF
#وصف_ڪريو TEST 6
#ضمن SELF
#وصف_ڪريو TEST 7
#ضمن SELF

#إذا PACK
# pragma pack(ڪڍو)
#جيڪڏهن_پورو

#وصف_رد P
#وصف_رد PACK

/* ----------------------------------------------------------------------- */
#وإلاإذا defined ALIGN

#إذا ALIGN
# define A _A(16)
#وإلا
# define A
#جيڪڏهن_پورو

#وصف_ڪريو PACK 0
#ضمن SELF
#وصف_ڪريو PACK 1
#ضمن SELF

#وصف_رد A
#وصف_رد ALIGN

/* ----------------------------------------------------------------------- */
#وإلاإذا defined MS_BF

#إذا MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#وإلا
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#جيڪڏهن_پورو
#جيڪڏهن_وصف_نه_ٿيل M
# define M
#جيڪڏهن_پورو

#وصف_ڪريو ALIGN 0
#ضمن SELF
#وصف_ڪريو ALIGN 1
#ضمن SELF

#وصف_رد M
#وصف_رد MS_BF

/* ----------------------------------------------------------------------- */
#وإلا

#ضمن <stdio.h>
#ضمن <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#وصف_رد __attribute__

فراغ dump(فراغ *p, صحيح s)
{
    صحيح i;
    لكل (i = s; --i >= 0;)
        لکو("%02X", ((بنانشان حرف*)p)[i]);
    لکو("\n");
}

#وصف_ڪريو pv(m) \
    لکو(حجم (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#وصف_ڪريو TEST_STRUCT(v1,v2,v3,v4,v5) { \
        بنية __s _s, *s = & _s; \
        لکو("\n---- TEST %d%s%s%s ----\n" + چوٽي, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        memset(s, 0, حجم *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        لکو("bits in use : "), dump(s, حجم *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        لکو("bits as set : "), dump(s, حجم *s); \
        لکو("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), لکو("\n"); \
        لکو("align/size  : %d %d\n", alignof(بنية __s),حجم(بنية __s)); \
    }

#جيڪڏهن_وصف_ٿيل _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#وإلا
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#جيڪڏهن_پورو

#جيڪڏهن_وصف_نه_ٿيل MS_BITFIELDS
# define MS_BITFIELDS 0
#جيڪڏهن_پورو

#وصف_ڪريو SELF "95_bitfields.c"

صحيح چوٽي = 1;

صحيح مکيه()
{
#وصف_ڪريو MS_BF MS_BITFIELDS
#ضمن SELF
    أرجع 0;
}

/* ----------------------------------------------------------------------- */
#جيڪڏهن_پورو
#وصف_رد TEST
