/* ----------------------------------------------------------------------- */
#إذا TEST == 1
{
    بنية M P A __s
    {
        بیعلامت x : 12;
        بیعلامت حرف y : 7;
        بیعلامت z : 28;
        بیعلامت a: 4;
        بیعلامت b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 2
{
    بنية M P __s
    {
        صحيح x: 12;
        حرف y: 6;
        دراز دراز z:63;
        A حرف a:4;
        دراز دراز b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 3
{
    بنية M P __s
    {
        بیعلامت x:5, y:5, :0, z:5; حرف a:5; A کوتاه b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 4
{
    بنية M P __s {
        صحيح x : 3;
        صحيح : 2;
        صحيح y : 1;
        صحيح : 0;
        صحيح z : 5;
        صحيح a : 7;
        بیعلامت صحيح b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 5
{
    بنية M P __s {
        دراز دراز x : 45;
        دراز دراز : 2;
        دراز دراز y : 30;
        بیعلامت دراز دراز z : 38;
        حرف a; کوتاه b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 6
{
    بنية M P __s {
	صحيح a;
	علامتدار حرف b;
	صحيح x : 12, y : 4, : 0, : 4, z : 3;
	حرف d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا TEST == 7
{
#اگر_تعریف_شده _WIN32
    تعريفنوع دراز دراز صحيح ll;
#وإلا
    تعريفنوع دراز صحيح ll;
#پایان_اگر
    بنية M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#وإلاإذا defined PACK

#إذا PACK
# pragma pack(افزودن,1)
# define P //_P
#وإلا
# define P
#پایان_اگر

چاپ_کن("\n\n" + 2*بالاترین);
#تعریف_کن TEST 1
#ضمن SELF
بالاترین = 0;
#تعریف_کن TEST 2
#ضمن SELF
#تعریف_کن TEST 3
#ضمن SELF
#تعریف_کن TEST 4
#ضمن SELF
#تعریف_کن TEST 5
#ضمن SELF
#تعریف_کن TEST 6
#ضمن SELF
#تعریف_کن TEST 7
#ضمن SELF

#إذا PACK
# pragma pack(برداشت)
#پایان_اگر

#لغو_تعریف P
#لغو_تعریف PACK

/* ----------------------------------------------------------------------- */
#وإلاإذا defined ALIGN

#إذا ALIGN
# define A _A(16)
#وإلا
# define A
#پایان_اگر

#تعریف_کن PACK 0
#ضمن SELF
#تعریف_کن PACK 1
#ضمن SELF

#لغو_تعریف A
#لغو_تعریف ALIGN

/* ----------------------------------------------------------------------- */
#وإلاإذا defined MS_BF

#إذا MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#وإلا
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#پایان_اگر
#اگر_تعریف_نشده M
# define M
#پایان_اگر

#تعریف_کن ALIGN 0
#ضمن SELF
#تعریف_کن ALIGN 1
#ضمن SELF

#لغو_تعریف M
#لغو_تعریف MS_BF

/* ----------------------------------------------------------------------- */
#وإلا

#ضمن <stdio.h>
#ضمن <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#لغو_تعریف __attribute__

فراغ dump(فراغ *p, صحيح s)
{
    صحيح i;
    لكل (i = s; --i >= 0;)
        چاپ_کن("%02X", ((بیعلامت حرف*)p)[i]);
    چاپ_کن("\n");
}

#تعریف_کن pv(m) \
    چاپ_کن(حجم (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#تعریف_کن TEST_STRUCT(v1,v2,v3,v4,v5) { \
        بنية __s _s, *s = & _s; \
        چاپ_کن("\n---- TEST %d%s%s%s ----\n" + بالاترین, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        memset(s, 0, حجم *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        چاپ_کن("bits in use : "), dump(s, حجم *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        چاپ_کن("bits as set : "), dump(s, حجم *s); \
        چاپ_کن("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), چاپ_کن("\n"); \
        چاپ_کن("align/size  : %d %d\n", alignof(بنية __s),حجم(بنية __s)); \
    }

#اگر_تعریف_شده _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#وإلا
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#پایان_اگر

#اگر_تعریف_نشده MS_BITFIELDS
# define MS_BITFIELDS 0
#پایان_اگر

#تعریف_کن SELF "95_bitfields.c"

صحيح بالاترین = 1;

صحيح اصلی()
{
#تعریف_کن MS_BF MS_BITFIELDS
#ضمن SELF
    أرجع 0;
}

/* ----------------------------------------------------------------------- */
#پایان_اگر
#لغو_تعریف TEST
