/* ----------------------------------------------------------------------- */
#यदि TEST == 1
{
    संरचना M P A __s
    {
        अचिह्नित x : 12;
        अचिह्नित वर्ण y : 7;
        अचिह्नित z : 28;
        अचिह्नित a: 4;
        अचिह्नित b: 5;
    };
    TEST_STRUCT(0x333,0x44,0x555555,6,7);
}

/* ----------------------------------------------------------------------- */
#नोचेद्यदि TEST == 2
{
    संरचना M P __s
    {
        पूर्णाङ्क x: 12;
        वर्ण y: 6;
        दीर्घ दीर्घ z:63;
        A वर्ण a:4;
        दीर्घ दीर्घ b:2;

    };
    TEST_STRUCT(3,30,0x123456789abcdef0LL,5,2);
}

/* ----------------------------------------------------------------------- */
#नोचेद्यदि TEST == 3
{
    संरचना M P __s
    {
        अचिह्नित x:5, y:5, :0, z:5; वर्ण a:5; A ह्रस्व b:5;
    };
    TEST_STRUCT(21,23,25,6,14);
}

/* ----------------------------------------------------------------------- */
#नोचेद्यदि TEST == 4
{
    संरचना M P __s {
        पूर्णाङ्क x : 3;
        पूर्णाङ्क : 2;
        पूर्णाङ्क y : 1;
        पूर्णाङ्क : 0;
        पूर्णाङ्क z : 5;
        पूर्णाङ्क a : 7;
        अचिह्नित पूर्णाङ्क b : 7;
    };
    TEST_STRUCT(3,1,15,120,120);
}

/* ----------------------------------------------------------------------- */
#नोचेद्यदि TEST == 5
{
    संरचना M P __s {
        दीर्घ दीर्घ x : 45;
        दीर्घ दीर्घ : 2;
        दीर्घ दीर्घ y : 30;
        अचिह्नित दीर्घ दीर्घ z : 38;
        वर्ण a; ह्रस्व b;
    };
    TEST_STRUCT(0x123456789ULL, 120<<25, 120, 0x44, 0x77);
}

/* ----------------------------------------------------------------------- */
#नोचेद्यदि TEST == 6
{
    संरचना M P __s {
	पूर्णाङ्क a;
	चिह्नित वर्ण b;
	पूर्णाङ्क x : 12, y : 4, : 0, : 4, z : 3;
	वर्ण d;
    };
    TEST_STRUCT(1,2,3,4,-3);
}

/* ----------------------------------------------------------------------- */
#नोचेद्यदि TEST == 7
{
#यदि_परिभाषितम् _WIN32
    प्रकारनिर्देश दीर्घ दीर्घ पूर्णाङ्क ll;
#अन्यथा
    प्रकारनिर्देश दीर्घ पूर्णाङ्क ll;
#यदि_अन्तः
    संरचना M P __s {
        ll d : 16;
        ll b : 16;
        ll x : 16;
        ll y : 1;
        ll z : 2;
        ll a : 11;
        ll e : 1;
        ll f : 1;
    };
    TEST_STRUCT(1,2,3,4,5);
}

/* ----------------------------------------------------------------------- */
#नोचेद्यदि defined PACK

#यदि PACK
# pragma pack(प्रक्षिप,1)
# define P //_P
#अन्यथा
# define P
#यदि_अन्तः

प्रारूप_लिख("\n\n" + 2*शिखरम्);
#परिभाषय TEST 1
#अन्तर्भाव SELF
शिखरम् = 0;
#परिभाषय TEST 2
#अन्तर्भाव SELF
#परिभाषय TEST 3
#अन्तर्भाव SELF
#परिभाषय TEST 4
#अन्तर्भाव SELF
#परिभाषय TEST 5
#अन्तर्भाव SELF
#परिभाषय TEST 6
#अन्तर्भाव SELF
#परिभाषय TEST 7
#अन्तर्भाव SELF

#यदि PACK
# pragma pack(निष्कासय)
#यदि_अन्तः

#अपरिभाषय P
#अपरिभाषय PACK

/* ----------------------------------------------------------------------- */
#नोचेद्यदि defined ALIGN

#यदि ALIGN
# define A _A(16)
#अन्यथा
# define A
#यदि_अन्तः

#परिभाषय PACK 0
#अन्तर्भाव SELF
#परिभाषय PACK 1
#अन्तर्भाव SELF

#अपरिभाषय A
#अपरिभाषय ALIGN

/* ----------------------------------------------------------------------- */
#नोचेद्यदि defined MS_BF

#यदि MS_BF
# ifdef __TINYC__
#  pragma comment(option, "-mms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((ms_struct))
# endif
#अन्यथा
# ifdef __TINYC__
#  pragma comment(option, "-mno-ms-bitfields")
# elif defined __GNUC__
#  define M __attribute__((gcc_struct))
# endif
#यदि_अन्तः
#यदि_अपरिभाषितम् M
# define M
#यदि_अन्तः

#परिभाषय ALIGN 0
#अन्तर्भाव SELF
#परिभाषय ALIGN 1
#अन्तर्भाव SELF

#अपरिभाषय M
#अपरिभाषय MS_BF

/* ----------------------------------------------------------------------- */
#अन्यथा

#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>
/* some gcc headers #define __attribute__ to empty if it's not gcc */
#अपरिभाषय __attribute__

शून्य dump(शून्य *p, पूर्णाङ्क s)
{
    पूर्णाङ्क i;
    प्रति (i = s; --i >= 0;)
        प्रारूप_लिख("%02X", ((अचिह्नित वर्ण*)p)[i]);
    प्रारूप_लिख("\n");
}

#परिभाषय pv(m) \
    प्रारूप_लिख(परिमाण (s->m + 0) == 8 ? " %016llx" : " %02x", s->m)

#परिभाषय TEST_STRUCT(v1,v2,v3,v4,v5) { \
        संरचना __s _s, *s = & _s; \
        प्रारूप_लिख("\n---- TEST %d%s%s%s ----\n" + शिखरम्, \
            TEST, MS_BF?" - MS-BITFIELDS":"", \
            PACK?" - PACKED":"", \
            ALIGN?" - WITH ALIGN":""); \
        स्मृतिं_पूरय(s, 0, परिमाण *s); \
        s->x = -1, s->y = -1, s->z = -1, s->a = -1, s->b = -1; \
        प्रारूप_लिख("bits in use : "), dump(s, परिमाण *s); \
        s->x = v1, s->y = v2, s->z = v3, s->a += v4, ++s->a, s->b = v5; \
        प्रारूप_लिख("bits as set : "), dump(s, परिमाण *s); \
        प्रारूप_लिख("values      :"), pv(x), pv(y), pv(z), pv(a), pv(b), प्रारूप_लिख("\n"); \
        प्रारूप_लिख("align/size  : %d %d\n", alignof(संरचना __s),परिमाण(संरचना __s)); \
    }

#यदि_परिभाषितम् _MSC_VER
# define _A(n) __declspec(align(n))
# define _P
# define alignof(x) __alignof(x)
#अन्यथा
# define _A(n) __attribute__((aligned(n)))
# define _P __attribute__((packed))
# define alignof(x) __alignof__(x)
#यदि_अन्तः

#यदि_अपरिभाषितम् MS_BITFIELDS
# define MS_BITFIELDS 0
#यदि_अन्तः

#परिभाषय SELF "95_bitfields.c"

पूर्णाङ्क शिखरम् = 1;

पूर्णाङ्क मुख्यम्()
{
#परिभाषय MS_BF MS_BITFIELDS
#अन्तर्भाव SELF
    प्रत्यागम 0;
}

/* ----------------------------------------------------------------------- */
#यदि_अन्तः
#अपरिभाषय TEST
