#ضمن <stdio.h>
#ضمن <stdlib.h>
asm (
    ".text;"
    ".globl _us;.globl _ss;.globl _uc;.globl _sc;"
    "_us:;_ss:;_uc:;_sc:;"
    "movl $0x1234ABCD, %eax;"
	"ret;"
);

#اگر_تعریف_نشده __leading_underscore
#تعریف_کن us _us
#تعریف_کن ss _ss
#تعریف_کن uc _uc
#تعریف_کن sc _sc
#پایان_اگر

صحيح اصلی()
{
    بیعلامت کوتاه us(فراغ);
    کوتاه ss(فراغ);
    بیعلامت حرف uc(فراغ);
    علامتدار حرف sc(فراغ);

    بیعلامت کوتاه (*fpus)(فراغ) = us;
    کوتاه (*fpss)(فراغ) = ss;
    بیعلامت حرف (*fpuc)(فراغ) = uc;
    علامتدار حرف (*fpsc)(فراغ) = sc;

    چاپ_کن("%08X %08X\n", us() + 1, fpus() + 1);
    چاپ_کن("%08X %08X\n", ss() + 1, fpss() + 1);
    چاپ_کن("%08X %08X\n", uc() + 1, fpuc() + 1);
    چاپ_کن("%08X %08X\n", sc() + 1, fpsc() + 1);
    چاپ_کن("\n");
    چاپ_کن("%08X %08X\n", fpus() + 1, us() + 1);
    چاپ_کن("%08X %08X\n", fpss() + 1, ss() + 1);
    چاپ_کن("%08X %08X\n", fpuc() + 1, uc() + 1);
    چاپ_کن("%08X %08X\n", fpsc() + 1, sc() + 1);

    أرجع 0;
}
