#समावेश <stdio.h>
#समावेश <stdlib.h>
यंत्र (
    ".text;"
    ".globl _us;.globl _ss;.globl _uc;.globl _sc;"
    "_us:;_ss:;_uc:;_sc:;"
    "movl $0x1234ABCD, %eax;"
	"ret;"
);

#अगर_अघोषित __leading_underscore
#घोषणा us _us
#घोषणा ss _ss
#घोषणा uc _uc
#घोषणा sc _sc
#पूर्ण_अगर

पूर्णांक मुख्य()
{
    अचिन्हित लघु us(व्योम);
    लघु ss(व्योम);
    अचिन्हित अक्षर uc(व्योम);
    चिन्हित अक्षर sc(व्योम);

    अचिन्हित लघु (*fpus)(व्योम) = us;
    लघु (*fpss)(व्योम) = ss;
    अचिन्हित अक्षर (*fpuc)(व्योम) = uc;
    चिन्हित अक्षर (*fpsc)(व्योम) = sc;

    म_लिखो("%08X %08X\n", us() + 1, fpus() + 1);
    म_लिखो("%08X %08X\n", ss() + 1, fpss() + 1);
    म_लिखो("%08X %08X\n", uc() + 1, fpuc() + 1);
    म_लिखो("%08X %08X\n", sc() + 1, fpsc() + 1);
    म_लिखो("\n");
    म_लिखो("%08X %08X\n", fpus() + 1, us() + 1);
    म_लिखो("%08X %08X\n", fpss() + 1, ss() + 1);
    म_लिखो("%08X %08X\n", fpuc() + 1, uc() + 1);
    म_लिखो("%08X %08X\n", fpsc() + 1, sc() + 1);

    वापस 0;
}
