#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <stdlib.h>
asm (
    ".text;"
    ".globl _us;.globl _ss;.globl _uc;.globl _sc;"
    "_us:;_ss:;_uc:;_sc:;"
    "movl $0x1234ABCD, %eax;"
	"ret;"
);

#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ __leading_underscore
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ us _us
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ ss _ss
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ uc _uc
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ sc _sc
#ਜੇ_ਅੰਤ

ਪੂਰਨ ਮੁੱਖ()
{
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਛੋਟਾ us(ਖਾਲੀ);
    ਛੋਟਾ ss(ਖਾਲੀ);
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ uc(ਖਾਲੀ);
    ਨਿਸ਼ਾਨੀਵਾਲਾ ਅੱਖਰ sc(ਖਾਲੀ);

    ਬਿਨਾਨਿਸ਼ਾਨੀ ਛੋਟਾ (*fpus)(ਖਾਲੀ) = us;
    ਛੋਟਾ (*fpss)(ਖਾਲੀ) = ss;
    ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ (*fpuc)(ਖਾਲੀ) = uc;
    ਨਿਸ਼ਾਨੀਵਾਲਾ ਅੱਖਰ (*fpsc)(ਖਾਲੀ) = sc;

    ਲਿਖੋ("%08X %08X\n", us() + 1, fpus() + 1);
    ਲਿਖੋ("%08X %08X\n", ss() + 1, fpss() + 1);
    ਲਿਖੋ("%08X %08X\n", uc() + 1, fpuc() + 1);
    ਲਿਖੋ("%08X %08X\n", sc() + 1, fpsc() + 1);
    ਲਿਖੋ("\n");
    ਲਿਖੋ("%08X %08X\n", fpus() + 1, us() + 1);
    ਲਿਖੋ("%08X %08X\n", fpss() + 1, ss() + 1);
    ਲਿਖੋ("%08X %08X\n", fpuc() + 1, uc() + 1);
    ਲਿਖੋ("%08X %08X\n", fpsc() + 1, sc() + 1);

    ਵਾਪਸ 0;
}
