#ضمن <stdio.h>
#ضمن <stdlib.h>
asm (
    ".text;"
    ".globl _us;.globl _ss;.globl _uc;.globl _sc;"
    "_us:;_ss:;_uc:;_sc:;"
    "movl $0x1234ABCD, %eax;"
	"ret;"
);

#که_نه_تعریف_شوی __leading_underscore
#تعریف_کړه us _us
#تعریف_کړه ss _ss
#تعریف_کړه uc _uc
#تعریف_کړه sc _sc
#د_که_پای

صحيح اصلي()
{
    بینښه لنډ us(فراغ);
    لنډ ss(فراغ);
    بینښه حرف uc(فراغ);
    نښهدار حرف sc(فراغ);

    بینښه لنډ (*fpus)(فراغ) = us;
    لنډ (*fpss)(فراغ) = ss;
    بینښه حرف (*fpuc)(فراغ) = uc;
    نښهدار حرف (*fpsc)(فراغ) = sc;

    چاپ_کړه("%08X %08X\n", us() + 1, fpus() + 1);
    چاپ_کړه("%08X %08X\n", ss() + 1, fpss() + 1);
    چاپ_کړه("%08X %08X\n", uc() + 1, fpuc() + 1);
    چاپ_کړه("%08X %08X\n", sc() + 1, fpsc() + 1);
    چاپ_کړه("\n");
    چاپ_کړه("%08X %08X\n", fpus() + 1, us() + 1);
    چاپ_کړه("%08X %08X\n", fpss() + 1, ss() + 1);
    چاپ_کړه("%08X %08X\n", fpuc() + 1, uc() + 1);
    چاپ_کړه("%08X %08X\n", fpsc() + 1, sc() + 1);

    أرجع 0;
}
