#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <stdlib.h>
asm (
    ".text;"
    ".globl _us;.globl _ss;.globl _uc;.globl _sc;"
    "_us:;_ss:;_uc:;_sc:;"
    "movl $0x1234ABCD, %eax;"
	"ret;"
);

#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ __leading_underscore
#ವ್ಯಾಖ್ಯಾನಿಸು us _us
#ವ್ಯಾಖ್ಯಾನಿಸು ss _ss
#ವ್ಯಾಖ್ಯಾನಿಸು uc _uc
#ವ್ಯಾಖ್ಯಾನಿಸು sc _sc
#ಆದರೆ_ಅಂತ್ಯ

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ()
{
    ಚಿಹ್ನೆರಹಿತ ಗಿಡ್ಡ us(ಶೂನ್ಯ);
    ಗಿಡ್ಡ ss(ಶೂನ್ಯ);
    ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ uc(ಶೂನ್ಯ);
    ಚಿಹ್ನೆಯುಳ್ಳ ಅಕ್ಷರ sc(ಶೂನ್ಯ);

    ಚಿಹ್ನೆರಹಿತ ಗಿಡ್ಡ (*fpus)(ಶೂನ್ಯ) = us;
    ಗಿಡ್ಡ (*fpss)(ಶೂನ್ಯ) = ss;
    ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ (*fpuc)(ಶೂನ್ಯ) = uc;
    ಚಿಹ್ನೆಯುಳ್ಳ ಅಕ್ಷರ (*fpsc)(ಶೂನ್ಯ) = sc;

    ಬರೆ("%08X %08X\n", us() + 1, fpus() + 1);
    ಬರೆ("%08X %08X\n", ss() + 1, fpss() + 1);
    ಬರೆ("%08X %08X\n", uc() + 1, fpuc() + 1);
    ಬರೆ("%08X %08X\n", sc() + 1, fpsc() + 1);
    ಬರೆ("\n");
    ಬರೆ("%08X %08X\n", fpus() + 1, us() + 1);
    ಬರೆ("%08X %08X\n", fpss() + 1, ss() + 1);
    ಬರೆ("%08X %08X\n", fpuc() + 1, uc() + 1);
    ಬರೆ("%08X %08X\n", fpsc() + 1, sc() + 1);

    ಹಿಂತಿರುಗಿ 0;
}
