#ضمن <stdio.h>
#ضمن <stdlib.h>
asm (
    ".text;"
    ".globl _us;.globl _ss;.globl _uc;.globl _sc;"
    "_us:;_ss:;_uc:;_sc:;"
    "movl $0x1234ABCD, %eax;"
	"ret;"
);

#جيڪڏهن_وصف_نه_ٿيل __leading_underscore
#وصف_ڪريو us _us
#وصف_ڪريو ss _ss
#وصف_ڪريو uc _uc
#وصف_ڪريو sc _sc
#جيڪڏهن_پورو

صحيح مکيه()
{
    بنانشان ننڍو us(فراغ);
    ننڍو ss(فراغ);
    بنانشان حرف uc(فراغ);
    نشانوارو حرف sc(فراغ);

    بنانشان ننڍو (*fpus)(فراغ) = us;
    ننڍو (*fpss)(فراغ) = ss;
    بنانشان حرف (*fpuc)(فراغ) = uc;
    نشانوارو حرف (*fpsc)(فراغ) = sc;

    لکو("%08X %08X\n", us() + 1, fpus() + 1);
    لکو("%08X %08X\n", ss() + 1, fpss() + 1);
    لکو("%08X %08X\n", uc() + 1, fpuc() + 1);
    لکو("%08X %08X\n", sc() + 1, fpsc() + 1);
    لکو("\n");
    لکو("%08X %08X\n", fpus() + 1, us() + 1);
    لکو("%08X %08X\n", fpss() + 1, ss() + 1);
    لکو("%08X %08X\n", fpuc() + 1, uc() + 1);
    لکو("%08X %08X\n", fpsc() + 1, sc() + 1);

    أرجع 0;
}
