#شامل <stdio.h>
#شامل <stdlib.h>
asm (
    ".text;"
    ".globl _us;.globl _ss;.globl _uc;.globl _sc;"
    "_us:;_ss:;_uc:;_sc:;"
    "movl $0x1234ABCD, %eax;"
	"ret;"
);

#اگر_غیر_تعریف_شدہ __leading_underscore
#تعریف_کرو us _us
#تعریف_کرو ss _ss
#تعریف_کرو uc _uc
#تعریف_کرو sc _sc
#اگر_ختم

صحیح مین()
{
    غیرعلامتی مختصر us(خالی);
    مختصر ss(خالی);
    غیرعلامتی حرف uc(خالی);
    علامتی حرف sc(خالی);

    غیرعلامتی مختصر (*fpus)(خالی) = us;
    مختصر (*fpss)(خالی) = ss;
    غیرعلامتی حرف (*fpuc)(خالی) = uc;
    علامتی حرف (*fpsc)(خالی) = sc;

    لکھو("%08X %08X\n", us() + 1, fpus() + 1);
    لکھو("%08X %08X\n", ss() + 1, fpss() + 1);
    لکھو("%08X %08X\n", uc() + 1, fpuc() + 1);
    لکھو("%08X %08X\n", sc() + 1, fpsc() + 1);
    لکھو("\n");
    لکھو("%08X %08X\n", fpus() + 1, us() + 1);
    لکھو("%08X %08X\n", fpss() + 1, ss() + 1);
    لکھو("%08X %08X\n", fpuc() + 1, uc() + 1);
    لکھو("%08X %08X\n", fpsc() + 1, sc() + 1);

    واپس 0;
}
