#ಅನ್ತರ್ಭಾವ <stdlib.h>
#ಅನ್ತರ್ಭಾವ <stdio.h>

#ವ್ಯಾಖ್ಯಾನಿಸು N 20

ಪೂರ್ಣಾಂಕ nb_ಅಂಕೆ;
ಪೂರ್ಣಾಂಕ tab[N];
ಪೂರ್ಣಾಂಕ ರಾಶಿ_ptr;
ಪೂರ್ಣಾಂಕ ರಾಶಿ_op[N];
ಪೂರ್ಣಾಂಕ ರಾಶಿ_res[60];
ಪೂರ್ಣಾಂಕ ಫಲಿತಾಂಶ;

ಪೂರ್ಣಾಂಕ ಕಂಡುಹಿಡಿ(ಪೂರ್ಣಾಂಕ n, ಪೂರ್ಣಾಂಕ i1, ಪೂರ್ಣಾಂಕ a, ಪೂರ್ಣಾಂಕ b, ಪೂರ್ಣಾಂಕ op)
{
    ಪೂರ್ಣಾಂಕ i, j;
    ಪೂರ್ಣಾಂಕ c;

    ಆದರೆ (ರಾಶಿ_ptr >= 0) {
        ರಾಶಿ_res[3*ರಾಶಿ_ptr] = a;
        ರಾಶಿ_op[ರಾಶಿ_ptr] = op;
        ರಾಶಿ_res[3*ರಾಶಿ_ptr+1] = b;
        ರಾಶಿ_res[3*ರಾಶಿ_ptr+2] = n;
        ಆದರೆ (n == ಫಲಿತಾಂಶ)
            ಹಿಂತಿರುಗಿ 1;
        tab[i1] = n;
    }

    ಗಾಗಿ(i=0;i<nb_ಅಂಕೆ;i++) {
        ಗಾಗಿ(j=i+1;j<nb_ಅಂಕೆ;j++) {
            a = tab[i];
            b = tab[j];
            ಆದರೆ (a != 0 && b != 0) {

                tab[j] = 0;
                ರಾಶಿ_ptr++;

                ಆದರೆ (ಕಂಡುಹಿಡಿ(a + b, i, a, b, '+'))
                    ಹಿಂತಿರುಗಿ 1;
                ಆದರೆ (ಕಂಡುಹಿಡಿ(a - b, i, a, b, '-'))
                    ಹಿಂತಿರುಗಿ 1;
                ಆದರೆ (ಕಂಡುಹಿಡಿ(b - a, i, b, a, '-'))
                    ಹಿಂತಿರುಗಿ 1;
                ಆದರೆ (ಕಂಡುಹಿಡಿ(a * b, i, a, b, '*'))
                    ಹಿಂತಿರುಗಿ 1;
                ಆದರೆ (b != 0) {
                    c = a / b;
                    ಆದರೆ (ಕಂಡುಹಿಡಿ(c, i, a, b, '/'))
                        ಹಿಂತಿರುಗಿ 1;
                }

                ಆದರೆ (a != 0) {
                    c = b / a;
                    ಆದರೆ (ಕಂಡುಹಿಡಿ(c, i, b, a, '/'))
                        ಹಿಂತಿರುಗಿ 1;
                }

                ರಾಶಿ_ptr--;
                tab[i] = a;
                tab[j] = b;
            }
        }
    }

    ಹಿಂತಿರುಗಿ 0;
}

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv)
{
    ಪೂರ್ಣಾಂಕ i, res, p;

    ಆದರೆ (argc < 3) {
        ಬರೆ("usage: %s: result numbers...\n"
               "Try to find result from numbers with the 4 basic operations.\n", argv[0]);
        ನಿರ್ಗಮಿಸು(1);
    }

    p = 1;
    ಫಲಿತಾಂಶ = atoi(argv[p]);
    ಬರೆ("result=%d\n", ಫಲಿತಾಂಶ);
    nb_ಅಂಕೆ = 0;
    ಗಾಗಿ(i=p+1;i<argc;i++) {
        tab[nb_ಅಂಕೆ++] = atoi(argv[i]);
    }

    ರಾಶಿ_ptr = -1;
    res = ಕಂಡುಹಿಡಿ(0, 0, 0, 0, ' ');
    ಆದರೆ (res) {
        ಗಾಗಿ(i=0;i<=ರಾಶಿ_ptr;i++) {
            ಬರೆ("%d %c %d = %d\n",
                   ರಾಶಿ_res[3*i], ರಾಶಿ_op[i],
                   ರಾಶಿ_res[3*i+1], ರಾಶಿ_res[3*i+2]);
        }
        ಹಿಂತಿರುಗಿ 0;
    } ಇಲ್ಲದಿದ್ದರೆ {
        ಬರೆ("Impossible\n");
        ಹಿಂತಿರುಗಿ 1;
    }
}
