#ਅਨ੍ਤਰ੍ਭਾਵ <stdlib.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>

#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ N 20

ਪੂਰਨ nb_ਅੰਕ;
ਪੂਰਨ tab[N];
ਪੂਰਨ ਢੇਰ_ptr;
ਪੂਰਨ ਢੇਰ_op[N];
ਪੂਰਨ ਢੇਰ_res[60];
ਪੂਰਨ ਨਤੀਜਾ;

ਪੂਰਨ ਲੱਭੋ(ਪੂਰਨ n, ਪੂਰਨ i1, ਪੂਰਨ a, ਪੂਰਨ b, ਪੂਰਨ op)
{
    ਪੂਰਨ i, j;
    ਪੂਰਨ c;

    ਜੇ (ਢੇਰ_ptr >= 0) {
        ਢੇਰ_res[3*ਢੇਰ_ptr] = a;
        ਢੇਰ_op[ਢੇਰ_ptr] = op;
        ਢੇਰ_res[3*ਢੇਰ_ptr+1] = b;
        ਢੇਰ_res[3*ਢੇਰ_ptr+2] = n;
        ਜੇ (n == ਨਤੀਜਾ)
            ਵਾਪਸ 1;
        tab[i1] = n;
    }

    ਲਈ(i=0;i<nb_ਅੰਕ;i++) {
        ਲਈ(j=i+1;j<nb_ਅੰਕ;j++) {
            a = tab[i];
            b = tab[j];
            ਜੇ (a != 0 && b != 0) {

                tab[j] = 0;
                ਢੇਰ_ptr++;

                ਜੇ (ਲੱਭੋ(a + b, i, a, b, '+'))
                    ਵਾਪਸ 1;
                ਜੇ (ਲੱਭੋ(a - b, i, a, b, '-'))
                    ਵਾਪਸ 1;
                ਜੇ (ਲੱਭੋ(b - a, i, b, a, '-'))
                    ਵਾਪਸ 1;
                ਜੇ (ਲੱਭੋ(a * b, i, a, b, '*'))
                    ਵਾਪਸ 1;
                ਜੇ (b != 0) {
                    c = a / b;
                    ਜੇ (ਲੱਭੋ(c, i, a, b, '/'))
                        ਵਾਪਸ 1;
                }

                ਜੇ (a != 0) {
                    c = b / a;
                    ਜੇ (ਲੱਭੋ(c, i, b, a, '/'))
                        ਵਾਪਸ 1;
                }

                ਢੇਰ_ptr--;
                tab[i] = a;
                tab[j] = b;
            }
        }
    }

    ਵਾਪਸ 0;
}

ਪੂਰਨ ਮੁੱਖ(ਪੂਰਨ argc, ਅੱਖਰ **argv)
{
    ਪੂਰਨ i, res, p;

    ਜੇ (argc < 3) {
        ਲਿਖੋ("usage: %s: result numbers...\n"
               "Try to find result from numbers with the 4 basic operations.\n", argv[0]);
        ਬਾਹਰ_ਨਿਕਲੋ(1);
    }

    p = 1;
    ਨਤੀਜਾ = atoi(argv[p]);
    ਲਿਖੋ("result=%d\n", ਨਤੀਜਾ);
    nb_ਅੰਕ = 0;
    ਲਈ(i=p+1;i<argc;i++) {
        tab[nb_ਅੰਕ++] = atoi(argv[i]);
    }

    ਢੇਰ_ptr = -1;
    res = ਲੱਭੋ(0, 0, 0, 0, ' ');
    ਜੇ (res) {
        ਲਈ(i=0;i<=ਢੇਰ_ptr;i++) {
            ਲਿਖੋ("%d %c %d = %d\n",
                   ਢੇਰ_res[3*i], ਢੇਰ_op[i],
                   ਢੇਰ_res[3*i+1], ਢੇਰ_res[3*i+2]);
        }
        ਵਾਪਸ 0;
    } ਨਹੀਂਤਾਂ {
        ਲਿਖੋ("Impossible\n");
        ਵਾਪਸ 1;
    }
}
