#ضمن <stdlib.h>
#ضمن <stdio.h>

#وصف_ڪريو N 20

صحيح nb_انگ;
صحيح tab[N];
صحيح ڍير_ptr;
صحيح ڍير_op[N];
صحيح ڍير_res[60];
صحيح نتيجو;

صحيح ڳوليو(صحيح n, صحيح i1, صحيح a, صحيح b, صحيح op)
{
    صحيح i, j;
    صحيح c;

    إذا (ڍير_ptr >= 0) {
        ڍير_res[3*ڍير_ptr] = a;
        ڍير_op[ڍير_ptr] = op;
        ڍير_res[3*ڍير_ptr+1] = b;
        ڍير_res[3*ڍير_ptr+2] = n;
        إذا (n == نتيجو)
            أرجع 1;
        tab[i1] = n;
    }

    لكل(i=0;i<nb_انگ;i++) {
        لكل(j=i+1;j<nb_انگ;j++) {
            a = tab[i];
            b = tab[j];
            إذا (a != 0 && b != 0) {

                tab[j] = 0;
                ڍير_ptr++;

                إذا (ڳوليو(a + b, i, a, b, '+'))
                    أرجع 1;
                إذا (ڳوليو(a - b, i, a, b, '-'))
                    أرجع 1;
                إذا (ڳوليو(b - a, i, b, a, '-'))
                    أرجع 1;
                إذا (ڳوليو(a * b, i, a, b, '*'))
                    أرجع 1;
                إذا (b != 0) {
                    c = a / b;
                    إذا (ڳوليو(c, i, a, b, '/'))
                        أرجع 1;
                }

                إذا (a != 0) {
                    c = b / a;
                    إذا (ڳوليو(c, i, b, a, '/'))
                        أرجع 1;
                }

                ڍير_ptr--;
                tab[i] = a;
                tab[j] = b;
            }
        }
    }

    أرجع 0;
}

صحيح مکيه(صحيح argc, حرف **argv)
{
    صحيح i, res, p;

    إذا (argc < 3) {
        لکو("usage: %s: result numbers...\n"
               "Try to find result from numbers with the 4 basic operations.\n", argv[0]);
        ٻاهر_نڪرو(1);
    }

    p = 1;
    نتيجو = atoi(argv[p]);
    لکو("result=%d\n", نتيجو);
    nb_انگ = 0;
    لكل(i=p+1;i<argc;i++) {
        tab[nb_انگ++] = atoi(argv[i]);
    }

    ڍير_ptr = -1;
    res = ڳوليو(0, 0, 0, 0, ' ');
    إذا (res) {
        لكل(i=0;i<=ڍير_ptr;i++) {
            لکو("%d %c %d = %d\n",
                   ڍير_res[3*i], ڍير_op[i],
                   ڍير_res[3*i+1], ڍير_res[3*i+2]);
        }
        أرجع 0;
    } وإلا {
        لکو("Impossible\n");
        أرجع 1;
    }
}
