#ضمن <stdlib.h>
#ضمن <stdio.h>

#تعریف_کړه N 20

صحيح nb_عدد;
صحيح tab[N];
صحيح ډېری_ptr;
صحيح ډېری_op[N];
صحيح ډېری_res[60];
صحيح پایله;

صحيح پیدا_کړه(صحيح n, صحيح i1, صحيح a, صحيح b, صحيح op)
{
    صحيح i, j;
    صحيح c;

    إذا (ډېری_ptr >= 0) {
        ډېری_res[3*ډېری_ptr] = a;
        ډېری_op[ډېری_ptr] = op;
        ډېری_res[3*ډېری_ptr+1] = b;
        ډېری_res[3*ډېری_ptr+2] = n;
        إذا (n == پایله)
            أرجع 1;
        tab[i1] = n;
    }

    لكل(i=0;i<nb_عدد;i++) {
        لكل(j=i+1;j<nb_عدد;j++) {
            a = tab[i];
            b = tab[j];
            إذا (a != 0 && b != 0) {

                tab[j] = 0;
                ډېری_ptr++;

                إذا (پیدا_کړه(a + b, i, a, b, '+'))
                    أرجع 1;
                إذا (پیدا_کړه(a - b, i, a, b, '-'))
                    أرجع 1;
                إذا (پیدا_کړه(b - a, i, b, a, '-'))
                    أرجع 1;
                إذا (پیدا_کړه(a * b, i, a, b, '*'))
                    أرجع 1;
                إذا (b != 0) {
                    c = a / b;
                    إذا (پیدا_کړه(c, i, a, b, '/'))
                        أرجع 1;
                }

                إذا (a != 0) {
                    c = b / a;
                    إذا (پیدا_کړه(c, i, b, a, '/'))
                        أرجع 1;
                }

                ډېری_ptr--;
                tab[i] = a;
                tab[j] = b;
            }
        }
    }

    أرجع 0;
}

صحيح اصلي(صحيح argc, حرف **argv)
{
    صحيح i, res, p;

    إذا (argc < 3) {
        چاپ_کړه("usage: %s: result numbers...\n"
               "Try to find result from numbers with the 4 basic operations.\n", argv[0]);
        وتل(1);
    }

    p = 1;
    پایله = atoi(argv[p]);
    چاپ_کړه("result=%d\n", پایله);
    nb_عدد = 0;
    لكل(i=p+1;i<argc;i++) {
        tab[nb_عدد++] = atoi(argv[i]);
    }

    ډېری_ptr = -1;
    res = پیدا_کړه(0, 0, 0, 0, ' ');
    إذا (res) {
        لكل(i=0;i<=ډېری_ptr;i++) {
            چاپ_کړه("%d %c %d = %d\n",
                   ډېری_res[3*i], ډېری_op[i],
                   ډېری_res[3*i+1], ډېری_res[3*i+2]);
        }
        أرجع 0;
    } وإلا {
        چاپ_کړه("Impossible\n");
        أرجع 1;
    }
}
