#అన్తర్భావ <stdlib.h>
#అన్తర్భావ <stdio.h>

#నిర్వచించు N 20

పూర్ణాంకం nb_అంకె;
పూర్ణాంకం tab[N];
పూర్ణాంకం దొంతర_ptr;
పూర్ణాంకం దొంతర_op[N];
పూర్ణాంకం దొంతర_res[60];
పూర్ణాంకం ఫలితం;

పూర్ణాంకం కనుగొను(పూర్ణాంకం n, పూర్ణాంకం i1, పూర్ణాంకం a, పూర్ణాంకం b, పూర్ణాంకం op)
{
    పూర్ణాంకం i, j;
    పూర్ణాంకం c;

    ఒకవేళ (దొంతర_ptr >= 0) {
        దొంతర_res[3*దొంతర_ptr] = a;
        దొంతర_op[దొంతర_ptr] = op;
        దొంతర_res[3*దొంతర_ptr+1] = b;
        దొంతర_res[3*దొంతర_ptr+2] = n;
        ఒకవేళ (n == ఫలితం)
            తిరిగి 1;
        tab[i1] = n;
    }

    కొరకు(i=0;i<nb_అంకె;i++) {
        కొరకు(j=i+1;j<nb_అంకె;j++) {
            a = tab[i];
            b = tab[j];
            ఒకవేళ (a != 0 && b != 0) {

                tab[j] = 0;
                దొంతర_ptr++;

                ఒకవేళ (కనుగొను(a + b, i, a, b, '+'))
                    తిరిగి 1;
                ఒకవేళ (కనుగొను(a - b, i, a, b, '-'))
                    తిరిగి 1;
                ఒకవేళ (కనుగొను(b - a, i, b, a, '-'))
                    తిరిగి 1;
                ఒకవేళ (కనుగొను(a * b, i, a, b, '*'))
                    తిరిగి 1;
                ఒకవేళ (b != 0) {
                    c = a / b;
                    ఒకవేళ (కనుగొను(c, i, a, b, '/'))
                        తిరిగి 1;
                }

                ఒకవేళ (a != 0) {
                    c = b / a;
                    ఒకవేళ (కనుగొను(c, i, b, a, '/'))
                        తిరిగి 1;
                }

                దొంతర_ptr--;
                tab[i] = a;
                tab[j] = b;
            }
        }
    }

    తిరిగి 0;
}

పూర్ణాంకం ప్రధాన(పూర్ణాంకం argc, అక్షరం **argv)
{
    పూర్ణాంకం i, res, p;

    ఒకవేళ (argc < 3) {
        రాయి("usage: %s: result numbers...\n"
               "Try to find result from numbers with the 4 basic operations.\n", argv[0]);
        నిష్క్రమించు(1);
    }

    p = 1;
    ఫలితం = atoi(argv[p]);
    రాయి("result=%d\n", ఫలితం);
    nb_అంకె = 0;
    కొరకు(i=p+1;i<argc;i++) {
        tab[nb_అంకె++] = atoi(argv[i]);
    }

    దొంతర_ptr = -1;
    res = కనుగొను(0, 0, 0, 0, ' ');
    ఒకవేళ (res) {
        కొరకు(i=0;i<=దొంతర_ptr;i++) {
            రాయి("%d %c %d = %d\n",
                   దొంతర_res[3*i], దొంతర_op[i],
                   దొంతర_res[3*i+1], దొంతర_res[3*i+2]);
        }
        తిరిగి 0;
    } లేకపోతే {
        రాయి("Impossible\n");
        తిరిగి 1;
    }
}
