#ضمن <stdlib.h>
#ضمن <stdio.h>

#تعریف_کن N 20

صحيح nb_رقم;
صحيح tab[N];
صحيح پشته_ptr;
صحيح پشته_op[N];
صحيح پشته_res[60];
صحيح نتیجه;

صحيح پیدا_کن(صحيح n, صحيح i1, صحيح a, صحيح b, صحيح op)
{
    صحيح i, j;
    صحيح c;

    إذا (پشته_ptr >= 0) {
        پشته_res[3*پشته_ptr] = a;
        پشته_op[پشته_ptr] = op;
        پشته_res[3*پشته_ptr+1] = b;
        پشته_res[3*پشته_ptr+2] = n;
        إذا (n == نتیجه)
            أرجع 1;
        tab[i1] = n;
    }

    لكل(i=0;i<nb_رقم;i++) {
        لكل(j=i+1;j<nb_رقم;j++) {
            a = tab[i];
            b = tab[j];
            إذا (a != 0 && b != 0) {

                tab[j] = 0;
                پشته_ptr++;

                إذا (پیدا_کن(a + b, i, a, b, '+'))
                    أرجع 1;
                إذا (پیدا_کن(a - b, i, a, b, '-'))
                    أرجع 1;
                إذا (پیدا_کن(b - a, i, b, a, '-'))
                    أرجع 1;
                إذا (پیدا_کن(a * b, i, a, b, '*'))
                    أرجع 1;
                إذا (b != 0) {
                    c = a / b;
                    إذا (پیدا_کن(c, i, a, b, '/'))
                        أرجع 1;
                }

                إذا (a != 0) {
                    c = b / a;
                    إذا (پیدا_کن(c, i, b, a, '/'))
                        أرجع 1;
                }

                پشته_ptr--;
                tab[i] = a;
                tab[j] = b;
            }
        }
    }

    أرجع 0;
}

صحيح اصلی(صحيح argc, حرف **argv)
{
    صحيح i, res, p;

    إذا (argc < 3) {
        چاپ_کن("usage: %s: result numbers...\n"
               "Try to find result from numbers with the 4 basic operations.\n", argv[0]);
        خروج(1);
    }

    p = 1;
    نتیجه = atoi(argv[p]);
    چاپ_کن("result=%d\n", نتیجه);
    nb_رقم = 0;
    لكل(i=p+1;i<argc;i++) {
        tab[nb_رقم++] = atoi(argv[i]);
    }

    پشته_ptr = -1;
    res = پیدا_کن(0, 0, 0, 0, ' ');
    إذا (res) {
        لكل(i=0;i<=پشته_ptr;i++) {
            چاپ_کن("%d %c %d = %d\n",
                   پشته_res[3*i], پشته_op[i],
                   پشته_res[3*i+1], پشته_res[3*i+2]);
        }
        أرجع 0;
    } وإلا {
        چاپ_کن("Impossible\n");
        أرجع 1;
    }
}
