#समावेश <stdlib.h>
#समावेश <stdio.h>

#घोषणा N 20

पूर्णांक nb_अंक;
पूर्णांक tab[N];
पूर्णांक ढेर_ptr;
पूर्णांक ढेर_op[N];
पूर्णांक ढेर_res[60];
पूर्णांक परिणाम;

पूर्णांक find(पूर्णांक n, पूर्णांक i1, पूर्णांक a, पूर्णांक b, पूर्णांक op)
{
    पूर्णांक i, j;
    पूर्णांक c;

    अगर (ढेर_ptr >= 0) {
        ढेर_res[3*ढेर_ptr] = a;
        ढेर_op[ढेर_ptr] = op;
        ढेर_res[3*ढेर_ptr+1] = b;
        ढेर_res[3*ढेर_ptr+2] = n;
        अगर (n == परिणाम)
            वापस 1;
        tab[i1] = n;
    }

    क्रम(i=0;i<nb_अंक;i++) {
        क्रम(j=i+1;j<nb_अंक;j++) {
            a = tab[i];
            b = tab[j];
            अगर (a != 0 && b != 0) {

                tab[j] = 0;
                ढेर_ptr++;

                अगर (find(a + b, i, a, b, '+'))
                    वापस 1;
                अगर (find(a - b, i, a, b, '-'))
                    वापस 1;
                अगर (find(b - a, i, b, a, '-'))
                    वापस 1;
                अगर (find(a * b, i, a, b, '*'))
                    वापस 1;
                अगर (b != 0) {
                    c = a / b;
                    अगर (find(c, i, a, b, '/'))
                        वापस 1;
                }

                अगर (a != 0) {
                    c = b / a;
                    अगर (find(c, i, b, a, '/'))
                        वापस 1;
                }

                ढेर_ptr--;
                tab[i] = a;
                tab[j] = b;
            }
        }
    }

    वापस 0;
}

पूर्णांक मुख्य(पूर्णांक argc, अक्षर **argv)
{
    पूर्णांक i, res, p;

    अगर (argc < 3) {
        म_लिखो("usage: %s: result numbers...\n"
               "Try to find result from numbers with the 4 basic operations.\n", argv[0]);
        निकास(1);
    }

    p = 1;
    परिणाम = म_से_प(argv[p]);
    म_लिखो("result=%d\n", परिणाम);
    nb_अंक = 0;
    क्रम(i=p+1;i<argc;i++) {
        tab[nb_अंक++] = म_से_प(argv[i]);
    }

    ढेर_ptr = -1;
    res = find(0, 0, 0, 0, ' ');
    अगर (res) {
        क्रम(i=0;i<=ढेर_ptr;i++) {
            म_लिखो("%d %c %d = %d\n",
                   ढेर_res[3*i], ढेर_op[i],
                   ढेर_res[3*i+1], ढेर_res[3*i+2]);
        }
        वापस 0;
    } अन्यथा {
        म_लिखो("Impossible\n");
        वापस 1;
    }
}
