#شامل <stdlib.h>
#شامل <stdio.h>

#تعریف_کرو N 20

صحیح nb_عدد;
صحیح tab[N];
صحیح ڈھیر_ptr;
صحیح ڈھیر_op[N];
صحیح ڈھیر_res[60];
صحیح نتیجہ;

صحیح ڈھونڈو(صحیح n, صحیح i1, صحیح a, صحیح b, صحیح op)
{
    صحیح i, j;
    صحیح c;

    اگر (ڈھیر_ptr >= 0) {
        ڈھیر_res[3*ڈھیر_ptr] = a;
        ڈھیر_op[ڈھیر_ptr] = op;
        ڈھیر_res[3*ڈھیر_ptr+1] = b;
        ڈھیر_res[3*ڈھیر_ptr+2] = n;
        اگر (n == نتیجہ)
            واپس 1;
        tab[i1] = n;
    }

    برائے(i=0;i<nb_عدد;i++) {
        برائے(j=i+1;j<nb_عدد;j++) {
            a = tab[i];
            b = tab[j];
            اگر (a != 0 && b != 0) {

                tab[j] = 0;
                ڈھیر_ptr++;

                اگر (ڈھونڈو(a + b, i, a, b, '+'))
                    واپس 1;
                اگر (ڈھونڈو(a - b, i, a, b, '-'))
                    واپس 1;
                اگر (ڈھونڈو(b - a, i, b, a, '-'))
                    واپس 1;
                اگر (ڈھونڈو(a * b, i, a, b, '*'))
                    واپس 1;
                اگر (b != 0) {
                    c = a / b;
                    اگر (ڈھونڈو(c, i, a, b, '/'))
                        واپس 1;
                }

                اگر (a != 0) {
                    c = b / a;
                    اگر (ڈھونڈو(c, i, b, a, '/'))
                        واپس 1;
                }

                ڈھیر_ptr--;
                tab[i] = a;
                tab[j] = b;
            }
        }
    }

    واپس 0;
}

صحیح مین(صحیح argc, حرف **argv)
{
    صحیح i, res, p;

    اگر (argc < 3) {
        لکھو("usage: %s: result numbers...\n"
               "Try to find result from numbers with the 4 basic operations.\n", argv[0]);
        باہر_نکلو(1);
    }

    p = 1;
    نتیجہ = atoi(argv[p]);
    لکھو("result=%d\n", نتیجہ);
    nb_عدد = 0;
    برائے(i=p+1;i<argc;i++) {
        tab[nb_عدد++] = atoi(argv[i]);
    }

    ڈھیر_ptr = -1;
    res = ڈھونڈو(0, 0, 0, 0, ' ');
    اگر (res) {
        برائے(i=0;i<=ڈھیر_ptr;i++) {
            لکھو("%d %c %d = %d\n",
                   ڈھیر_res[3*i], ڈھیر_op[i],
                   ڈھیر_res[3*i+1], ڈھیر_res[3*i+2]);
        }
        واپس 0;
    } ورنہ {
        لکھو("Impossible\n");
        واپس 1;
    }
}
