#परिभाषय x 3
#परिभाषय f(a) f(x * (a))
#अपरिभाषय x
#परिभाषय x 2
#परिभाषय g f
#परिभाषय z z[0]
#परिभाषय h g(~
#परिभाषय m(a) a(w)
#परिभाषय w 0,1
#परिभाषय t(a) a
#परिभाषय p() पूर्णाङ्क
#परिभाषय q(x) x
#परिभाषय r(x,y) x ## y
#परिभाषय str(x) # x
f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
g(x+(3,4)-w) | h 5) & m
(f)^m(m);
वर्ण c[2][6] = { str(hello), str() };
/*
 * f(2 * (y+1)) + f(2 * (f(2 * (z[0])))) % f(2 * (0)) + t(1);
 * f(2 * (2+(3,4)-0,1)) | f(2 * (~ 5)) & f(2 * (0,1))^m(0,1);
 * char c[2][6] = { "hello", "" };
 */
#परिभाषय L21 f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
#परिभाषय L22 g(x+(3,4)-w) | h 5) & m\
(f)^m(m);
L21
L22
