#تعریف_کړه x 3
#تعریف_کړه f(a) f(x * (a))
#تعریف_لغوه x
#تعریف_کړه x 2
#تعریف_کړه g f
#تعریف_کړه z z[0]
#تعریف_کړه h g(~
#تعریف_کړه m(a) a(w)
#تعریف_کړه w 0,1
#تعریف_کړه t(a) a
#تعریف_کړه p() صحيح
#تعریف_کړه q(x) x
#تعریف_کړه r(x,y) x ## y
#تعریف_کړه str(x) # x
f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
g(x+(3,4)-w) | h 5) & m
(f)^m(m);
حرف c[2][6] = { str(hello), str() };
/*
 * f(2 * (y+1)) + f(2 * (f(2 * (z[0])))) % f(2 * (0)) + t(1);
 * f(2 * (2+(3,4)-0,1)) | f(2 * (~ 5)) & f(2 * (0,1))^m(0,1);
 * char c[2][6] = { "hello", "" };
 */
#تعریف_کړه L21 f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
#تعریف_کړه L22 g(x+(3,4)-w) | h 5) & m\
(f)^m(m);
L21
L22
