#تعریف_کرو x 3
#تعریف_کرو f(a) f(x * (a))
#تعریف_منسوخ x
#تعریف_کرو x 2
#تعریف_کرو g f
#تعریف_کرو z z[0]
#تعریف_کرو h g(~
#تعریف_کرو m(a) a(w)
#تعریف_کرو w 0,1
#تعریف_کرو t(a) a
#تعریف_کرو p() صحیح
#تعریف_کرو q(x) x
#تعریف_کرو r(x,y) x ## y
#تعریف_کرو str(x) # x
f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
g(x+(3,4)-w) | h 5) & m
(f)^m(m);
حرف c[2][6] = { str(hello), str() };
/*
 * f(2 * (y+1)) + f(2 * (f(2 * (z[0])))) % f(2 * (0)) + t(1);
 * f(2 * (2+(3,4)-0,1)) | f(2 * (~ 5)) & f(2 * (0,1))^m(0,1);
 * char c[2][6] = { "hello", "" };
 */
#تعریف_کرو L21 f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
#تعریف_کرو L22 g(x+(3,4)-w) | h 5) & m\
(f)^m(m);
L21
L22
