#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ x 3
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ f(a) f(x * (a))
#ਪਰਿਭਾਸ਼ਾ_ਰੱਦ x
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ x 2
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ g f
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ z z[0]
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ h g(~
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ m(a) a(w)
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ w 0,1
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ t(a) a
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ p() ਪੂਰਨ
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ q(x) x
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ r(x,y) x ## y
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ str(x) # x
f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
g(x+(3,4)-w) | h 5) & m
(f)^m(m);
ਅੱਖਰ c[2][6] = { str(hello), str() };
/*
 * f(2 * (y+1)) + f(2 * (f(2 * (z[0])))) % f(2 * (0)) + t(1);
 * f(2 * (2+(3,4)-0,1)) | f(2 * (~ 5)) & f(2 * (0,1))^m(0,1);
 * char c[2][6] = { "hello", "" };
 */
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ L21 f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ L22 g(x+(3,4)-w) | h 5) & m\
(f)^m(m);
L21
L22
