#ವ್ಯಾಖ್ಯಾನಿಸು x 3
#ವ್ಯಾಖ್ಯಾನಿಸು f(a) f(x * (a))
#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು x
#ವ್ಯಾಖ್ಯಾನಿಸು x 2
#ವ್ಯಾಖ್ಯಾನಿಸು g f
#ವ್ಯಾಖ್ಯಾನಿಸು z z[0]
#ವ್ಯಾಖ್ಯಾನಿಸು h g(~
#ವ್ಯಾಖ್ಯಾನಿಸು m(a) a(w)
#ವ್ಯಾಖ್ಯಾನಿಸು w 0,1
#ವ್ಯಾಖ್ಯಾನಿಸು t(a) a
#ವ್ಯಾಖ್ಯಾನಿಸು p() ಪೂರ್ಣಾಂಕ
#ವ್ಯಾಖ್ಯಾನಿಸು q(x) x
#ವ್ಯಾಖ್ಯಾನಿಸು r(x,y) x ## y
#ವ್ಯಾಖ್ಯಾನಿಸು str(x) # x
f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
g(x+(3,4)-w) | h 5) & m
(f)^m(m);
ಅಕ್ಷರ c[2][6] = { str(hello), str() };
/*
 * f(2 * (y+1)) + f(2 * (f(2 * (z[0])))) % f(2 * (0)) + t(1);
 * f(2 * (2+(3,4)-0,1)) | f(2 * (~ 5)) & f(2 * (0,1))^m(0,1);
 * char c[2][6] = { "hello", "" };
 */
#ವ್ಯಾಖ್ಯಾನಿಸು L21 f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
#ವ್ಯಾಖ್ಯಾನಿಸು L22 g(x+(3,4)-w) | h 5) & m\
(f)^m(m);
L21
L22
