#وصف_ڪريو x 3
#وصف_ڪريو f(a) f(x * (a))
#وصف_رد x
#وصف_ڪريو x 2
#وصف_ڪريو g f
#وصف_ڪريو z z[0]
#وصف_ڪريو h g(~
#وصف_ڪريو m(a) a(w)
#وصف_ڪريو w 0,1
#وصف_ڪريو t(a) a
#وصف_ڪريو p() صحيح
#وصف_ڪريو q(x) x
#وصف_ڪريو r(x,y) x ## y
#وصف_ڪريو str(x) # x
f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
g(x+(3,4)-w) | h 5) & m
(f)^m(m);
حرف c[2][6] = { str(hello), str() };
/*
 * f(2 * (y+1)) + f(2 * (f(2 * (z[0])))) % f(2 * (0)) + t(1);
 * f(2 * (2+(3,4)-0,1)) | f(2 * (~ 5)) & f(2 * (0,1))^m(0,1);
 * char c[2][6] = { "hello", "" };
 */
#وصف_ڪريو L21 f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
#وصف_ڪريو L22 g(x+(3,4)-w) | h 5) & m\
(f)^m(m);
L21
L22
