#నిర్వచించు x 3
#నిర్వచించు f(a) f(x * (a))
#నిర్వచనం_రద్దు x
#నిర్వచించు x 2
#నిర్వచించు g f
#నిర్వచించు z z[0]
#నిర్వచించు h g(~
#నిర్వచించు m(a) a(w)
#నిర్వచించు w 0,1
#నిర్వచించు t(a) a
#నిర్వచించు p() పూర్ణాంకం
#నిర్వచించు q(x) x
#నిర్వచించు r(x,y) x ## y
#నిర్వచించు str(x) # x
f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
g(x+(3,4)-w) | h 5) & m
(f)^m(m);
అక్షరం c[2][6] = { str(hello), str() };
/*
 * f(2 * (y+1)) + f(2 * (f(2 * (z[0])))) % f(2 * (0)) + t(1);
 * f(2 * (2+(3,4)-0,1)) | f(2 * (~ 5)) & f(2 * (0,1))^m(0,1);
 * char c[2][6] = { "hello", "" };
 */
#నిర్వచించు L21 f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
#నిర్వచించు L22 g(x+(3,4)-w) | h 5) & m\
(f)^m(m);
L21
L22
