#घोषणा x 3
#घोषणा f(a) f(x * (a))
#अघोषित x
#घोषणा x 2
#घोषणा g f
#घोषणा z z[0]
#घोषणा h g(~
#घोषणा m(a) a(w)
#घोषणा w 0,1
#घोषणा t(a) a
#घोषणा p() पूर्णांक
#घोषणा q(x) x
#घोषणा r(x,y) x ## y
#घोषणा str(x) # x
f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
g(x+(3,4)-w) | h 5) & m
(f)^m(m);
अक्षर c[2][6] = { str(hello), str() };
/*
 * f(2 * (y+1)) + f(2 * (f(2 * (z[0])))) % f(2 * (0)) + t(1);
 * f(2 * (2+(3,4)-0,1)) | f(2 * (~ 5)) & f(2 * (0,1))^m(0,1);
 * char c[2][6] = { "hello", "" };
 */
#घोषणा L21 f(y+1) + f(f(z)) % t(t(g)(0) + t)(1);
#घोषणा L22 g(x+(3,4)-w) | h 5) & m\
(f)^m(m);
L21
L22
