/* accept 'defined' as result of substitution */

----- 1 ------
#నిర్వచించు AAA 2
#నిర్వచించు BBB
#నిర్వచించు CCC (defined ( AAA ) && AAA > 1 && !defined BBB)
#ఒకవేళ !CCC
OK
#లేకపోతే
NOT OK
#అయితే_ముగింపు

----- 2 ------
#నిర్వచనం_రద్దు BBB
#ఒకవేళ CCC
OK
#లేకపోతే
NOT OK
#అయితే_ముగింపు

----- 3 ------
#నిర్వచించు DEFINED defined
#నిర్వచించు DDD (DEFINED ( AAA ) && AAA > 1 && !DEFINED BBB)
#ఒకవేళ (DDD)
OK
#లేకపోతే
NOT OK
#అయితే_ముగింపు

----- 4 ------
#నిర్వచనం_రద్దు AAA
#ఒకవేళ !(DDD)
OK
#లేకపోతే
NOT OK
#అయితే_ముగింపు

----- 5 ------
పంక్తి __LINE__
#నిర్వచించు __LINE__ # ## #
పంక్తి __LINE__

----- 10 ------
/* preprocessor numbers are (u)intmax_t */
#ఒకవేళ -2147483648 < 0
1 true
#అయితే_ముగింపు
#ఒకవేళ -0x80000000 < 0
2 true
#అయితే_ముగింపు
#ఒకవేళ -9223372036854775808U > 0
3 true
#అయితే_ముగింపు
#ఒకవేళ -0x8000000000000000 > 0 // unsigned by overflow
4 true
#అయితే_ముగింపు
#ఒకవేళ 1 << 31 > 2 && 1 << 32 > 2 && 1 << 63 < 2 && 1U << 63 > 2
5 true
#అయితే_ముగింపు
#ఒకవేళ (1<<29) * 11 >= 1<<32 && defined DDD << 63 < 0
6 true
#అయితే_ముగింపు
