/* accept 'defined' as result of substitution */

----- 1 ------
#ವ್ಯಾಖ್ಯಾನಿಸು AAA 2
#ವ್ಯಾಖ್ಯಾನಿಸು BBB
#ವ್ಯಾಖ್ಯಾನಿಸು CCC (defined ( AAA ) && AAA > 1 && !defined BBB)
#ಆದರೆ !CCC
OK
#ಇಲ್ಲದಿದ್ದರೆ
NOT OK
#ಆದರೆ_ಅಂತ್ಯ

----- 2 ------
#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು BBB
#ಆದರೆ CCC
OK
#ಇಲ್ಲದಿದ್ದರೆ
NOT OK
#ಆದರೆ_ಅಂತ್ಯ

----- 3 ------
#ವ್ಯಾಖ್ಯಾನಿಸು DEFINED defined
#ವ್ಯಾಖ್ಯಾನಿಸು DDD (DEFINED ( AAA ) && AAA > 1 && !DEFINED BBB)
#ಆದರೆ (DDD)
OK
#ಇಲ್ಲದಿದ್ದರೆ
NOT OK
#ಆದರೆ_ಅಂತ್ಯ

----- 4 ------
#ವ್ಯಾಖ್ಯಾನ_ರದ್ದು AAA
#ಆದರೆ !(DDD)
OK
#ಇಲ್ಲದಿದ್ದರೆ
NOT OK
#ಆದರೆ_ಅಂತ್ಯ

----- 5 ------
ಸಾಲು __LINE__
#ವ್ಯಾಖ್ಯಾನಿಸು __LINE__ # ## #
ಸಾಲು __LINE__

----- 10 ------
/* preprocessor numbers are (u)intmax_t */
#ಆದರೆ -2147483648 < 0
1 true
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ -0x80000000 < 0
2 true
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ -9223372036854775808U > 0
3 true
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ -0x8000000000000000 > 0 // unsigned by overflow
4 true
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ 1 << 31 > 2 && 1 << 32 > 2 && 1 << 63 < 2 && 1U << 63 > 2
5 true
#ಆದರೆ_ಅಂತ್ಯ
#ಆದರೆ (1<<29) * 11 >= 1<<32 && defined DDD << 63 < 0
6 true
#ಆದರೆ_ಅಂತ್ಯ
