#अगर_अघोषित _FLOAT_H_
#घोषणा _FLOAT_H_

#घोषणा भग्न_आधार 2

/* IEEE float */
#घोषणा भग्न_पूर्ण 24
#घोषणा भग्न_भग्न 6
#घोषणा FLT_ROUNDS 1
#घोषणा भग्न_अंतर 1.19209290e-07F
#घोषणा FLT_MIN_EXP (-125)
#घोषणा भग्न_न्यून 1.17549435e-38F
#घोषणा FLT_MIN_10_EXP (-37)
#घोषणा FLT_MAX_EXP 128
#घोषणा भग्न_उच्च 3.40282347e+38F
#घोषणा FLT_MAX_10_EXP 38

/* IEEE double */
#घोषणा द्विग_पूर्ण 53
#घोषणा द्विग_भग्न 15
#घोषणा द्विग_अंतर 2.2204460492503131e-16
#घोषणा DBL_MIN_EXP (-1021)
#घोषणा द्विग_न्यून 2.2250738585072014e-308
#घोषणा DBL_MIN_10_EXP (-307)
#घोषणा DBL_MAX_EXP 1024
#घोषणा द्विग_उच्च 1.7976931348623157e+308
#घोषणा DBL_MAX_10_EXP 308

/* horrible intel long double */
#अगर defined __i386__ || defined __x86_64__

#घोषणा द_द्वि_पूर्ण 64
#घोषणा द_द्वि_भग्न 18
#घोषणा द_द्वि_अंतर 1.08420217248550443401e-19L
#घोषणा LDBL_MIN_EXP (-16381)
#घोषणा द_द्वि_न्यून 3.36210314311209350626e-4932L
#घोषणा LDBL_MIN_10_EXP (-4931)
#घोषणा LDBL_MAX_EXP 16384
#घोषणा द_द्वि_उच्च 1.18973149535723176502e+4932L
#घोषणा LDBL_MAX_10_EXP 4932
#घोषणा DECIMAL_DIG 21

#या_अगर defined __aarch64__ || defined __riscv
/*
 * Use values from:
 * gcc -dM -E -xc /dev/null | grep LDBL | sed -e "s/__//g"
 */
#घोषणा द_द्वि_पूर्ण 113
#घोषणा द_द्वि_भग्न 33
#घोषणा द_द्वि_अंतर 1.92592994438723585305597794258492732e-34L
#घोषणा LDBL_MIN_EXP (-16381)
#घोषणा द_द्वि_न्यून 3.36210314311209350626267781732175260e-4932L
#घोषणा LDBL_MIN_10_EXP (-4931)
#घोषणा LDBL_MAX_EXP 16384
#घोषणा द_द्वि_उच्च 1.18973149535723176508575932662800702e+4932L
#घोषणा LDBL_MAX_10_EXP 4932
#घोषणा DECIMAL_DIG 36

#अन्यथा

/* same as IEEE double */
#घोषणा द_द्वि_पूर्ण 53
#घोषणा द_द्वि_भग्न 15
#घोषणा द_द्वि_अंतर 2.2204460492503131e-16L
#घोषणा LDBL_MIN_EXP (-1021)
#घोषणा द_द्वि_न्यून 2.2250738585072014e-308L
#घोषणा LDBL_MIN_10_EXP (-307)
#घोषणा LDBL_MAX_EXP 1024
#घोषणा द_द्वि_उच्च 1.7976931348623157e+308L
#घोषणा LDBL_MAX_10_EXP 308
#घोषणा DECIMAL_DIG 17

#पूर्ण_अगर

#पूर्ण_अगर /* _FLOAT_H_ */
